{"text": "\n\n- Concepts: Vector Indexing\n- Configuration: Indexes\n\n## Introduction\n\nWeaviate supports two types of indices.\n\n1. An **approximate nearest neighbor index (ANN)** - the ANN index is used to serve all vector-search queries.\n1. An **inverted index** - the inverted index allows for filtering by properties, as well as serve BM25 queries.\n\nYou can configure indices in Weaviate per class. One of Weaviate's core strengths is combining the ANN index with an inverted index.\n\nSome things to bear in mind:\n\n* Especially for large datasets, configuring the indices is important because the more you index, the more storage is needed.\n* A rule of thumb -- if you don't query over a specific field or vector space, don't index it.\n* One of Weaviate's unique features is how the indices are configured (learn more about this here).\n\n### ANN indexing\n\nWhat's important to know, is that the \"A\" in ANN (i.e., the \"approximate\") comes with a trade-off. That is, the index is _approximate_ and, therefore _not_ always 100% accurate. This is what the experts mean when they talk about the \"recall of the algorithm.\"\n\nThere are different ANN algorithms, you can find a nice overview of them on this website. Only those algorithms which support CRUD can be used in Weaviate (we want that sweet database UX) and Weaviate's ANN system is completely plug-and-playable so that we can always add other algorithms in the future.\n\n\n\n\nBecause vector search use cases are growing rapidly, more and more ANN-algorithm are produced. A \"good\" ANN algorithm means that the recall is high _and_ that it's fast. You can dive into the rabbit hole right here. But! Don't be like Alice; just make sure to come back here.\n\nLet's take a look a few ANN settings in an example schema.\n\n_(note that we've removed some JSON that's irrelevant to the topic at hand)._\n\n```js\n{\n    \"classes\": [\n        {\n            \"class\": \"Publication\",\n            \"properties\": [],\n            \"vectorIndexType\": \"hnsw\" // \n\nYou can use Weaviate with or without modules. To use Weaviate _with_ modules, you must configure them in the schema.\n\nAn example configuration:\n\n```js\n{\n    \"class\": \"Author\",\n    \"moduleConfig\": { // \n", "type": "Documentation", "name": "concepts-indexing", "path": "developers/weaviate/concepts/indexing.md", "link": "https://weaviate.io/developers/weaviate/concepts/indexing", "timestamp": "2023-11-02 10:52:43", "reader": "JSON", "meta": {}, "chunks": []}