{"text": "\n\n\n\n\n## Overview\n\nThis page explains what vector indices are, and what purpose they serve in Weaviate.\n\n- Concepts: Indexing\n- Configuration: Indexes\n- Configuration: Schema (Configure semantic indexing)\n\n## Introduction\n\nWeaviate's vector-first storage system takes care of all storage operations with a vector index. Storing data in a vector-first manner not only allows for semantic or context-based search, but also makes it possible to store *very* large amounts of data without decreasing performance (assuming scaled well horizontally or having sufficient shards for the indices).\n\n## Why index data as vectors?\nNow, a long list of numbers does not carry any meaning by itself. But if the numbers in this list are chosen to indicate the semantic similarity between the data objects represented by other vectors, then the new vector contains information about the data object's meaning and relation to other data.\n\nTo make this concept more tangible, think of vectors as coordinates in a *n*-dimensional space. For example, we can represent *words* in a 2-dimensional space. If you use an algorithm that learned the relations of words or co-occurrence statistics between words from a corpus (like GloVe), then single words can be given the coordinates (vectors) according to their similarity to other words. These algorithms are powered by Machine Learning and Natural Language Processing concepts. In the picture below, you see how this concept looks (simplified). The words `Apple` and `Banana` are close to each other. The distance between those words, given by the distance between the vectors, is small. But these two fruits are further away from the words `Newspaper` and `Magazine`.\n\n2D Vectors visualization\n\nAnother way to think of this is how products are placed in a supermarket. You'd expect to find `Apples` close to `Bananas`, because they are both fruit. But when you are searching for a `Magazine`, you would move away from the `Apples` and `Bananas`, more towards the aisle with, for example, `Newspapers`. This is how the semantics of concepts can be stored in Weaviate as well, depending on the module you're using to calculate the numbers in the vectors. Not only words or text can be indexed as vectors, but also images, video, DNA sequences, etc. Read more about which model to use here.\n\nSupermarket map visualization\n\n## How to choose the right vector index type\n\nThe first vector-storage type Weaviate supports is HNSW, which is also the default vector index type. Typical for HNSW is that this index type is super fast at query time, but more costly when it comes to the building process (adding data with vectors). If your use case values fast data upload higher than super fast query time and high scalability, then other vector index types may be a better solution (e.g. Spotify's Annoy). If you want to contribute to a new index type, you can always contact us or make a pull request to Weaviate and build your own index type. Stay tuned for updates!\n\n## Configuration of vector index type\n\nThe index type can be specified per data class via the class definition. Currently the only index type is HNSW.\n\nExample of a class vector index configuration in your data schema:\n\n```json\n{\n  \"class\": \"Article\",\n  \"description\": \"string\",\n  \"properties\": [\n    {\n      \"name\": \"title\",\n      \"description\": \"string\",\n      \"dataType\": [\"text\"]\n    }\n  ],\n  \"vectorIndexType\": \" ... \",\n  \"vectorIndexConfig\": { ... }\n}\n```\n\nNote that the vector index type only specifies how the vectors of data objects are *indexed* and this is used for data retrieval and similarity search. How the data vectors are determined (which numbers the vectors contain) is specified by the `\"vectorizer\"` parameter which points to a module such as `\"text2vec-contextionary\"` (or to `\"none\"` if you want to import your own vectors). Learn more about all parameters in the data schema here.\n\n## Can Weaviate support multiple vector index (ANN) types?\n\n* The short answer: _yes_\n* The longer answer: we have a custom implementation of the Hierarchical Navigable Small World (HNSW) algorithm that offers full CRUD-support. In principle, if another ANN algorithm also offers full CRUD support, Weaviate can support it too. If you have suggestions for implementing other ANN index types, please let us know in our forum.\n\n\n## Hierarchical Navigable Small World (HNSW)\nHNSW is the first vector index type Weaviate supports.\n\n### What is HNSW?\nHNSW stands for Hierarchical Navigable Small World. HNSW is an algorithm that works on multi-layered graphs. It is also an index type, and refers to vector indexes that are created using the HNSW algorithm.\n\nConsider this diagram of a search using HNSW.\n\nHNSW layers\n\nAn individual object can exist in more than one layer, but every object in the database is represented in the lowest layer (layer zero in the picture). The layer zero data objects are very well connected to each other. Each layer above the lowest layer has fewer data object, and fewer connections. The data objects in the higher layers correspond to the objects in the lower layers, but each higher layer has exponentially fewer objects than the layer below. The HNSW algorithm takes advantage of the layers to efficiently process large amounts of data.\n\nWhen a search query comes in, the HNSW algorithm finds the closest matching data points in the highest layer. Then, HNSW goes one layer deeper, and finds the closest data points in that layer to the ones in the higher layer. These are teh nearest neighbors. The algorithm searches the lower layer to create a new list of nearest neighbors. Then, HNSW uses the new list and repeats the process on the next layer down. When it gets to the deepest layer, the HNSW algorithm returns the data objects closest to the search query.\n\nSince there are relatively few data objects on the higher layers, HNSW has to search fewer objects. This means HNSW 'jumps' over large amounts of data that it doesn't need to search. When a data store has only one layer, the search algorithm can't skip unrelated objects. It has to search significantly more data objects even though they are unlikely to match.\n\nHNSW is very fast, memory efficient, approach to similarity search. The memory cache only stores the highest layer instead of storing all of the data objects in the lowest layer. When the search moves from a higher layer to a lower one, HNSW only adds the data objects that are closest to the search query. This means HNSW uses a relatively small amount of memory compared to other search algorithms.\n\nHave another look at the diagram; it demonstrates how the HNSW algorithm searches. The blue search vector in the top layer connects to a partial result in layer one. The objects in layer one lead HNSW to the result set in layer zero. HNSW makes three hops through the layers (the dotted blue lines) and skips objects that are unrelated to the search query.\n\n### Distance metrics\n\nAll of the distance metrics Weaviate supports are also supported with the HNSW index type.\n\n## HNSW with compression\n\nHNSW uses memory efficiently. However, you can also use compression to reduce memory requirements even more. Product quantization (PQ) is a technique Weaviate offers that lets you compress a vector so it uses fewer bytes. Since HNSW stores vectors in memory, PQ compression lets you use larger datasets without increasing your system memory.\n\nAn important point to note is that PQ makes tradeoffs between recall, performance, and memory usage. This means that the same configuration that reduces memory requirements may also reduce recall. There are similar trade offs in HNSW without PQ. You can, for example, lower latency at the cost of recall by configuring the `ef` and `maxConnections` parameters. For more information about how to configure HNSW, see Configuration: Indexes .\n\n### What is Product Quantization?\n\nQuantization techniques represent larger vectors with a finite set of smaller vectors. A familiar example is rounding a number to the nearest integer.\n\nProduct quantization is a multi-step quantization technique. The starting vector is represented as a product of smaller vectors that are called 'segments' or 'subspaces.' Then, each segment is quantized independently to create a compressed vector representation.\n\nPQ illustrated\n\nWhen you enable PQ, you should already have about 10,000 to 100,000 vectors loaded per shard. Weaviate divides these initial vectors into segments. After the segments are created, there is a training step to calculate 'centroids' for each segment. By default, Weaviate clusters each segment into 256 centroids. The centroids make up a codebook that Weaviate uses in later steps to compress the vectors. \n\nOnce the codebook is ready, Weaviate uses the id of the closest centroid to compress each vector segment. The new vector representation reduces memory significantly. Imagine a collection where each vector has 768 four byte elements. Before PQ compression, each vector requires `768 x 4 = 3072` bytes of storage. After PQ compression, each vector requires `128 x 1 = 128` bytes of storage. The original representation is almost 24 times as large as the PQ compressed version. (It is not exactly 24x because there is a small amount of overhead for the codebook.)\n\n### Distance calculation and rescoring\n\nWith product quantization distances are then calculated asymmetrically with a query vector with the goal being to keep all the original information in the query vector when calculating distances.\n\nAdditionally as Weaviate has the original vectors stored on disk, rescoring will occur when using product quantization. After HNSW PQ has produced the candidate vectors from a search the original vectors will be fetched from disk improving recall. Rescoring occurs by default.\n\n### Segments\n\nThe PQ `segments` controls the tradeoff between memory and recall. A larger `segments` parameter means higher memory usage and recall. An important thing to note is that the segments must divide evenly the original vector dimension.\n\nBelow is a list segment values for common vectorizer modules:\n\n| Module      | Model                                   | Dimensions | Segments               |\n|-------------|-----------------------------------------|------------|------------------------|\n| openai      | text-embedding-ada-002                  | 1536       | 512, 384, 256, 192, 96 |\n| cohere      | multilingual-22-12                      | 768        | 384, 256, 192, 96      |\n| huggingface | sentence-transformers/all-MiniLM-L12-v2 | 384        | 192, 128, 96           |\n\n### Conversion of an existing Class to use PQ\n\nTo use PQ, we recommend using Weaviate 1.20.5 or higher.\n\nYou can convert an existing class to use product quantization by updating the vector index configuration. It is recommended to run a backup first before enabling if you are in production and may want to roll back.\n\nAs PQ has a training stage, data must already exist in the class prior to enabling. To reduce training times you can also use the `trainingLimit` parameter.\n\n```python\nclient.schema.update_config(\"DeepImage\", {\n  \"vectorIndexConfig\": {\n    \"pq\": {\n      \"enabled\": True,\n      \"trainingLimit\": 100000,\n      \"segments\": 0 # see above section for recommended values\n    }\n  }\n})\n```\n\nTo learn more about other configuration settings for PQ refer to the documentation in Configuration: Indexes\n\nThe command will return immediately and a job will run in the background to convert an index. During this time the index will be read-only. Shard status will return to `READY` after conversion.\n\n```python\nclient.schema.get_class_shards(\"DeepImage\")\n\n[{'name': '1Gho094Wev7i', 'status': 'READONLY'}]\n```\n\nYou can now query and write to the index as normal. Distances may be slightly different due to the effects of quantization.\n\n```python\nclient.query.get(\"DeepImage\", [\"i\"]) \\\n\t.with_near_vector({\"vector\": vector}) \\\n\t.with_additional([\"distance\"]) \\\n\t.with_limit(10).do()\n\n{'data': {'Get': {'DeepImage': [{'_additional': {'distance': 0.18367815},\n     'i': 64437},\n    {'_additional': {'distance': 0.18895388}, 'i': 97342},\n    {'_additional': {'distance': 0.19454134}, 'i': 14852},\n    {'_additional': {'distance': 0.20019263}, 'i': 84393},\n    {'_additional': {'distance': 0.20580399}, 'i': 71091},\n    {'_additional': {'distance': 0.2110992}, 'i': 15182},\n    {'_additional': {'distance': 0.2117207}, 'i': 92370},\n    {'_additional': {'distance': 0.21241724}, 'i': 98583},\n    {'_additional': {'distance': 0.21241736}, 'i': 8064},\n    {'_additional': {'distance': 0.21257097}, 'i': 537}]}}}\n```\n\n### Encoders\nIn the configuration above you can see that you can set the `encoder` object to specify how the codebook centroids are generated. Weaviate’s PQ supports using two different encoders. The default is `kmeans` which maps to the traditional approach used for creating centroid.\n\nAlternatively, there is also the `tile` encoder. This encoder is currently experimental but does have faster import times and better recall on datasets like SIFT and GIST. The `tile` encoder has an additional `distribution` parameter that controls what distribution to use when generating centroids. You can configure the encoder by setting `type` to `tile` or `kmeans` the encoder creates the codebook for product quantization. For more details about configuration please refer to Configuration: Indexes.\n\n\n\n\n", "type": "Documentation", "name": "concepts-vector-index", "path": "developers/weaviate/concepts/vector-index.md", "link": "https://weaviate.io/developers/weaviate/concepts/vector-index", "timestamp": "2023-11-13 10:40:34", "reader": "JSON", "meta": {}, "chunks": []}