{"text": "\n\n## Introduction\n\nA collection describes how a set of data objects are to be stored and indexed in Weaviate. This page includes details related to the collection schema, such as parameters and available configurations.\n\n\n\n\n## Collection object\n\nAn example of a complete collection object including properties:\n\n```json\n{\n  \"class\": \"Article\",                       // The name of the collection in string format\n  \"description\": \"An article\",              // A description for your reference\n  \"vectorIndexType\": \"hnsw\",                // Defaults to hnsw\n  \"vectorIndexConfig\": {\n    ...                                     // Vector index type specific settings, including distance metric\n  },\n  \"vectorizer\": \"text2vec-contextionary\",   // Vectorizer to use for data objects added to this collection\n  \"moduleConfig\": {\n    \"text2vec-contextionary\": {\n      \"vectorizeClassName\": true            // Include the collection name in vector calculation (default true)\n    }\n  },\n  \"properties\": [                           // An array of the properties you are adding, same as a Property Object\n    {\n      \"name\": \"title\",                     // The name of the property\n      \"description\": \"title of the article\",              // A description for your reference\n      \"dataType\": [                         // The data type of the object as described above. When\n                                            //    creating cross-references, a property can have\n                                            //    multiple data types, hence the array syntax.\n        \"text\"\n      ],\n      \"moduleConfig\": {                     // Module-specific settings\n        \"text2vec-contextionary\": {\n          \"skip\": true,                     // If true, the whole property will NOT be included in\n                                            //    vectorization. Default is false, meaning that the\n                                            //    object will be NOT be skipped.\n          \"vectorizePropertyName\": true,    // Whether the name of the property is used in the\n                                            //    calculation for the vector position of data\n                                            //    objects. Default false.\n        }\n      },\n      \"indexFilterable\": true,              // Optional, default is true. By default each property\n                                            //    is indexed with a roaring bitmap index where\n                                            //     available for efficient filtering.\n      \"indexSearchable\": true               // Optional, default is true. By default each property\n                                            //    is indexed with a searchable index for\n                                            //    BM25-suitable Map index for BM25 or hybrid\n                                            //    searching.\n    }\n  ],\n  \"invertedIndexConfig\": {                  // Optional, index configuration\n    \"stopwords\": {\n      ...                                   // Optional, controls which words should be ignored in the inverted index, see section below\n    },\n    \"indexTimestamps\": false,               // Optional, maintains inverted indices for each object by its internal timestamps\n    \"indexNullState\": false,                // Optional, maintains inverted indices for each property regarding its null state\n    \"indexPropertyLength\": false            // Optional, maintains inverted indices for each property by its length\n  },\n  \"shardingConfig\": {\n    ...                                     // Optional, controls behavior of the collection in a\n                                            //    multi-node setting, see section below\n  },\n  \"multiTenancyConfig\": {\"enabled\": true}   // Optional, for enabling multi-tenancy for this\n                                            //    collection (default: false)\n}\n```\n\n## Collection creation\n\n### Mutability\n\nPlease note that only some of the parameters are mutable after creation. Other parameters cannot be changed after collection creation. If you wish to change these parameters, you must delete the collection and create it again.\n\n\n  List of the mutable parameters\n\n- `description`\n- `invertedIndexConfig`\n  - `bm25`\n    - `b`\n    - `k1`\n  - `cleanupIntervalSeconds`\n  - `stopwords`\n    - `additions`\n    - `preset`\n    - `removals`\n- `replicationConfig`\n  - `factor`\n- `vectorIndexConfig`\n  - `dynamicEfFactor`\n  - `dynamicEfMin`\n  - `dynamicEfMax`\n  - `flatSearchCutoff`\n  - `skip`\n  - `vectorCacheMaxObjects`\n  - `pq`\n    - `bitCompression`\n    - `centroids`\n    - `enabled`\n    - `segments`\n    - `trainingLimit`\n    - `encoder`\n      - `type`\n      - `distribution`\n\n\n\nProperties can be added to a collection after creation, but existing properties cannot be modified after creation.\n\n### Auto-schema\n\n\nThe \"Auto-schema\" feature generates a collection definition automatically by inferring parameters from data being added. It is enabled by default, and can be disabled (e.g. in `docker-compose.yml`) by setting `AUTOSCHEMA_ENABLED: 'false'`.\n\nIt will:\n\n* Create a collection if an object is added to a non-existent collection.\n* Add any missing property from an object being added.\n* Infer array datatypes, such as `int[]`, `text[]`, `number[]`, `boolean[]`, `date[]` and `object[]`.\n* Infer nested properties for `object` and `object[]` datatypes (introduced in `v1.22.0`).\n* Throw an error if an object being added contains a property that conflicts with an existing schema type. (e.g. trying to import text into a field that exists in the schema as `int`).\n\nGenerally speaking, we recommend that you disable auto-schema for production use.\n- A manual collection definition will provide more precise control.\n- There is a performance penalty associated with inferring the data structure at import time. This may be a costly operation in some cases, such as complex nested properties.\n\n#### Auto-schema data types\n\nAdditional configurations are available to help the auto-schema infer properties to suit your needs.\n\n* `AUTOSCHEMA_DEFAULT_NUMBER=number` - create `number` columns for any numerical values (as opposed to `int`, etc).\n* `AUTOSCHEMA_DEFAULT_DATE=date` - create `date` columns for any date-like values.\n\nThe following are not allowed:\n* Any map type is forbidden, unless it clearly matches one of the two supported types `phoneNumber` or `geoCoordinates`.\n* Any array type is forbidden, unless it is clearly a reference-type. In this case, Weaviate needs to resolve the beacon and see what collection the resolved beacon is from, since it needs the collection name to be able to alter the schema.\n\n## Available parameters\n\n### `class`\n\nThis is the name of the collection. The name is to start with a **capital letter**. This helps to distinguish collections from primitive data types when the name is used as a property value. Consider these examples using the `dataType` property:\n\n- `dataType: [\"text\"]` is `text`\n- `dataType: [\"Text\"]` is a cross-reference type to a collection named `Text`.\n\nAfter the first letter, collection names may use any GraphQL-compatible characters. The collection name validation regex is `/^[A-Z][_0-9A-Za-z]*$/`.\n\nimport initialCaps from '/_includes/schemas/initial-capitalization.md'\n\n\n\n### `description`\n\nA description of the collection. This is for your reference only.\n\n### `invertedIndexConfig`\n\nThis configures the inverted index for the collection.\n\n### invertedIndexConfig > bm25\n\nThe settings for BM25 are the free parameters `k1` and `b`, and they are optional. The defaults (`k1` = 1.2 and `b` = 0.75) work well for most cases.\n\nThey can be configured per collection, and can optionally be overridden per property:\n\n```js\n{\n  \"class\": \"Article\",\n  // Configuration of the sparse index\n  \"invertedIndexConfig\": {\n    \"bm25\": {\n      \"b\": 0.75,\n      \"k1\": 1.2\n    }\n  },\n  \"properties\": [\n    {\n      \"name\": \"title\",\n      \"description\": \"title of the article\",\n      \"dataType\": [\n        \"text\"\n      ],\n      // Property-level settings override the collection-level settings\n      \"invertedIndexConfig\": {\n        \"bm25\": {\n          \"b\": 0.75,\n          \"k1\": 1.2\n        }\n      },\n      \"indexFilterable\": true,\n      \"indexSearchable\": true,\n    }\n  ]\n}\n```\n\n### `invertedIndexConfig` > stopwords (stopword lists)\n\nThis feature was introduced in `v1.12.0`.\n\n`text` properties may contain words that are very common and don't contribute to search results. Ignoring them speeds up queries that contain stopwords, as they can be automatically removed from queries as well. This speed up is very notable on scored searches, such as `BM25`.\n\nThe stopword configuration uses a preset system. You can select a preset to use the most common stopwords for a particular language. If you need more fine-grained control, you can add additional stopwords or remove stopwords that you believe should not be part of the list. Alternatively, you can create your custom stopword list by starting with an empty (`\"none\"`) preset and adding all your desired stopwords as additions.\n\n```json\n  \"invertedIndexConfig\": {\n    \"stopwords\": {\n      \"preset\": \"en\",\n      \"additions\": [\"star\", \"nebula\"],\n      \"removals\": [\"a\", \"the\"]\n    }\n  }\n```\n\nThis configuration allows stopwords to be configured by collection. If not set, these values are set to the following defaults:\n\n| Parameter | Default value | Acceptable values |\n| --- | --- | --- |\n| `\"preset\"` | `\"en\"` | `\"en\"`, `\"none\"` |\n| `\"additions\"` | `[]` | *any list of custom words* |\n| `\"removals\"` | `[]` | *any list of custom words* |\n\n- If `preset` is `none`, then the collection only uses stopwords from the `additions` list.\n- If the same item is included in both `additions` and `removals`, Weaviate returns an error.\n\nAs of `v1.18`, stopwords are indexed, but are skipped in BM25. Meaning, stopwords are included in the inverted index, but when the BM25 algorithm is applied, they are not considered for relevance ranking.\n\nStopwords can now be configured at runtime. You can use the RESTful API to update the list of stopwords after your data has been indexed.\n\nBelow is an example request on how to update the list of stopwords:\n\n```python\nimport weaviate\n\nclient = weaviate.Client(\"http://localhost:8080\")\n\ncollection_obj = {\n    \"invertedIndexConfig\": {\n        \"stopwords\": {\n            \"preset\": \"en\",\n            \"additions\": [\"where\", \"is\", \"the\"]\n        }\n    }\n}\n\nclient.schema.update_config(\"Article\", collection_obj)\n```\n\n### invertedIndexConfig > indexTimestamps\n\nThis feature was introduced in `v1.13.0`.\n\nTo perform queries that are filtered by timestamps, configure the target collection to maintain an inverted index based on the objects' internal timestamps. Currently the timestamps include `creationTimeUnix` and `lastUpdateTimeUnix`.\n\nTo configure timestamp based indexing, set `indexTimestamps` to `true` in the `invertedIndexConfig` object.\n\n```json\n  \"invertedIndexConfig\": {\n    \"indexTimestamps\": true\n  }\n```\n\n### invertedIndexConfig > indexNullState\n\nThis feature was introduced in `v1.16.0`.\n\nTo perform queries that filter on `null`, configure the target collection to maintain an inverted index that tracks `null` values for each property in a collection .\n\nTo configure `null` based indexing, setting `indexNullState` to `true` in the `invertedIndexConfig` object.\n\n```json\n  \"invertedIndexConfig\": {\n    \"indexNullState\": true\n  }\n```\n\n### invertedIndexConfig > indexPropertyLength\n\nThis feature was introduced in `v1.16.0`.\n\nTo perform queries that filter by the length of a property, configure the target collection to maintain an inverted index based on the length of the properties.\n\nTo configure indexing based on property length, set `indexPropertyLength` to `true` in the `invertedIndexConfig` object.\n\n```json\n  \"invertedIndexConfig\": {\n    \"indexPropertyLength\": true\n  }\n```\n\nUsing these features requires more resources. The additional inverted indices must be created and maintained for the lifetime of the collection.\n\n### `vectorizer`\n\nThe vectorizer (`\"vectorizer\": \"...\"`) can be specified per collection in the schema object. Check the modules page for available vectorizer modules.\n\nYou can use Weaviate without a vectorizer by setting `\"vectorizer\": \"none\"`. This is useful if you want to upload your own vectors from a custom model (see how here), or if you want to create a collection without any vectors.\n\n### `vectorIndexType`\n\nThe `vectorIndexType` parameter controls the type of vector index that is used for this collection. The options are `hnsw` (default) and `flat`.\n\n### `vectorIndexConfig`\n\nThe `vectorIndexConfig` parameter controls the configuration of the vector index. The available parameters depend on the `vectorIndexType` that is used.\n\nSee the vector index configuration page for more details.\n\n### `shardingConfig`\n\nIntroduced in v1.8.0.\n\nThe `\"shardingConfig\"` controls how a collection is sharded and distributed across multiple nodes. All values are optional and default to the following settings:\n\n```json\n  \"shardingConfig\": {\n    \"virtualPerPhysical\": 128,\n    \"desiredCount\": 1,           // defaults to the amount of Weaviate nodes in the cluster\n    \"actualCount\": 1,\n    \"desiredVirtualCount\": 128,\n    \"actualVirtualCount\": 128,\n    \"key\": \"_id\",\n    \"strategy\": \"hash\",\n    \"function\": \"murmur3\"\n  }\n```\n\nThese parameters are explained below:\n\n* `\"desiredCount\"`: *integer, immutable, optional*, defaults to the number of nodes in the cluster. This value controls how many shards should be created for this collection index. The typical setting is that a collection should be distributed across all the nodes in the cluster, but you can explicitly set this value to a lower value. If the `\"desiredCount\"` is larger than the amount of physical nodes in the cluster, then some nodes will contain multiple shards.\n\n* `\"actualCount\"`: *integer, read-only*. Typically matches desired count, unless there was a problem initiating the shards at creation time.\n\n* `\"virtualPerPhysical\"`: *integer, immutable, optional*, defaults to `128`. Weaviate uses virtual shards. This helps in reducing the amount of data moved when resharding.\n\n* `\"desiredVirtualCount\"`: *integer, readonly*. Matches `desiredCount * virtualPerPhysical`\n\n* `\"actualVirtualCount\"`: *integer, readonly*. Like `actualCount`, but for virtual shards, instead of physical.\n\n* `\"strategy\"`: *string, optional, immutable*. Only supports `\"hash\"`. This value controls how Weaviate should decide which (virtual - and therefore physical) shard a new object belongs to. The hash is performed on the field specified in `\"key\"`.\n\n* `\"key\"`: *string, optional, immutable*. Only supports `\"_id\"`. This value controls the partitioning key that is used for the hashing function to determine the target shard. As of now, only the internal id-field (containing the object's UUID) can be used to determine the target shard. Custom keys may be supported at a later point.\n\n* `\"function\"`: *string, optional, immutable*. Only `\"murmur3\"` is supported as a hashing function. It describes the hashing function used on the `\"key\"` property to determine the hash which in turn determines the target (virtual - and therefore physical) shard. `\"murmur3\"` creates a 64bit hash making hash collisions very unlikely.\n\n### `replicationConfig`\n\nReplication configurations can be set using the schema, through the `replicationConfig` parameter.\n\nThe `factor` parameter sets the number of copies of to be stored for objects in this collection.\n\n```json\n{\n  \"class\": \"Article\",\n  \"vectorizer\": \"text2vec-openai\",\n  // highlight-start\n  \"replicationConfig\": {\n    \"factor\": 3,\n  },\n  // highlight-end\n}\n```\n\n### `multiTenancyConfig`\n\n\nThe `multiTenancyConfig` value determines if multi-tenancy is enabled for this collection. If enabled, objects of this collection will be isolated for each tenant. It is disabled by default.\n\nTo enable it, set the `enabled` key to `true`, as shown below:\n\n```json\n{\n  \"class\": \"MultiTenancyClass\",\n  // highlight-start\n  \"multiTenancyConfig\": {\"enabled\": true}\n  // highlight-end\n}\n```\n\n## `properties`\n\nProperties define the data structure of objects to be stored and indexed. For each property in the collection, you must specify at least the name and its dataType.\n\n### `name`\n\nProperty names can contain the following characters: `/[_A-Za-z][_0-9A-Za-z]*/`.\n\n### Property object example\n\nAn example of a complete property object:\n\n```json\n{\n    \"name\": \"title\",                     // The name of the property\n    \"description\": \"title of the article\",              // A description for your reference\n    \"dataType\": [                         // The data type of the object as described above. When creating cross-references, a property can have multiple dataTypes.\n      \"text\"\n    ],\n    \"tokenization\": \"word\",               // Split field contents into word-tokens when indexing into the inverted index. See \"Property Tokenization\" below for more detail.\n    \"moduleConfig\": {                     // Module-specific settings\n      \"text2vec-contextionary\": {\n          \"skip\": true,                   // If true, the whole property is NOT included in vectorization. Default is false, meaning that the object will be NOT be skipped.\n          \"vectorizePropertyName\": true   // Whether the name of the property is used in the calculation for the vector position of data objects. Default false.\n      }\n    },\n    \"indexFilterable\": true,              // Optional, default is true. By default each property is indexed with a roaring bitmap index where available for efficient filtering.\n    \"indexSearchable\": true               // Optional, default is true. By default each property is indexed with a searchable index for BM25-suitable Map index for BM25 or hybrid searching.\n}\n```\n\n### Reserved words\n\nThe following words are reserved and cannot be used as property names:\n\n- `_additional`\n- `id`\n- `_id`\n\nAdditionally, we strongly recommend that you do not use the following words as property names, due to potential conflicts with future reserved words:\n\n- `vector`\n- `_vector`\n\n### `tokenization`\n\nThis feature was introduced in `v1.12.0`.\n\nYou can customize how `text` data is tokenized and indexed in the inverted index. Tokenization influences the results returned by the `bm25` and `hybrid` operators, and `where` filters.\n\nThe tokenization of `text` properties can be customized via the `tokenization` field in the property definition:\n\n```json\n{\n  \"classes\": [\n    {\n      \"class\": \"Question\",\n      \"properties\": [\n        {\n          \"dataType\": [\"text\"],\n          \"name\": \"question\",\n          // highlight-start\n          \"tokenization\": \"word\"\n          // highlight-end\n        },\n      ],\n      ...\n      \"vectorizer\": \"text2vec-openai\"\n    }\n  ]\n}\n```\n\nEach token will be indexed separately in the inverted index. For example, if you have a `text` property with the value `Hello, (beautiful) world`, the following table shows how the tokens would be indexed for each tokenization method:\n\n\n\n\n### Tokenization and search / filtering\n\nTokenization impacts how filters or keywords searches behave. The filter or keyword search query is also tokenized before being matched against the inverted index.\n\nThe following table shows an example scenario showing whether a filter or keyword search would identify a `text` property with value `Hello, (beautiful) world` as a hit.\n\n- **Row**: Various tokenization methods.\n- **Column**: Various search strings.\n\n|                        | `Beautiful` | `(Beautiful)` | `(beautiful)` | `Hello, (beautiful) world` |\n|------------------------|-------------|---------------|---------------|----------------------------|\n| `word` (default)       | ✅          | ✅            | ✅             | ✅                         |\n| `lowercase`            | ❌          | ✅            | ✅             | ✅                         |\n| `whitespace`           | ❌          | ❌            | ✅             | ✅                         |\n| `field`                | ❌          | ❌            | ❌             | ✅                         |\n\nThe `string` data type has been deprecated from Weaviate `v1.19` onwards. Please use `text` instead.\n\n\n  \n    Pre v1.19 tokenization behavior\n  \n\n**Tokenization with `text`**\n\n`text` properties are always tokenized, and by all non-alphanumerical characters. Tokens are then lowercased before being indexed. For example, a `text` property value `Hello, (beautiful) world`, would be indexed by tokens `hello`, `beautiful`, and `world`.\n\nEach of these tokens will be indexed separately in the inverted index. This means that a search for any of the three tokens with the `Equal` operator under `valueText` would return this object regardless of the case.\n\n**Tokenization with `string`**\n\n`string` properties allow the user to set whether it should be tokenized, by setting the `tokenization` collection property.\n\nIf `tokenization` for a `string` property is set to `word`, the field will be tokenized. The tokenization behavior for `string` is different from `text`, however, as `string` values are only tokenized by white spaces, and casing is not altered.\n\nSo, a `string` property value `Hello, (beautiful) world` with `tokenization` set as `word` would be split into the tokens `Hello,`, `(beautiful)`, and `world`. In this case, the `Equal` operator would need the exact match including non-alphanumerics and case (e.g. `Hello,`, not `hello`) to retrieve this object.\n\n`string` properties can also be indexed as the entire value, by setting `tokenization` as `field`. In such a case the `Equal` operator would require the value `Hello, (beautiful) world` before returning the object as a match.\n\n**Default behavior**\n\n`text` and `string` properties default to `word` level tokenization for backward-compatibility.\n\n\n\n### `indexFilterable` and `indexSearchable`\n\nThe `indexInverted` parameter has been deprecated from Weaviate `v1.19` onwards in lieu of `indexFilterable` and `indexSearchable`.\n\nThe `indexFilterable` and `indexSearchable` parameters control whether a property is going to be indexed for filtering and searching, respectively.\n\n- `indexFilterable` enables/disables a Roaring Bitmap index for fast filtering (default: `true`).\n- `indexSearchable` enables/disables a searchable index for BM25-suitable Map index for BM25 or hybrid searching (default: `true`).\n\n## Configure semantic indexing\n\n\n\n\nFor example, this data object,\n\n```js\nArticle = {\n  summary: \"Cows lose their jobs as milk prices drop\",\n  text: \"As his 100 diary cows lumbered over for their Monday...\"\n}\n```\n\nwill be vectorized as:\n\n```md\narticle cows lose their jobs as milk prices drop as his diary cows lumbered over for their monday...\n```\n\nBy default, the calculation includes the  `collection name` and all property `values`, but the property `names` *are not* indexed.\n\nTo configure vectorization behavior on a per-collection basis, use `vectorizeClassName`.\n\nTo configure vectorization on a per-property basis, use `skip` and `vectorizePropertyName`.\n\n### Default distance metric\n\nWeaviate allows you to configure the `DEFAULT_VECTOR_DISTANCE_METRIC` which will be applied to every collection unless overridden individually. You can choose from: `cosine` (default), `dot`, `l2-squared`, `manhattan`, `hamming`.\n\n```python\ncollection_obj = {\n    \"class\": \"Article\",\n    \"vectorIndexConfig\": {\n        \"distance\": \"dot\",\n    },\n}\n\nclient.schema.create_class(collection_obj)\n```\n\n## Related pages\n- Tutorial: Schema\n- How to: Configure a schema\n- References: REST API: Schema\n- Concepts: Data Structure\n\n\n\n\n", "type": "Documentation", "name": "config-refs-schema", "path": "developers/weaviate/config-refs/schema/index.md", "link": "https://weaviate.io/developers/weaviate/config-refs/schema", "timestamp": "2024-02-08 21:21:11", "reader": "JSON", "meta": {}, "chunks": []}