{"text": "\n\n## Overview\n\nThe authorization plugin allows Weaviate to provide differentiated access to users based on their authentication status. Along with allowing or disallowing anonymous access, Weaviate can differentiate between a user who is in the admin list, or on the read-only list.\n\n## Admin list\n\nThe admin list relies on the configured `Authentication Schema` to correctly identify\nthe user. On each request, a check against a pre-configured admin list is done.\nIf the user is contained in this list, they get all permissions. If they aren't,\nthey get none. It is not currently possible to assign only some rights to a specific user.\n\n## Read-only list\n\nOther than a list of admins, it is also possible to specify a list of read-only users.\nThose users have permissions on all `get` and `list` operations, but no other\npermissions.\n\nIf a subject is present on both the admin and read-only list, Weaviate will\nthrow an error on startup due to the invalid configuration.\n\n## Usage\n\nSee this page for how to set up `values.yaml` for authentication & authorization.\n\nConfigure the admin plugin in the configuration yaml like so:\n\n```yaml\nservices:\n  weaviate:\n    ...\n    environment:\n      ...\n      AUTHORIZATION_ADMINLIST_ENABLED: 'true'\n      AUTHORIZATION_ADMINLIST_USERS: 'jane@doe.com,john@doe.com'\n      AUTHORIZATION_ADMINLIST_READONLY_USERS: 'ian-smith,roberta@doe.com'\n```\n\nThe above would enable the plugin and make users `jane@doe.com` and\n`john@doe.com` admins. Additionally, users `ian-smith` and `roberta@doe.com` will have read-only permissions.\n\nAs shown in the above example, any string can be used to identify the user. This depends on what you configured in the authentication settings. For example, OIDC users may be identified by their email address by setting `AUTHENTICATION_OIDC_USERNAME_CLAIM` as `email`, whereas API key-authenticated users may be identified as a plain string such as `ian-smith`.\n\n## RBAC\n\nMore fine-grained Role-Based Access Control (RBAC) coming soon. As of now the\nonly possible distinction is between Admins (CRUD), Read-Only Users and\nentirely unauthorized users.\n\n\n\n\n", "type": "Documentation", "name": "configuration-authorization", "path": "developers/weaviate/configuration/authorization.md", "link": "https://weaviate.io/developers/weaviate/configuration/authorization", "timestamp": "2023-11-13 10:40:38", "reader": "JSON", "meta": {}, "chunks": []}