{"text": "\n## Introduction\n\nWelcome! Working with Weaviate, many of us in the team and the community are exposed to a suite of interesting technologies. They include not only vector databases, but also Docker, Kubernetes, GraphQL, REST and clients in various languages.\n\nThis means that is a wide set of opportunities for you to learn about and contribute to! If you are not sure where, we suggest finding something that overlaps with your interests\n\n## How can I contribute?\n\nThese are just some of the ways that you could apply your skills to the project:\n\n* [Suggesting Enhancements](./suggesting-enhancements.md)\n* [Reporting Bugs](./reporting-bugs.md)\n* [Improving Documentation](./improving-docs.md)\n* [Creating content/apps](./writing-blogs.md)\n\n## Where can I contribute to?\n\nThere are four major GitHub repositories of Weaviate, any of which you can contribute to. This includes:\n\n* [Weaviate](https://github.com/weaviate/weaviate) - Weaviate's \"core\" codebase\n* [Weaviate-io](https://github.com/weaviate/weaviate-io) - official Weaviate documentation\n* [Weaviate Examples](https://github.com/weaviate/weaviate-examples) - apps built using Weaviate\n* [Awesome Weaviate](https://github.com/weaviate/awesome-weaviate) - list of examples and tutorials on how to use Weaviate\n\nIt is important that any contributions such as suggestions or bug reports be made to the correct repository, as they will be otherwise very difficult to understand or integrate.\n\n### Work on existing issues\n\nYou can also contribute by working on existing issues. Check the issues pages in Weaviate's GitHub repositories like the [weaviate core repository](https://github.com/weaviate/weaviate/issues). Consider starting with issues tagged '[good first issues](https://github.com/weaviate/weaviate/labels/good-first-issue)'.\n\n## Background reading\n\nNavigating a new project can be difficult, and it takes time to become acquainted with the codebase. If you haven't yet, we suggest going through the [Weaviate getting started guide](/developers/weaviate/quickstart/index.md).\n\nHere are additional resources that will help you familiarize with Weaviate and its applications:\n\n* [Weaviate Blog](/blog) – a series of blog around Weaviate and the overall vector search space.\n* [Weaviate Newsletter](https://newsletter.weaviate.io) – bi-weekly newsletter with updates on the latest and greatest announcements.\n* [Awesome Weaviate](https://github.com/weaviate/awesome-weaviate) – a list of curated examples and tutorials on how to use Weaviate.\n* [Weaviate Examples](https://github.com/weaviate/weaviate-examples) – a repository of various example projects created by the community. Each example shows a different Weaviate use case. You can add your own examples too!\n* [Weaviate's YouTube Channel](https://www.youtube.com/c/SeMI-and-Weaviate/featured) – podcasts and live demos showcasing Weaviate, and providing insight into the vector search space in general.\n\n## Learn about git / GitHub\n\nLike many other open-source projects, the Weaviate community uses the git/GitHub ecosystem for collaborative development. If you are not familiar with git and GitHub basics, we have a guide on [how to contribute to Weaviate with git and GitHub](./git-and-github.md).\n\nRegardless of your choice, we are very excited to have you be a part of our community. Welcome 🙂.\n", "type": "Documentation", "name": "Contributor-guide Getting-started", "path": "developers/contributor-guide/getting-started/index.md", "link": "https://weaviate.io/developers/contributor-guide/getting-started", "timestamp": "2024-05-08 10:49:03", "reader": "JSON", "meta": {}, "chunks": []}