{"text": "\nHere, you will create a Weaviate Cloud Service (WCS) instance. WCS is a fully managed Weaviate instance that runs in the cloud. It's a great way to get started with Weaviate, as it requires no installation or maintenance.\n\n###  Log in to the WCS Console\n\nGo to the [WCS Console](https://console.weaviate.cloud/) and log in with your credentials. If you don't have an account yet, you can sign up by clicking on the Register here link from the login screen.\n\n###  Create a Weaviate instance\n\nFrom the console, go to the Dashboard and click on the Create cluster button. From the following screen:\n\n- Select the \"Free sandbox\" tab\n- Provide a cluster name\n- Set \"Enable authentication\" to \"Yes\"\n\nClick on the Create button to create your Weaviate instance. The process will take a few minutes.\n\n###  Retrieve your Weaviate instance details\n\nOnce the instance is created, you will be able see its details by clicking on the Details button. Find the cluster URL and the API key.\n\nYou will need these details to connect to your Weaviate instance.\n\n###  Connect to your WCS instance\n\nTo connect to the Weaviate Cloud Service (WCS) instance, you need to use the cluster URL and the API key. You can find these details in the WCS Console.\n\nUse the `connect_to_wcs` function to connect to your WCS instance.\n\n\n\n#### Provide inference API keys\n\nSome Weaviate modules can use inference APIs for vectorizing data or large language model integration. You can provide the API keys for these services to Weaviate at instantiation.\n\nThis course uses OpenAI, so you can provide the OpenAI API key to Weaviate through `headers={\"X-OpenAI-Api-Key\": }` as shown below:\n\n\n\nIf you have completed this, you can skip the next page [Option 2: A local Weaviate instance](./20_create_docker.mdx) and continue with [Communicate with Weaviate](../30_communicate.mdx).\n\n\n", "type": "Documentation", "name": "Create_instance Create_wcs", "path": "developers/academy/py/starter_text_data/101_setup_weaviate/20_create_instance/10_create_wcs.mdx", "link": "https://weaviate.io/developers/academy/py/starter_text_data/setup_weaviate/create_instance/create_wcs", "timestamp": "2024-05-08 10:48:12", "reader": "JSON", "meta": {}, "chunks": []}