{"text": "![Contributor Guide](/img/contributor-guide/Weaviate.jpg)\n\n# Welcome\n\n🎉 First off, thank you for taking the time to contribute! 🎉\n\nWe are delighted to have you here. We are thrilled that you want to contribute to Weaviate core, as together we can make Weaviate even better. We strive to build an engaging community and we encourage you to participate, share your ideas and make friends.\n\n##  Weaviate on GitHub\n\nIf you're using Weaviate or if you like the project, please ⭐ this repository  to show your support!\n\n## Contributor Guide Structure\n\nWe recommend reading through the [Contributors' getting started guide](./getting-started/index.md) first. That includes suggestions on different ways to contribute, as well as how you can make those contributions.\n\nThis guide also includes the following sections on specific areas. You can think of these as more technical, reference guides on each area for contributors.\n- [Weaviate Core](./weaviate-core/index.md)\n- [Weaviate Modules](./weaviate-modules/index.md)\n- [Contextionary](./contextionary/index.md)\n- [Weaviate Clients](./weaviate-clients/index.md)\n\n## Join the Weaviate Community\n\nA lot of community chat happens on the [Weaviate Community Slack](https://weaviate.io/slack), with longer-form discussions taking place on the [forum](https://forum.weaviate.io)\n\nMany members of our community help us by giving feedback, asking questions, or proposing ideas. To get involved in our community, please make sure to familiarize yourself with the project's [Code of Conduct](/service/code-of-conduct).\n\nPlease set your forum or Slack workspace display name to your name. This will make it easier to connect with other community members. Then reach out to members of the community, introduce yourself, and share your ideas/questions. Tell us about your areas of interest and what technologies you are using to build your projects. The more we know about you, the better we will be able to match project requirements to your interests and abilities.\n\nIf at any time you face any difficulties, don't hesitate to reach out in the `#general` channel on our Slack for quick help, or in the [General category of the forum](https://forum.weaviate.io/c/general/4) for more complex issues. Our team and the community will help you solve your problem.\n\n## License\n\nPlease refer to each individual repository for relevant licensing information.\n\n", "type": "Documentation", "name": "Developers Contributor-guide", "path": "developers/contributor-guide/index.md", "link": "https://weaviate.io/developers/contributor-guide", "timestamp": "2024-05-08 10:49:06", "reader": "JSON", "meta": {}, "chunks": []}