{"text": "\n## Introduction\n\nWelcome to the documentation for **Weaviate Cloud Services** (WCS).\n\nDocumentation for Weaviate can be found here.\n\n## About Weaviate Cloud Services (WCS)\n\nWCS is our SaaS (software-as-a-service) solution, providing managed Weaviate instances on the cloud.\n\nWith WCS we aim to provide you with the most convenient Weaviate experience. We do this by reflecting in WCS best practices for running Weaviate on the cloud and managing the underlying infrastructure so you can focus on using Weaviate to add value to your work.\n\n\n\n### Configuration\n\nWCS instances of Weaviate come pre-configured as shown below to reduce the work and time required for you to get up and running.\n\nEach WCS instance is:\n\n- Automatically created with the latest available version of Weaviate.\n- Upgradeable to later versions of Weaviate as they are released.\n- Pre-configured with a set of modules (see the WCS dashboard for the relevant list for your instance).\n  - Not configured with a default vectorizer. So you must specify a vectorizer in the schema if you want Weaviate to vectorize your data.\n- Configured with authentication for security (optional for the sandbox).\n  - We recommend using a Weaviate client for the most convenient experience with authentication.\n- Accessible through the Weaviate Console.\n\n\n  Is it possible to modify WCS instances' configurations?\n\nFor the moment, all WCS instances are pre-configured and are not able to be changed by the user, although this is planned for the future.\n\nIf you require a particular module or configuration that is different to one used by WCS instances, please reach out to us to have a chat about custom deployments.\n\nAlternatively you can also try a self-deployment option with Docker or Kubernetes.\n\n\n\n### WCS vs Weaviate open-source\n\nWeaviate offers the same capabilities regardless of whether you run Weaviate as a self-deployed solution, or through WCS.\n\nThe difference is in how they are configured, hosted and deployed, and who manages them.\n\n## What next?\n\nThe following pages will help you to get started with WCS:\n\n- WCS quickstart\n- User guides for:\n  - Creating a WCS instance\n  - Authentication\n  - WCS Console\n- WCS pricing\n  \n  ## More resources\n\nIf you find something here that doesn't work, or that doesn't make sense, please let us know!\n- File an issue on GitHub\n- Talk to us on the community forum\n- Contact us on Slack\n\n\n\n\n", "type": "Documentation", "name": "developers-wcs", "path": "developers/wcs/index.mdx", "link": "https://weaviate.io/developers/wcs", "timestamp": "2024-02-08 20:21:55", "reader": "JSON", "meta": {}, "chunks": []}