{"text": "The Weaviate community produces a lot of great content including blog posts, tutorials, and demo applications. To help these reach the broader community, we maintain a curated list of these in our Awesome Weaviate repository.\n\nIf you would like to share your own work, we would love to hear from you. We can help it reach the wider Weaviate community, who will in turn benefit from your work.\n\nHere are some ideas and tips on how:\n\n## Write a blog post or tutorial\n\nYou could contribute by writing a blog post, or tutorial relating to Weaviate.\n\nIt could be about anything from your Weaviate journey, concepts you've learnt and used with Weaviate like vector databases, or guides on how to integrate Weaviate with something.\n\nIt can be hosted anywhere. It could be at a well-known platform such as Medium, Dev.to, or HashNode, or somewhere smaller like your own blog.\n\nWe ask of your article to:\n\n* Be freely accessible\n* Use the `weaviate` tag (where applicable)\n* Use code blocks, rather than screenshots of code (for usability)\n\n## Develop a demo app\n\n\nYou could also contribute by creating a demo application that uses Weaviate under the hood. It can be a web app, mobile app or demos showing certain integrations.\n\nWe ask for the app to:\n\n* Be unique\n* Include a descriptive README.md file if possible\n* Disclose the Weaviate module(s) used\n\n## Create a PR when ready\n\nWhen you are ready to share your work, create a pull request in Awesome Weaviate repository.\n\n## Resources\n\n* Tutorials by Weaviate\n* Example Datasets\n* Podcasts by Weaviate\n* Developer Style Guide (FreeCodeCamp)\n\nIf you need help, reach out to us on the Community Forum or Slack.\n", "type": "Documentation", "name": "getting-started-writing-blogs", "path": "developers/contributor-guide/getting-started/writing-blogs.md", "link": "https://weaviate.io/developers/contributor-guide/getting-started/writing-blogs", "timestamp": "2024-02-08 20:21:45", "reader": "JSON", "meta": {}, "chunks": []}