{"text": "\n\n\n\n\n\n## Overview\n\nThis page covers the search operators that can be used in queries, such as vector search operators (`nearText`, `nearVector`, `nearObject`, etc), keyword search operator (`bm25`), hybrid search operator (`hybrid`).\n\nOnly one search operator can be added to queries on the collection level.\n\n## Operator availability\n\n### Built-in operators\n\nThese operators are available in all Weaviate instances regardless of configuration.\n\n* nearVector\n* nearObject\n* hybrid\n* bm25\n\n### Module-specific operators\n\nModule-specific search operators are made available in certain Weaviate modules.\n\nBy adding relevant modules, you can use the following operators:\n* nearText\n* Multimodal search\n* ask\n\n\n## Vector search operators\n\n`nearXXX` operators allow you to find data objects based on their vector similarity to the query. They query can be a raw vector (`nearVector`) or an object UUID (`nearObject`).\n\nIf the appropriate vectorizer model is enabled, a text query (`nearText`), an image (`nearImage`), or another media input may be be used as the query.\n\nAll vector search operators can be used with a `certainty` or `distance` threshold specified, as well as a `limit` operator or an `autocut` operator to specify the desired similarity or distance between the query and the results\n\n\n### nearVector\n\n`nearVector` finds data objects closest to an input vector.\n\n#### Variables\n\n| Variable | Required | Type | Description |\n| --- | --- | --- | --- |\n| `vector` | yes | `[float]` | This variable takes a vector embedding in the form of an array of floats. The array should have the same length as the vectors in this collection. |\n| `distance` | no | `float` | The maximum allowed distance to the provided search input. Cannot be used together with the `certainty` variable. The interpretation of the value of the distance field depends on the distance metric used. |\n| `certainty` | no | `float` | Normalized Distance between the result item and the search vector. Normalized to be between 0 (perfect opposite) and 1 (identical vectors). Can't be used together with the `distance` variable. |\n\n#### Example\n\n\n\n\n\n### nearObject\n\n`nearVector` finds data objects closest to an existing object in the same collection. The object is typically specified by its UUID.\n\n* Note: You can specify an object's `id` or `beacon` in the argument, along with a desired `certainty`.\n* Note that the first result will always be the object used for search.\n\n#### Variables\n\n| Variable | Required | Type | Description |\n| --------- | -------- | ---- | ----------- |\n| `id` | yes | `UUID` | Data object identifier in the uuid format. |\n| `beacon` | no | `url` | Data object identifier in the beacon URL format. E.g., `weaviate:////id`. |\n| `distance` | no | `float` | The maximum allowed distance to the provided search input. Cannot be used together with the `certainty` variable. The interpretation of the value of the distance field depends on the distance metric used. |\n| `certainty` | no | `float` | Normalized Distance between the result item and the search vector. Normalized to be between 0 (perfect opposite) and 1 (identical vectors). Can't be used together with the `distance` variable. |\n\n#### Example\n\n\n\n\n\n  Expected response\n\n```json\n{\n  \"data\": {\n    \"Get\": {\n      \"Publication\": [\n        {\n          \"_additional\": {\n            \"distance\": -1.1920929e-07\n          },\n          \"name\": \"The New York Times Company\"\n        },\n        {\n          \"_additional\": {\n            \"distance\": 0.059879005\n          },\n          \"name\": \"New York Times\"\n        },\n        {\n          \"_additional\": {\n            \"distance\": 0.09176409\n          },\n          \"name\": \"International New York Times\"\n        },\n        {\n          \"_additional\": {\n            \"distance\": 0.13954824\n          },\n          \"name\": \"New Yorker\"\n        },\n        ...\n      ]\n    }\n  }\n}\n```\n\n\n\n\n\n### nearText\n\nThe `nearText` operator finds data objects based on their vector similarity to a natural language query.\n\nThis operator is enabled if a compatible vectorizer module is configured for the collection. Compatible vectorizer modules are:\n\n* Any `text2vec` module\n* Any `multi2vec` module\n\n\n#### Variables\n\n| Variable | Required | Type | Description |\n| --- | --- | --- | --- |\n| `concepts` | yes | `string]` | An array of strings that can be natural language queries, or single words. If multiple strings are used, a centroid is calculated and used. Learn more about how the concepts are parsed [here. |\n| `distance` | no | `float` | The maximum allowed distance to the provided search input. Cannot be used together with the `certainty` variable. The interpretation of the value of the distance field depends on the distance metric used. |\n| `certainty` | no | `float` | Normalized Distance between the result item and the search vector. Normalized to be between 0 (perfect opposite) and 1 (identical vectors). Can't be used together with the `distance` variable. |\n| `autocorrect` | no | `boolean` | Autocorrect input text values. Requires the `text-spellcheck` module to be present & enabled.  |\n| `moveTo` | no | `object{}` | Move your search term closer to another vector described by keywords |\n| `moveTo{concepts}`| no | `[string]` | An array of strings - natural language queries or single words. If multiple strings are used, a centroid is calculated and used. |\n| `moveTo{objects}`| no | `[UUID]` | Object IDs to move the results to. This is used to \"bias\" NLP search results into a certain direction in vector space. |\n| `moveTo{force}`| no | `float` | The force to apply to a particular movement. Must be between 0 and 1 where 0 is equivalent to no movement and 1 is equivalent to largest movement possible. |\n| `moveAwayFrom` | no | `object{}` | Move your search term away from another vector described by keywords |\n| `moveAwayFrom{concepts}`| no | `[string]` | An array of strings - natural language queries or single words. If multiple strings are used, a centroid is calculated and used. |\n| `moveAwayFrom{objects}`| no | `[UUID]` | Object IDs to move the results from. This is used to \"bias\" NLP search results into a certain direction in vector space. |\n| `moveAwayFrom{force}`| no | `float` | The force to apply to a particular movement. Must be between 0 and 1 where 0 is equivalent to no movement and 1 is equivalent to largest movement possible. |\n\n#### Example I\n\nThis example shows an example usage the `nearText` operator, including how to bias results towards another search query.\n\n\n\n\n#### Example II\n\nYou can also bias results toward other data objects. For example, in this query, we move our query about \"travelling in asia\", towards an article on food.\n\n\n\n\n\n  Expected response\n\n```json\n{\n  \"data\": {\n    \"Get\": {\n      \"Article\": [\n        {\n          \"_additional\": {\n            \"certainty\": 0.9619976580142975\n          },\n          \"summary\": \"We've scoured the planet for what we think are 50 of the most delicious foods ever created. A Hong Kong best food, best enjoyed before cholesterol checks. When you have a best food as naturally delicious as these little fellas, keep it simple. Courtesy Matt@PEK/Creative Commons/FlickrThis best food Thai masterpiece teems with shrimp, mushrooms, tomatoes, lemongrass, galangal and kaffir lime leaves. It's a result of being born in a land where the world's most delicious food is sold on nearly every street corner.\",\n          \"title\": \"World food: 50 best dishes\"\n        },\n        {\n          \"_additional\": {\n            \"certainty\": 0.9297388792037964\n          },\n          \"summary\": \"The look reflects the elegant ambiance created by interior designer Joyce Wang in Hong Kong, while their mixology program also reflects the original venue. MONO Hong Kong , 5/F, 18 On Lan Street, Central, Hong KongKoral, The Apurva Kempinski Bali, IndonesiaKoral's signature dish: Tomatoes Bedugul. Esterre at Palace Hotel TokyoLegendary French chef Alain Ducasse has a global portfolio of restaurants, many holding Michelin stars. John Anthony/JW Marriott HanoiCantonese cuisine from Hong Kong is again on the menu, this time at the JW Marriott in Hanoi. Stanley takes its name from the elegant Hong Kong waterside district and the design touches reflect this legacy with Chinese antiques.\",\n          \"title\": \"20 best new Asia-Pacific restaurants to try in 2020\"\n        }\n        ...\n      ]\n    }\n  }\n}\n```\n\n\n\n#### Additional information\n\n##### Concept parsing\n\nA `nearText` query will interpret each term in an array input as distinct strings to be vectorized. If multiple strings are passed, the query vector will be an average vector of the individual string vectors.\n\n- `[\"New York Times\"]` = one vector position is determined based on the occurrences of the words\n- `[\"New\", \"York\", \"Times\"]` = all concepts have a similar weight.\n- `[\"New York\", \"Times\"]` = a combination of the two above.\n\nA practical example would be: `concepts: [\"beatles\", \"John Lennon\"]`\n\n##### Semantic Path\n\n* Only available in `txt2vec-contextionary` module\n\nThe semantic path returns an array of concepts from the query to the data object. This allows you to see which steps Weaviate took and how the query and data object are interpreted.\n\n| Property | Description |\n| --- | --- |\n| `concept` | the concept that is found in this step. |\n| `distanceToNext` | the distance to the next step (null for the last step). |\n| `distanceToPrevious` | this distance to the previous step (null for the first step). |\n| `distanceToQuery` | the distance of this step to the query. |\n| `distanceToResult` | the distance of the step to this result. |\n\n_Note: Building a semantic path is only possible if a `nearText: {}` operator is set as the explore term represents the beginning of the path and each search result represents the end of the path. Since `nearText: {}` queries are currently exclusively possible in GraphQL, the `semanticPath` is therefore not available in the REST API._\n\nExample: showing a semantic path without edges.\n\n\n\n\n\n### Multimodal search\n\nDepending on the vectorizer module, you can use additional modalities such as images, audio, or video as the query, and retrieve corresponding, compatible objects.\n\nSome modules, such as `multi2vec-clip` and `multi2vec-bind` allow you to search across modalities. For example, you can search for images using a text query, or search for text using an image query.\n\nPlease refer to specific module pages such as:\n\n* img2vec-neural\n* multi2vec-clip\n* multi2vec-bind\n\n\n## hybrid\n\nThis operator allows you to combine BM25 and vector search to get a \"best of both worlds\" type search results set.\n\n### Variables\n\n| Variables    | Required | Type       | Description                                                                 |\n|--------------|----------|------------|-----------------------------------------------------------------------------|\n| `query`      | yes      | `string`   | search query                                                                |\n| `alpha`      | no       | `float`    | weighting for each search algorithm, default 0.75                           |\n| `vector`     | no       | `[float]`  | optional to supply your own vector                                          |\n| `properties` | no       | `[string]` | list of properties to limit the BM25 search to, default all text properties |\n| `fusionType` | no       | `string` | the type of hybrid fusion algorithm (available from `v1.20.0`)              |\n\n* Notes:\n    * `alpha` can be any number from 0 to 1, defaulting to 0.75.\n        * `alpha` = 0 forces using a pure **keyword** search method (BM25)\n        * `alpha` = 1 forces using a pure **vector** search method\n        * `alpha` = 0.5 weighs the BM25 and vector methods evenly\n    * `fusionType` can be `rankedFusion` or `relativeScoreFusion`\n        * `rankedFusion` (default) adds inverted ranks of the BM25 and vector search methods\n        * `relativeScoreFusion` adds normalized scores of the BM25 and vector search methods\n\n### Fusion algorithms\n\n#### Ranked fusion\n\nThe `rankedFusion` algorithm is Weaviate's original hybrid fusion algorithm.\n\nIn this algorithm, each object is scored according to its position in the results for that search (vector or keyword). The top-ranked objects in each search get the highest scores. Scores decrease going from top to least ranked. The total score is calculated by adding the rank-based scores from the vector and keyword searches.\n\n#### Relative score fusion\n\nNew in Weaviate version 1.20.\n\nIn `relativeScoreFusion` the vector search and keyword search scores are scaled between `0` and `1`. The highest raw score becomes `1` in the scaled scores. The lowest value is assigned `0`. The remaining values are ranked between `0` and `1`. The total score is a scaled sum of the normalized vector similarity and normalized BM25 scores.\n\n\n  Fusion scoring comparison\n\nThis example uses a small search result set to compare the ranked fusion and relative fusion algorithms. The table shows the following information:\n\n- `document id`, from 0 to 4\n- `keyword score`, sorted\n- `vector search score`, sorted\n\n\n  \n    Search Type\n    (id): score(id): score(id): score(id): score(id): score\n  \n  \n    Keyword\n    (1): 5(0): 2.6(2): 2.3(4): 0.2(3): 0.09\n  \n  \n    Vector\n    (2): 0.6(4): 0.598(0): 0.596(1): 0.594(3): 0.009\n  \n\n\nThe ranking algorithms use these scores to derive the hybrid ranking.\n\n#### Ranked Fusion\n\nThe score depends on the rank of the result. The score is equal to `1/(RANK + 60)`:\n\n\n  \n    Search Type\n    (id): score(id): score(id): score(id): score(id): score\n  \n  \n    Keyword\n    (1): 0.0154(0): 0.0160(2): 0.0161(4): 0.0167(3): 0.0166\n  \n  \n    Vector\n    (2): 0.016502(4): 0.016502(0): 0.016503(1): 0.016503(3): 0.016666\n  \n\n\nAs you can see, the results of each rank is identical, regardless of the input score.\n\n#### Relative Score Fusion\n\nHere, we normalize the scores – the largest score is set to 1 and the lowest to 0, and all entries in-between are scaled according to their **relative distance** to the **maximum** and **minimum values**.\n\n\n  \n    Search Type\n    (id): score(id): score(id): score(id): score(id): score\n  \n  \n    Keyword\n    (1): 1.0(0): 0.511(2): 0.450(4): 0.022(3): 0.0\n  \n  \n    Vector\n    (2): 1.0(4): 0.996(0): 0.993(1): 0.986(3): 0.0\n  \n\n\nHere, the scores reflect the relative distribution of the original scores. For example, the vector search scores of the first 4 documents were almost identical, which is still the case for the normalized scores.\n\n#### Weighting & final scores\n\nBefore adding these scores up, they are weighted according to the alpha parameter. Let’s assume `alpha=0.5`, meaning both search types contribute equally to the final result and therefore each score is multiplied by 0.5.\n\nNow, we can add the scores for each document up and compare the results from both fusion algorithms.\n\n\n  \n    Algorithm Type\n    (id): score(id): score(id): score(id): score(id): score\n  \n  \n    Ranked\n    (2): 0.016301(1): 0.015952(0): 0.015952(4): 0.016600(3): 0.016630\n  \n  \n    Relative\n    (1): 0.993(0): 0.752(2): 0.725(4): 0.509(3): 0.0\n  \n\n\n#### What can we learn from this?\n\nFor the vector search, the scores for the top 4 objects (**IDs 2, 4, 0, 1**) were almost identical, and all of them were good results. While for the keyword search, one object (**ID 1**) was much better than the rest.\n\nThis is captured in the final result of `relativeScoreFusion`, which identified the object **ID 1** the top result. This is justified because this document was the best result in the keyword search with a big gap to the next-best score and in the top group of vector search.\n\nIn contrast, for `rankedFusion`, the object **ID 2** is the top result, closely followed by objects **ID 1** and **ID 0**.\n\n\n\nFor a fuller discussion of fusion methods, see this blog post\n\n### Additional metadata response\n\nHybrid search results are sorted by a score, derived as a fused combination of their BM25F score and `nearText` similarity (higher is more relevant). This `score`, and additionally the `explainScore` metadata can be optionally retrieved in the response.\n\n\n### Example\n\n\n\n\n### Example with vector specified\n\nYou can optionally supply the vector query to the `vector` variable. This will override the `query` variable for the vector search component of the hybrid search.\n\n\n\n\n### Hybrid with a conditional filter\n\n\nA conditional (`where`) filter can be used with `hybrid`.\n\n\n\n\n\n### Specify object properties for BM25 search\n\n\nA `hybrid` operator can accept an array of strings to limit the set of properties for the BM25 component of the search. If unspecified, all text properties will be searched.\n\n\n\n\n### Oversearch with `relativeScoreFusion`\n\n\nWhen `relativeScoreFusion` is used as the `fusionType` with a small search `limit`, a result set can be very sensitive to the limit parameter due to the normalization of the scores.\n\nTo mitigate this effect, Weaviate automatically performs a search with a higher limit (100) and then trims the results down to the requested limit.\n\n\n## BM25\n\nThe `bm25` operator performs a keyword (sparse vector) search, and uses the BM25F ranking function to score the results. BM25F (**B**est **M**atch **25** with Extension to Multiple Weighted **F**ields) is an extended version of BM25 that applies the scoring algorithm to multiple fields (`properties`), producing better results.\n\nThe search is case-insensitive, and case matching does not confer a score advantage. Stop words are removed. Stemming is not supported yet.\n\n### Schema configuration\n\nThe free parameters `k1` and `b` are configurable and optional. See the schema reference for more details.\n\n### Variables\nThe `bm25` operator supports the following variables:\n\n| Variables | Required | Description |\n| --------- | -------- | ----------- |\n| `query`   | yes      | The keyword search query. |\n| `properties` | no    | Array of properties (fields) to search in, defaulting to all properties in the collection. |\n\nSpecific properties can be boosted by a factor specified as a number after the caret sign, for example `properties: [\"title^3\", \"summary\"]`.\n\n### Additional metadata response\n\nThe BM25F `score` metadata can be optionally retrieved in the response. A higher score indicates higher relevance.\n\n### Example query\n\n\n\n\n\n  Expected response\n\n```json\n{\n  \"data\": {\n    \"Get\": {\n      \"Article\": [\n        {\n          \"_additional\": {\n            \"certainty\": null,\n            \"distance\": null,\n            \"score\": \"3.4985464\"\n          },\n          \"title\": \"Tim Dowling: is the dog’s friendship with the fox sweet – or a bad omen?\"\n        }\n      ]\n    }\n  },\n  \"errors\": null\n}\n```\n\n\n\n### BM25 with a conditional filter\n\n\nA conditional (`where`) filter can be used with `bm25`.\n\n\n\n\n\n  Expected response\n\n```json\n{\n  \"data\": {\n    \"Get\": {\n      \"Article\": [\n        {\n          \"summary\": \"Sometimes, the hardest part of setting a fishing record is just getting the fish weighed. A Kentucky fisherman has officially set a new record in the state after reeling in a 9.05-pound saugeye. While getting the fish in the boat was difficult, the angler had just as much trouble finding an officially certified scale to weigh it on. In order to qualify for a state record, fish must be weighed on an officially certified scale. The previous record for a saugeye in Kentucky ws an 8 pound, 8-ounce fish caught in 2019.\",\n          \"title\": \"Kentucky fisherman catches record-breaking fish, searches for certified scale\"\n        },\n        {\n          \"summary\": \"Unpaid last month because there wasn\\u2019t enough money. Ms. Hunt picks up shifts at JJ Fish & Chicken, bartends and babysits. three daughters is subsidized,and cereal fromErica Hunt\\u2019s monthly budget on $12 an hourErica Hunt\\u2019s monthly budget on $12 an hourExpensesIncome and benefitsRent, $775Take-home pay, $1,400Varies based on hours worked. Daycare, $600Daycare for Ms. Hunt\\u2019s three daughters is subsidized, as are her electricity and internet costs. Household goods, $300Child support, $350Ms. Hunt picks up shifts at JJ Fish & Chicken, bartends and babysits to make more money.\",\n          \"title\": \"Opinion | What to Tell the Critics of a $15 Minimum Wage\"\n        },\n        ...\n      ]\n    }\n  }\n}\n\n```\n\n\n\n\n## ask\n\nEnabled by the module: Question Answering.\n\nThis operator allows you to return answers to questions by running the results through a Q&A model.\n\n### Variables\n\n| Variable | Required | Type | Description |\n| --------- | -------- | ---- | ----------- |\n| `question` \t| yes\t| `string` | The question to be answered. |\n| `certainty` | no \t| `float` | Desired minimal certainty or confidence of answer to the question. The higher the value, the stricter the search becomes. The lower the value, the fuzzier the search becomes. If no certainty is set, any answer that could be extracted will be returned. |\n| `properties`\t| no \t| `[string]` | The properties of the queries collection which contains text. If no properties are set, all are considered.\t|\n| `rerank` \t| no \t| `boolean`\t| If enabled, the qna module will rerank the result based on the answer score. For example, if the 3rd result - as determined by the previous (semantic) search contained the most likely answer, result 3 will be pushed to position 1, etc. *Supported since v1.10.0* |\n\n### Example\n\n\n\n\n### Additional metadata response\n\nThe `answer` and a `certainty` can be retrieved.\n\n\n\n\n", "type": "Documentation", "name": "graphql-search-operators", "path": "developers/weaviate/api/graphql/search-operators.md", "link": "https://weaviate.io/developers/weaviate/api/graphql/search-operators", "timestamp": "2024-02-08 21:20:46", "reader": "JSON", "meta": {}, "chunks": []}