{"text": "\n\n## Overview\n\nThe WCS GraphQL console is a browser-based GraphQL IDE that allows you to interactively query your Weaviate instance, whether it is a WCS instance or not.\n\nThe console is based on the GraphiQL library, and as such provides many helpful features for using GraphQL, such as:\n\n* Syntax highlighting\n* Intelligent type ahead of fields, arguments, types, and more\n* Real-time error highlighting and reporting for queries and variables\n* Automatic query and variables completion\n\nThe image below shows an example `Get` query on a dataset of wine reviews:\n\n\n\nNote that here, the console handily highlights the query as well as the response.\n\n## Using the console\n\n### Log in\n\nYou can find the GraphQL console by navigating to your WCS Dashboard, logging in and clicking on the button highlighted below:\n\n\n\nThis will open the GraphQL console, from which you can build a GraphQL query, using context-aware query and variables completion.\n\n### Select an instance\n\nThe GraphQL console can connect to any Weaviate instance, including external instances, as long as it is connected through the WCS Dashboard.\n\nIn this example, the WCS Dashboard is connected to an external instance as well as the two WCS instances.\n\n\n\nHere, the GraphQL console can be used to query any of the three instances.\n\nClicking the `Query` button for any of the associated instances will open a console window for that particular instance.\n\nAlternatively, the query window includes a drop-down menu at the top of the screen which can be used to choose the desired instance.\n\n\n\n\n### Authentication\n\nIf you are querying a WCS instance that you own through the WCS console, your queries will automatically include the appropriate authentication information in the header.\n\nThis is the case for both WCS sandboxes as well as managed clusters.\n\n### Inference key(s)\n\nIf you need to provide any inference service API keys for modules such as `text2vec-cohere`, `text2vec-cohere`, or `text2vec-openai`, you can do so through the \"Header\" tab located towards the bottom of the query screen. An example is shown below, where the `X-OpenAI-Api-Key` header has been set with the OpenAI API key (actual value hidden).\n\n\n\nThe header can contain multiple keys if needed (e.g. if `text2vec-cohere` is used with `generative-openai`).\n\nThe image below shows the syntax to do so (you must provide the actual values).\n\n\n\nIf you are having any issues providing additional headers on a WCS instance, check that your Weaviate server version is `1.18.3` or higher. We added a fix in v1.18.3 which might affect this capability.\n\n## More resources\n\n### Read more\n\n- GraphiQL library\n- Vectorizer modules (e.g. Cohere / HuggingFace / OpenAI)\n\n\n\n", "type": "Documentation", "name": "guides-console", "path": "developers/wcs/guides/console.mdx", "link": "https://weaviate.io/developers/wcs/guides/console", "timestamp": "2023-11-02 10:52:09", "reader": "JSON", "meta": {}, "chunks": []}