{"text": "\n## &nbsp;&nbsp;What is a vector?\n\nimport ReactPlayer from 'react-player/lazy'\n\n\n\n\nWe've covered that Weaviate is a vector database, and that a vector search is similarity-based. But, what is a vector?\n\nA vector in this context is just a series of numbers like `[1, 0]` or `[0.513, 0.155, 0.983, ..., 0.001, 0.932]`. Vectors like these are used to capture meaning.\n\nThis might seem like an odd concept. But in fact, you may have already used vectors to capture meaning without realizing it. If you have tried photo editing, or used MS Paint you might have encountered the RGB color system.\n\n### &nbsp;&nbsp;How do numbers represent meaning?\n\nThe RGB system uses groups of three numbers to represent colors. For example:\n\n- (255, 0, 0) = red\n- (80, 200, 120) = emerald\n\nIn these examples, each number can be thought of as a dial for how red, green or blue a color is.\n\nNow, imagine having hundreds, or even thousands, of these dials. That’s how vectors are used to represent meaning. Modern machine learning models such as GPT-x, or those used with Weaviate, use vectors to represent some \"essence\", or \"meaning\" of objects. This can be done for any object type, such as text, code, images, videos and more.\n\n## &nbsp;&nbsp;Vector embeddings in Weaviate\n\n -->\n\nThe vector representation of an object's meaning is called a \"vector embedding\".\n\nWeaviate enables vector searches by indexing and storing data objects and their corresponding vector embeddings. The vector embeddings come from machine learning models.\n\nIn plain terms, Weaviate processes and organizes your data in such a way that objects can be retrieved based on their similarity to a query. To perform these tasks at speed, Weaviate does two things that traditional databases do not. Weaviate:\n\n- Quantifies similarity\n- Indexes vector data\n\nThese operations enable Weaviate to do what it does.\n\n### &nbsp;&nbsp;Quantifying similarity\n\nAs we've mentioned, vector searches are similarity-based, but what does that actually mean? How do we determine that two pieces of data are \"similar\"? What does it mean for two pieces of text, two images, or two objects in general, to be similar?\n\nThis is a relatively simple idea that is actually incredibly interesting and intricate once we start to dive into the details.\n\nBut for now, you should know that machine learning (ML) models are the key to this whole process. The ML models that power vector searches share similarities with those that generate text responses from prompts. Instead of generating new text, these (vectorizer) models capture the \"meaning\" of text or other media. We will cover this in more detail later on.\n\n### &nbsp;&nbsp;Indexing (vector) data\n\nVector searches can be very intensive computationally.\n\nTo overcome this problem, Weaviate uses a combination of indexes including an approximate nearest neighbor (ANN) index and an inverted index. The ANN index lets Weaviate perform extremely fast vector searches. The inverted index lets Weaviate filter data using Boolean criteria.\n\nWe will get into this in more detail later - but for now, it's enough to know that Weaviate can perform fast vector searches as well as filtering.\n\n## &nbsp;&nbsp;Review\n\nIn this section, you learned about what vectors are and how Weaviate utilizes them at a very high level. You have also been introduced to two of Weaviate's key capabilities that help it to enable vector search at speed.\n\n### &nbsp;&nbsp;Review exercise\n\nCan you describe, in your own words, what vectors are?\n\n\n\n### &nbsp;&nbsp;Key takeaways\n\n- A vector is a series of numbers that capture the meaning or essence of objects.\n- Machine learning models help quantify similarity between different objects, which is essential for vector searches.\n- Weaviate uses a combination of approximate nearest neighbor (ANN) index and an inverted index to perform fast vector searches with filtering.\n\n\n\n\nimport Quiz from '/src/components/Academy/quiz.js'\nconst howWeaviateWorks = [{\n  questionText: 'Which of these statements are true?',\n  answerOptions: [\n    {\n      answerText: 'Weaviate has no way of quantifying similarity between objects.',\n      isCorrect: false,\n      feedback: 'Weaviate performs vector searches, which is similarity-based.',\n    },\n    {\n      answerText: 'The only type of index in Weaviate is the vector index.',\n      isCorrect: false,\n      feedback: 'In addition to the vector index, Weaviate uses an inverted index.',\n    },\n    {\n      answerText: 'Weaviate is a machine learning model.',\n      isCorrect: false,\n      feedback: 'While Weaviate can be used with a variety of different models which help it determine object similarity, it is itself not a machine learning model. Weaviate is a vector database.',\n    },\n    {\n      answerText: 'None of the above',\n      isCorrect: true,\n      feedback: 'All of these are false!',\n    },\n  ]\n}];\n", "type": "Documentation", "name": "hello_weaviate-overview_vectors", "path": "developers/academy/zero_to_mvp/101_hello_weaviate/15_overview_vectors.mdx", "link": "https://weaviate.io/developers/academy/zero_to_mvp/hello_weaviate/overview_vectors", "timestamp": "2024-02-08 20:21:09", "reader": "JSON", "meta": {}, "chunks": []}