{"text": "\n\n## &nbsp;&nbsp;Overview\n\nimport ReactPlayer from 'react-player/lazy'\n\n\n\n\n## &nbsp;&nbsp;Options for running Weaviate\n\nWeaviate Cloud Services (WCS) is a managed service that runs Weaviate for you. You can also manage your own Weaviate instances using Docker, Kubernetes, or Embedded Weaviate.\n\nNo matter how you run Weaviate, the underlying code is identical. However, there are some operational differences to be aware of.\n\n### &nbsp;&nbsp;WCS (Recommended)\n\nWCS, or Weaviate Cloud Services, is a managed SaaS service that requires no maintenance at your end.\n\nAs it is managed by Weaviate (the company - the software is not sentient... *yet*). WCS is the fastest way to create a new instance of Weaviate and requires the least amount of effort for users.\n\nWCS has Weaviate instances that are pre-configured for your convenience. They include a number of Weaviate modules by default. They also have built-in support for user authentication.\n\nWCS includes a free \"sandbox\" tier. The WCS sandbox is our recommended method of running Weaviate in this course.\n\n### &nbsp;&nbsp;Docker and Kubernetes\n\nYou can run Weaviate instances using containerization solutions such as Docker and Kubernetes.\n\nRunning your own instance provides you with the same Weaviate code base as a WCS instance, but you have to manage configuration and deployment yourself.\n\nThis course doesn't cover self-managed instances. We will cover Docker and Kubernetes in separate course units in the future.\n\nIf you are familiar with either solution and want to use them to install Weaviate now, see the documentation for Docker-Compose or Kubernetes.\n\n### &nbsp;&nbsp;Embedded Weaviate\n\nWe also have an experimental feature called Embedded Weaviate, where you can directly instantiate a Weaviate database from a client library.\n\nCurrently, Embedded Weaviate is only recommended for evaluation purposes.\n\n## &nbsp;&nbsp; Get started with WCS\n\n### &nbsp;&nbsp; Sign in to WCS\n\n1. To access WCS, go to the Weaviate Cloud Console\n\n1. If you don't have a WCS account, click on the \"Register\" button to create a new account.\n\n1. Click on \"Sign in with the Weaviate Cloud Services\" and sign in with your WCS username and password.\n\n### &nbsp;&nbsp; Create a Weaviate Cluster\n\nTo create a new Weaviate Cluster, click the \"Create cluster\" button.\n\nOn the Create a Cluster page:\n\n1. Select the **Free sandbox** plan tier.\n1. Provide a *cluster name*. The sandbox URL is based on the cluster-name. WCS adds a suffix to ensure uniqueness.\n1. Set the `Enable Authentication?` option to `YES`.\n1. Press **Create** to create your sandbox instance. Note that the sandbox will expire after a set number of days.\n\n\n\nThis starts the process to create a new instance. WCS displays a progress indicator while the sandbox builds.\n\n\n\nInstance creation takes a minute or two. WCS displays a checkmark (✔️) next to your sandbox when the instance is ready.\n\n\n  Sandbox expiration & options\n\n\n\n\n\n\nThere are several ways to work with your sandbox.\n\n- Client libraries\n- RESTful API\n- GraphQL API\n\n## &nbsp;&nbsp;Install Weaviate client\n\nFor the initial release of Weaviate Academy units, our materials are written around Python examples.\nWe are working to add examples for other client languages, starting with TypeScript. We appreciate your patience as we build up our educational material.\n\n### &nbsp;&nbsp;Available clients\n\nCurrently, Weaviate clients are available in:\n\n-  Python\n-  TypeScript\n-  Java\n-  Go\n\n### &nbsp;&nbsp;Client capabilities\n\nimport ClientCapabilitiesOverview from '/_includes/client.capabilities.mdx'\n\n\n\n### &nbsp;&nbsp;Installation\n\nInstall your preferred client by following the relevant instructions below:\n\n\n\n\n## &nbsp;&nbsp;Review\n\n### &nbsp;&nbsp;Review exercise\n\n\n\n\n\n\n\n### &nbsp;&nbsp;Key takeaways\n\n- There are multiple ways to run Weaviate.\n- The recommended, easiest way to run a Weaviate instance is with WCS.\n- Weaviate clients are available in multiple languages.\n- Currently, the Academy material is available in Python only.\n\n\n\n\nimport Quiz from '/src/components/Academy/quiz.js'\nconst instanceOptions = [{\n  questionText: 'Which of the following is not true?',\n  answerOptions: [\n    {\n      answerText: 'We recommend using WCS for Weaviate Academy.',\n      isCorrect: false,\n      feedback: 'WCS *is* our recommended option for running Weaviate.',\n    },\n    {\n      answerText: 'The newest versions of Weaviate are available for WCS and locally hosted instances.',\n      isCorrect: false,\n      feedback: 'You can run the latest version of Weaviate anywhere, on Docker/Kubernetes or WCS.',\n    },\n    {\n      answerText: 'This unit will cover Docker/Kubernetes deployment.',\n      isCorrect: true,\n      feedback: 'That topic will be discussed in a later unit.',\n    },\n  ]\n}];\nconst wcsSetup = [{\n  questionText: 'Which of the following is necessary to configure a Weaviate instance for Weaviate Academy exercises?',\n  answerOptions: [\n    {\n      answerText: 'A paid instance of WCS.',\n      isCorrect: false,\n      feedback: 'A free (sandbox) tier is sufficient for Weaviate Academy.',\n    },\n    {\n      answerText: 'OpenID Connect (OIDC) authentication.',\n      isCorrect: false,\n      feedback: 'You are welcome to use OIDC, but it is not necessary.',\n    },\n    {\n      answerText: 'A self-hosted Docker or Kubernetes instance.',\n      isCorrect: false,\n      feedback: 'You are welcome to use a self-hosted instance, but it is not necessary.',\n    },\n    {\n      answerText: 'None of the above are necessary.',\n      isCorrect: true,\n      feedback: 'Looks like you are ready to move on 😊.',\n    },\n  ]\n}];\nconst clientCapabilities = [{\n  questionText: 'Which of the following is not true about Weaviate clients?',\n  answerOptions: [\n    {\n      answerText: 'Weaviate clients are available for Python, TypeScript/JavaScript, Go and Java.',\n      isCorrect: false,\n      feedback: 'Clients are currently available for each of these languages.',\n    },\n    {\n      answerText: 'There is only a small subset of GraphQL queries that Weaviate clients cannot perform.',\n      isCorrect: false,\n      feedback: 'These clients can perform all RESTful and GraphQL requests.',\n    },\n    {\n      answerText: 'Weaviate clients come bundled with Weaviate.',\n      isCorrect: true,\n      feedback: 'The appropriate client must be installed separately for each language.',\n    },\n  ]\n}];\n", "type": "Documentation", "name": "hello_weaviate-set_up", "path": "developers/academy/zero_to_mvp/101_hello_weaviate/40_set_up.mdx", "link": "https://weaviate.io/developers/academy/zero_to_mvp/hello_weaviate/set_up", "timestamp": "2024-02-08 21:19:47", "reader": "JSON", "meta": {}, "chunks": []}