{"text": "Embedded Weaviate is **experimental** software. APIs and parameters may change.\n\n\nEmbedded Weaviate is a new deployment model that runs a Weaviate instance from your application code rather than from a stand-alone Weaviate server installation.\n\nWhen Embedded Weaviate starts for the first time, it creates a permanent datastore in the location set in your `persistence_data_path`. When your client exits, the Embedded Weaviate instance also exits, but the data persists . The next time the client runs, it starts a new instance of Embedded Weaviate. New Embedded Weaviate instances use the data that is saved in the datastore.\n\n## Start an Embedded Weaviate instance\n\n\n\nWhen you exit the client, the Embedded Weaviate instance also exits.\n\n## Configuration options\n\nTo configure Embedded Weaviate, set these variables in your instantiation code or pass them as parameters when you invoke your client. You can also pass them as system environment variables. All parameters are optional.\n\n| Parameter | Type | Default | Description |\n| :-- | :-- | :-- | :-- |\n| `additional_env_vars` | string | None. | Pass additional environment variables, such as API keys, to the server. |\n| `binary_path` | string | varies | Binary download directory. If the binary is not present, the client downloads the binary.  If `XDG_CACHE_HOME` is set, the default is: `XDG_CACHE_HOME/weaviate-embedded/`If `XDG_CACHE_HOME` is not set, the default is: `~/.cache/weaviate-embedded` |\n| `hostname` | string | 127.0.0.1 | Hostname or IP address  |\n| `persistence_data_path` | string | varies | Data storage directory. If `XDG_DATA_HOME` is set, the default is: `XDG_DATA_HOME/weaviate/`If `XDG_DATA_HOME` is not set, the default is: `~/.local/share/weaviate` |\n| `port` | integer | 8079 | The Weaviate server request port. |\n| `version` | string | Latest stable | Specify the version with one of the following:-`\"latest\"`- The version number as a string: `\"1.19.6\"`- The URL of a Weaviate binary ([See below](/developers/weaviate/installation/embedded.md#file-url)) |\n\nThe `XDG_DATA_HOME` and `XDG_CACHE_HOME` environment variables are widely used system variables. If you modify them, you may break other applications.\n\n## Default modules\n\nThe following modules are enabled by default:\n- `generative-openai`\n- `qna-openai`\n- `ref2vec-centroid`\n- `text2vec-cohere`\n- `text2vec-huggingface`\n- `text2vec-openai`\n\nTo enabled additional modules, add them to your instantiation code.\n\nFor example, to add the `backup-s3` module, instantiate your client like this:\n\n\n\n## Binary sources\n\nWeaviate core releases include executable Linux binaries. When you instantiate an Embedded Weaviate client, the client checks for local copies of the binary packages. If the client finds the binary files, it runs them to create a temporary Weaviate instance. If not, the client downloads the binaries and saves them in your `binary_path` directory.\n\nThe Embedded Weaviate instance goes away when your client exits. However, the client does not delete the binary files. The next time your client runs, it checks for the binaries and uses the saved binaries if they exist.\n\n### File list\nFor a list of the files that are included in a release, see the Assets section of the Release Notes page for that release on [GitHub](https://github.com/weaviate/weaviate/releases).\n\n### File URL\nTo get the URL for a particular binary archive file, follow these steps:\n1. Find the Weaviate core release you want on the [Release Notes](/developers/weaviate/release-notes/index.md#weaviate-core-release-summaries) page.\n1. Click to the release notes for that version. The Assets section includes `linux-amd64` and `linux-arm64` binaries in `tar.gz` format.\n1. Copy the link to the full URL of the `tar.gz` file for your platform.\n\nFor example, the URL for the Weaviate `1.19.6` `AMD64` binary is:\n\n`https://github.com/weaviate/weaviate/releases/download/v1.19.6/weaviate-v1.19.6-linux-amd64.tar.gz`.\n\n## Functional overview\n\nWeaviate core usually runs as a stand-alone server that clients connect to in order to access data. An Embedded Weaviate instance is a process that runs in conjunction with a client script or application. Embedded Weaviate instances can access a persistent datastore, but the instances exit when the client exits.\n\nWhen your client runs, it checks for a stored Weaviate binary. If it finds one, the client uses that binary to create an Embedded Weaviate instance. If not, the client downloads the binary.\n\nThe instance also checks for an existing data store. Clients reuse the same data store, updates persist between client invocations.\n\nWhen you exit the client script or application, the Embedded Weaviate instance also exits:\n\n- Scripts: The Embedded Weaviate instance exits when the script exits.\n- Applications: The Embedded Weaviate instance exits when the application exits.\n- Jupyter Notebooks: The Embedded Weaviate instance exits when the Jupyter notebook is no longer active.\n\n## Embedded server output\n\nThe embedded server pipes `STDOUT` and `STDERR` to the client. To redirect `STDERR` in a command terminal, run your script like this:\n\n```bash\npython3 your_embedded_client_script.py 2>/dev/null\n```\n\n## Supported Environments\n\nEmbedded Weaviate is supported on Linux and macOS.\n\n## Client languages\n\nEmbedded Weaviate is supported for Python and TypeScript clients.\n\n### Python clients\n\n[Python](../client-libraries/python/index.md) v3 client support is new in `v3.15.4` for Linux and `v3.21.0` for macOS. The Python client v4 requires server version v1.23.7 or higher.\n\n### TypeScript clients\n\nThe embedded TypeScript client is no longer a part of the standard TypeScript client.\n\nThe embedded client has additional dependencies that are not included in the standard client. However, the embedded client extends the original TypeScript client so after you instantiate an Embedded Weaviate instance, the embedded TypeScript client works the same way as the standard client.\n\nTo install the embedded TypeScript client, run this command:\n\n```\nnpm install weaviate-ts-embedded\n```\n\nThe TypeScript clients are in these GitHub repositories:\n- [Embedded TypeScript client](https://github.com/weaviate/typescript-embedded)\n- [Standard TypeScript client](https://github.com/weaviate/typescript-client)\n\n\n", "type": "Documentation", "name": "Installation Embedded", "path": "developers/weaviate/installation/embedded.md", "link": "https://weaviate.io/developers/weaviate/installation/embedded", "timestamp": "2024-05-08 10:50:05", "reader": "JSON", "meta": {}, "chunks": []}