{"text": "\nimport ReactPlayer from 'react-player/lazy'\n\n## Overview\n\n\n\nYou can use AWS Marketplace to directly launch a Weaviate cluster.\n\nWe use an AWS CloudFormation template for delivery.\n\n- An AWS account with sufficient credit / payment method.\n- (Recommended) Familiarity with AWS and the AWS console.\n\n\n  \n    What resources are used & installed?\n  \n\nThis will set up the following resources:\n- EKS Cluster with a Single Node Group\n    - In the default VPC or a fresh VPC with CIDR 10.0.0.0/16\n- Load Balancer Controller for EKS\n- aws-ebs-csi-driver for EKS\n- The latest selected version of Weaviate (e.g. `1.20.3` if you select `1.20`)\n    - This will be installed using our official Helm chart\n\n\n\n## Installation instructions\n\n### Video\n\nIf you prefer to follow along with a video, you can watch the following video. Please note that it was recorded in September 2023, and some details may have changed since then.\n\n\n\n\n### AWS Marketplace\n\n1. Go to Weaviate's AWS Marketplace listing\n1. Subscribe to the product in AWS Marketplace by following the instructions on the page. At the time of writing (August 2023), the steps are to:\n    1. Click Continue to Subscribe, then go to the next page\n    1. Click Continue to Configuration, then go to the next page\n    1. Select the fulfillment option & software version from the list. Then click Continue to Launch.\n1. Launch the software using a CloudFormation template (select the one for your preferred availability zone in the table below):\n\n| Region | CloudFormation template link (per Availability Zone) |\n| --- | --- |\n| AP | ap-northeast-1; ap-northeast-2; ap-northeast-3; ap-south-1; ap-southeast-1; ap-southeast-2 |\n| CA | ca-central-1 |\n| EU | eu-central-1; eu-north-1; eu-west-1; eu-west-2; eu-west-3 |\n| SA | sa-east-1 |\n| US | us-east-1; us-east-2; us-west-1; us-west-2 |\n\n### Configuration & Cluster creation\n\n#### Some settings may not be changed after launch\n\nNot all settings may be changed after launch. For example, these settings are currently not changeable after launch:\n- weaviatePVCSize\n- albDriver\n- ebsDriver\n- vpcUseDefault\n\n#### Some settings may lead to recreation of the cluster\n\n- Changes to the instance type will lead to recreation of the node pool.\n\n#### Suggested configurations\n\n- The default values should be suitable for a majority of cases.\n- `weaviatePVCSize`: For production environments, at least 500GB per StatefulSet pod is recommended. (Smaller disks may be sufficient for dev environments.)\n- `weaviateAuthType`: We recommend not running Weaviate with anonymous access. We suggest setting it to `apikey` and setting a key, for example by executing `pwgen -A -s 32` to generate a random string.\n\nOnce you open the CloudFormation template, you should see a set of options similar to below.\n\nHere, you can:\n\n1. Set the `stack name` for identifying the stack in AWS (required).\n1. Set Weaviate/AWS parameters, such as:\n    - number of nodes\n    - instance types\n    - Weaviate authentication parameters.\n1. Confirm required resources & proceed to Create stack.\n    - This template may require additional resources and capabilities.\n\nAfter clicking Create stack, the creation process may take a while, such as around 30 minutes.\n\nYou can check the status of individual resources in the `Events` tab. Once the stack has been created, the status for the stack will change to `✅ CREATE_COMPLETE`.\n\n## Accessing the cluster\n\nOnce the stack has been created, you can access the cluster using `kubectl`, and Weaviate itself using the load balancer.\n\n### Interaction using `kubectl`\n\nYou can run the following command which will update or create a kubeconfig file for the Weaviate cluster:\n\n```\naws eks update-kubeconfig --name [cluster-name] --region [aws-region]--role-arn arn:aws:iam::[AccountID]:role/[StackName]-MastersRole[XX]\n```\n\nThe exact command can be found in the CloudFormation stack, in the `Outputs` tab, under the `EKSClusterConfigCommand` output.\n\nOnce that's set up, you can run `kubectl` commands as usual. For example\n\n- `kubectl get pods -n weaviate` to list all pods in the `weaviate` namespace.\n- `kubectl get svc --all-namespaces` to list all services in all namespaces.\n\n### Finding the Weaviate URL\n\nOnce the stack has been created, you can access Weaviate via the load balancer URL.\n\nYou can find the Weaviate endpoint URL by any of:\n- Going to the `Services` section of AWS, under `EC2` > `Load Balancers`. Find the load balancer, and look for the `DNS name` column.\n- Running `kubectl get svc -n weaviate` and looking for the `EXTERNAL-IP` of the `weaviate` service.\n\nThe load balancer URL (e.g. `a520f010285b8475eb4b86095cabf265-854109584.eu-north-1.elb.amazonaws.com`) will be the Weaviate URL (e.g. `http://a520f010285b8475eb4b86095cabf265-854109584.eu-north-1.elb.amazonaws.com`).\n\n## Deleting the cluster\n\nYou can delete the cluster by deleting the CloudFormation stack.\n\nPlease note that this will delete your data in Weaviate. If you want to keep your data, you should back it up or export the data before deleting the cluster.\n\n### Some resources many require manual deletion\n\nPlease make sure that all unused resources are deleted. You will continue to incur costs for any remaining resources.\n\nThere may be some AWS resources that are not deleted automatically when the CloudFormation stack is deleted. For example, EBS volumes, and Key Management Service (KMS) keys may not be deleted from time to time.\n\nYou must delete these manually.\n\n#### Tips\n\n- If your CloudFormation stack indicates \"DELETE_FAILED\", you may be able to re-initiate deletion of these resources.\n- Review the `Resources` tab of the CloudFormation stack to find resources that may not have been deleted.\n- Key Management Service (KMS) keys may be deleted by going to the KMS console, and deleting the keys manually. You may need to schedule deletion of the keys.\n\n\n## Billing\n\nYou will be charged for Weaviate and associated resources directly by AWS.\n\nThis will, for example, include the EC2 instances, EBS volumes, and any other resources used by the cluster.\n\n\n\n\n\n", "type": "Documentation", "name": "installation-aws-marketplace", "path": "developers/weaviate/installation/aws-marketplace.md", "link": "https://weaviate.io/developers/weaviate/installation/aws-marketplace", "timestamp": "2024-02-08 20:22:51", "reader": "JSON", "meta": {}, "chunks": []}