{"text": "\n\n\n\n## Overview\n\nSometimes, you may wish to list every object in a class, such as for manual backup when the `backup` feature is not suitable, or to export vectors or specific object properties. You may also wish to then restore these objects as well, to a different Weaviate instance for example.\n\nThe best way to do this is with the `after` operator, also called the cursor API.\n\nThe `after` operator is based on the order of IDs. No other ordering of data, such as sorting or searching, is possible.\n\n- How-to: Read objects\n- References: GraphQL - Additional Operators\n\n\n## Retrieve and restore objects\n\nFor classes where multi-tenancy is enabled, you will also need to specify the tenant name when reading or creating objects. See Manage data: multi-tenancy operations for details on how.\n\n### List every object\n\nTo list every object, use the `after` operator to loop through the data as shown in the example below.\n\nThe example connects to a \"source\" instance at `https://some-endpoint.weaviate.network`. It also defines a function that will fetch a group of objects (and their `title` property) in the `WineReview` class from using the ID of the last object retrieved as the cursor.\n\nTo retrieve (and restore) vectors as well, include the `vector` parameter as shown in the highlighted lines.\n\n\n\n  \n    \n  \n\n  \n    \n  \n\n  \n    \n  \n\n  \n    \n  \n\n  \n    \n  \n\n\n### Fetch the class definition\n\nYou can fetch the existing class definition like this:\n\n\n  \n    \n  \n\n  \n    \n  \n\n  \n    \n  \n\n  \n    \n  \n\n  \n    \n  \n\n\n### Restore to a target instance\n\nAnd then restore to a target instance, by:\n- Creating the same class in the target instance using the fetched class definition, and\n- Then streaming the objects from the source instance to the target instance using batch imports.\n\n\n  \n    \n  \n\n  \n    \n  \n\n  \n    \n  \n\n  \n    \n  \n\n  \n    \n  \n\n\n\n### Putting it together\n\nPutting the pieces together, the example code retrieves the `WineReview` class definition and objects from `https://some-endpoint.weaviate.network` and uses them to populate the database at `https://anon-endpoint.weaviate.network`:\n\n\n  \n    \n  \n\n  \n    \n  \n\n  \n    \n  \n\n  \n    \n  \n\n  \n    \n  \n\n\n\n\n\n\n", "type": "Documentation", "name": "manage-data-read-all-objects", "path": "developers/weaviate/manage-data/read-all-objects.mdx", "link": "https://weaviate.io/developers/weaviate/manage-data/read-all-objects", "timestamp": "2023-11-13 10:40:54", "reader": "JSON", "meta": {}, "chunks": []}