{"text": "\n\n\n\n## Overview\n\nThis page will show you how to update objects in Weaviate, either in their entirety, or specific properties.\n\n- References: REST - /v1/objects\n\n\n## Requirements\n\nTo update an object, you'll need:\n1. Its id\n2. The name of its class\n3. The properties to update, in particular the entire object\n\nFor classes where multi-tenancy is enabled, you will also need to specify the tenant name when updating objects. See Manage data: multi-tenancy operations for details on how.\n\n\n## Update object properties\n\nTo update the values of a list of properties in an object, make a `PATCH` request to the `/v1/objects` REST API endpoint, or use the client code below. If a vectorizer is set and any `text` properties are updated, Weaviate will recalculate the vector embedding (unless all updated `text` properties are skiped).\n\n\n  \n    \n  \n\n  \n    \n  \n\n  \n    \n  \n\n  \n    \n  \n\n\n### Specify the vector\n\nIf you want to update an object's vector embedding, you can specify the vector property:\n\n\n  \n    \n  \n\n  \n\n  >  Coming soon (vote for the feature request)\n\n  \n\n  \n\n  >  Coming soon\n\n  \n\n  \n\n  >  Coming soon\n\n  \n\n\n\n## Update (replace) an entire object\n\nTo replace an object in its entirety, make a `PUT` request to the `/v1/objects` REST API endpoint, or use the client code below. If a vectorizer is set and any `text` property is replaced with a different value, Weaviate will recalculate the vector embedding (unless all updated `text` properties are skiped).\n\n\n  \n    \n  \n\n  \n    \n  \n\n  \n    \n  \n\n  \n    \n  \n\n\n\n## Add a new property\n\nWeaviate does not support adding an extra property to an object if the property isn't listed in the schema class definition. You can update the values of existing class properties as seen above, or you can add the property to the class first, then update it for the desired object(s).\n\n\n## Delete a property\n\nWeaviate does not yet support deleting or updating properties in the schema, but you can vote for this feature request.\n\nTo \"delete\" a text property, you could update it to an empty string.\n\nTo delete properties from a specific object, you can replace the object with a copy that has those properties deleted:\n\n\n  \n    \n  \n\n  \n    \n  \n\n  \n    \n  \n\n  \n    \n  \n\n\n\n\n\n\n", "type": "Documentation", "name": "manage-data-update", "path": "developers/weaviate/manage-data/update.mdx", "link": "https://weaviate.io/developers/weaviate/manage-data/update", "timestamp": "2023-11-02 10:53:12", "reader": "JSON", "meta": {}, "chunks": []}