{"text": "\n\n## Migration for version 1.19.0\n\nThis version introduces `indexFilterable` and `indexSearchable` variables for the new text indexes, whose values will be set based on the value of `indexInverted`.\n\nSince filterable & searchable are separate indexes, filterable does not exist in Weaviate instances upgraded from pre-`v1.19` to `v1.19`. The missing `filterable` index can be created though on startup for all `text/text[]` properties if env variable `INDEX_MISSING_TEXT_FILTERABLE_AT_STARTUP` is set.\n\n## Changelog for version v1.9.0\n\n* no breaking changes\n\n* *New Features*\n  * ### First Multi-modal module: CLIP Module (#1756, #1766)\n    This release introduces the `multi2vec-clip` module, a module that allows for multi-modal vectorization within a single vector space. A class can have `image` or `text` fields or both. Similarly, the module provides both a `nearText` and a `nearImage` search and allows for various search combinations, such as text-search on image-only content and various other combinations.\n\n    #### How to use\n\n    The following is a valid payload for a class that vectorizes both images and text fields:\n    ```json\n    {\n        \"class\": \"ClipExample\",\n        \"moduleConfig\": {\n            \"multi2vec-clip\": {\n                \"imageFields\": [\n                    \"image\"\n                ],\n                \"textFields\": [\n                    \"name\"\n                ],\n                \"weights\": {\n                  \"textFields\": [0.7],\n                  \"imageFields\": [0.3]\n                }\n            }\n        },\n        \"vectorIndexType\": \"hnsw\",\n        \"vectorizer\": \"multi2vec-clip\",\n        \"properties\": [\n          {\n            \"dataType\": [\n              \"text\"\n            ],\n            \"name\": \"name\"\n          },\n          {\n            \"dataType\": [\n                \"blob\"\n            ],\n            \"name\": \"image\"\n          }\n        ]\n      }\n      ```\n\n    Note that:\n       - `imageFields` and `textFields` in `moduleConfig.multi2vec-clip` do not both need to be set. However at least one of both must be set.\n       - `weights` in `moduleConfig.multi2vec-clip` is optional. If only a single property the property takes all the weight. If multiple properties exist and no weights are specified, the properties are equal-weighted.\n\n    You can then import data objects for the class as usual. Fill the `text` or `string` fields with text and/or fill the `blob` fields with a base64-encoded image.\n\n    #### Limitations\n    * As of `v1.9.0` the module requires explicit creation of a class. If you rely on auto-schema to create the class for you, it will be missing the required configuration about which fields should be vectorized. This will be addressed in a future release.\n\n* *Fixes*\n  * fix an error where deleting a class with `geoCoordinates` could lead to a panic due to missing cleanup (#1730)\n  * fix an issue where an error in a module would not be forwarded to the user (#1754)\n  * fix an issue where a class could not be deleted on some file system (e.g. AWS EFS) (#1757)\n\n\n## Migration to version v1.8.0\n\n### Migration Notice\n\nVersion `v1.8.0` introduces multi-shard indices and horizontal scaling. As a\nresult the dataset needs to be migrated. This migration is performed automatically -\nwithout user interaction - when first starting up with Weaviate version\n`v1.8.0`. However, it cannot be reversed. We, therefore, recommend carefully\nreading the following migration notes and making a case-by-case decision about the\nbest upgrade path for your needs.\n\n#### Why is a data migration necessary?\n\nPrior to `v1.8.0` Weaviate did not support multi-shard indices. The feature was\nalready planned, therefore data was already contained in a single shard with a\nfixed name. A migration is necessary to move the data from a single fixed shard\ninto a multi-shard setup. The amount of shards is not changed. When you run\n`v1.8.0` on a dataset the following steps happen automatically:\n\n* Weaviate discovers the missing sharding configuration for your classes and fills it with the default values\n* When shards start-up and they do not exist on disk, but a shard with a fixed\n  name from `v1.7.x` exists, Weaviate automatically recognizes that a migration\n  is necessary and moves the data on disk\n* When Weaviate is up and running the data has been migrated.\n\n**Important Notice:** As part of the migration Weaviate will assign the shard\nto the (only) node available in the cluster. You need to make sure that this\nnode has a stable hostname. If you run on Kubernetes, hostnames are stable\n(e.g. `weaviate-0` for the first node). However with `Docker Compose` hostnames\ndefault to the id of the container. If you remove your containers (e.g.\n`docker compose down`) and start them up again, the hostname will have changed.\nThis will lead to errors where Weaviate mentions that it cannot find the node\nthat the shard belongs to. The node sending the error message is the node that\nowns the shard itself, but it cannot recognize it, since its own name has\nchanged.\n\nTo remedy this, you can set a stable hostname **before starting up with\nv1.8.0** by setting the env var `CLUSTER_HOSTNAME=node1`. The actual name does\nnot matter, as long as it's stable.\n\nIf you forgot to set a stable hostname and are now running into the error\nmentioned above, you can still explicitly set the hostname that was used before\nwhich you can derive from the error message.\n\nExample:\n\nIf you see the error message `\"shard Knuw6a360eCY: resolve node name\n\\\"5b6030dbf9ea\\\" to host\"`, you can make Weaviate usable again, by setting\n`5b6030dbf9ea` as the host name: `CLUSTER_HOSTNAME=5b6030dbf9ea`.\n\n#### Should you upgrade or reimport?\n\nPlease note that besides new features, `v1.8.0` also contains a large\ncollection of bugfixes. Some of those bugs also affected how the HNSW index was\nwritten to disk. Therefore, it cannot be ruled out that the index on disk has a\nsubpar quality compared to a freshly built index in version `v1.8.0`.\nAs such, if you can import using a script, we generally recommend starting\nwith a fresh `v1.8.0` setup and reimporting instead of migrating.\n\n#### Is downgrading possible after upgrading?\n\nNote that the data migration which happens at the first startup of v1.8.0 is\nnot automatically reversible. If you plan on downgrading to `v1.7.x` again\nafter upgrading, you must explicitly create a backup of the state prior to\nupgrading.\n\n### Changelog\n\n\n## Changelog for version v1.7.2\n* No breaking changes\n* New features\n  * ### Array Datatypes (#1691)\n    Added `boolean[]` and `date[]`.\n  * ### Make property names less strict (#1562)\n   Property names in a data schema allows: `/[_A-Za-z][_0-9A-Za-z]*/`. i.e. it will allow for using underscores, will allow numbers and will fix the issue about trailing upper-case characters. But it won't allow for many other special characters, such as dash (-) or language-specific characters like Umlauts, etc, due to GraphQL restrictions.\n* Bug fixes\n  * ### Aggregation on array data type (#1686)\n\n\n## Changelog for version v1.7.0\n* No breaking changes\n* New features\n  * ### Array Datatypes (#1611)\n    Starting with this release, primitive object properties are no longer limited to individual properties, but can also include lists of primitives. Array types can be stored, filtered and aggregated in the same way as other primitives.\n\n    Auto-schema will automatically recognize lists of `string`/`text` and `number`/`int`. You can also explicitly specify lists in the schema by using the following data types `string[]`, `text[]`, `int[]`, `number[]`. A type that is assigned to be an array, must always stay an array, even if it only contains a single element.\n\n  * ### New Module: `text-spellcheck` - Check and autocorrect misspelled search terms (#1606)\n    Use the new spellchecker module to verify user-provided search queries (in existing `nearText` or `ask` functions) are spelled correctly and even suggest alternative, correct spellings. Spell-checking happens at query time.\n\n    There are two ways to use this module:\n    1. It provides a new additional property which can be used to check (but not alter) the provided queries:\n    The following query:\n    ```graphql\n    {\n      Get {\n        Post(nearText: {\n          concepts: \"missspelled text\"\n        }) {\n          content\n          _additional {\n            spellCheck {\n              changes {\n                corrected\n                original\n              }\n              didYouMean\n              location\n              originalText\n            }\n          }\n        }\n      }\n    }\n    ```\n\n    will produce results similar to the following:\n\n    ```\n      \"_additional\": {\n        \"spellCheck\": [\n          {\n            \"changes\": [\n              {\n                \"corrected\": \"misspelled\",\n                \"original\": \"missspelled\"\n              }\n            ],\n            \"didYouMean\": \"misspelled text\",\n            \"location\": \"nearText.concepts[0]\",\n            \"originalText\": \"missspelled text\"\n          }\n        ]\n      },\n      \"content\": \"...\"\n    },\n    ```\n    2. It extends existing `text2vec-*` modules with an `autoCorrect` flag, which can be used to automatically correct the query if misspelled.\n\n  * ### New Module `ner-transformers` - Extract entities from Weaviate using transformers (#1632)\n    Use transformer-based models to extract entities from your existing Weaviate objects on the fly. Entity extraction happens at query time. Note that for maximum performance, transformer-based models should run with GPUs. CPUs can be used, but the throughput will be lower.\n\n    To make use of the module's capabilities, simply extend your query with the following new `_additional` property:\n\n    ```graphql\n    {\n      Get {\n        Post {\n          content\n          _additional {\n            tokens(\n              properties: [\"content\"],    # is required\n              limit: 10,                  # optional, int\n              certainty: 0.8              # optional, float\n            ) {\n              certainty\n              endPosition\n              entity\n              property\n              startPosition\n              word\n            }\n          }\n        }\n      }\n    }\n\n    ```\n    It will return results similar to the following:\n\n    ```\n    \"_additional\": {\n      \"tokens\": [\n        {\n          \"property\": \"content\",\n          \"entity\": \"PER\",\n          \"certainty\": 0.9894614815711975,\n          \"word\": \"Sarah\",\n          \"startPosition\": 11,\n          \"endPosition\": 16\n        },\n        {\n          \"property\": \"content\",\n          \"entity\": \"LOC\",\n          \"certainty\": 0.7529033422470093,\n          \"word\": \"London\",\n          \"startPosition\": 31,\n          \"endPosition\": 37\n        }\n      ]\n    }\n    ```\n* Bug fixes\n  * Aggregation can get stuck when aggregating `number` datatypes (#1660)\n\n## Changelog for version 1.6.0\n* No breaking changes\n* No new features\n * **Zero Shot Classification (#1603)** This release adds a new classification type `zeroshot` that works with any `vectorizer` or custom vectors. It picks the label objects that have the lowest distance to the source objects. The link is made using cross-references, similar to existing classifications in Weaviate. To start a `zeroshot` classification use `\"type\": \"zeroshot\"` in your `POST /v1/classficiations` request and specify the properties you want classified normally using `\"classifyProperties\": [...]`. As zero shot involves no training data, you cannot set `trainingSetWhere` filters, but can filter both source (`\"sourceWhere\"`) and label objects (`\"targetWhere\"`) directly.\n* Bug fixes\n\n\n## Changelog for version 1.5.2\n\n* No breaking changes\n* No new features\n* Bug fixes:\n* ### Fix possible data races (`short write`) (#1643)\n  This release fixes various possible data races that could in the worst case lead to an unrecoverable error `\"short write\"`. The possibility for those races was introduced in `v.1.5.0` and we highly recommend anyone running on the `v1.5.x` timeline to upgrade to `v1.5.2` immediately.\n\n## Changelog for version 1.5.1\n\n* No breaking changes\n* No new features\n* Bug fixes:\n* ### Crashloop after unexpected crash in HNSW commit log (#1635)\n  If Weaviate was killed (e.g. OOMKill) while writing the commit log, it could not be parsed after the next restart anymore, thus ending up in a crashloop. This fix removes this. Note that no data will be lost on such a crash: The partially written commit log has not yet been acknowledged to the user, so no write guarantees have been given yet. It is therefore safe to discard.\n\n* ### Chained Like operator not working (#1638)\n  Prior to this fix, when chaining `Like` operators in `where` filters where each `valueString` or `valueText` contained a wildcard (`*`), typically only the first operator's results where reflected. This fix makes sure that the chaining (`And` or `Or`) is reflected correctly. This bug did not affect other operators (e.g. `Equal`, `GreaterThan`, etc) and only affected those `Like` queries where a wildcard was used.\n\n* ### Fix potential data race in Auto Schema features (#1636)\n  This fix improves incorrect synchronization on the auto schema feature which in extreme cases could lead to a data race.\n\n## Migration to version 1.5.0\n\n### Migration Notice\n*This release does not contain any API-level breaking changes, however, it changes the entire storage mechanism inside Weaviate. As a result, an in-place update is not possible. When upgrading from previous versions, a new setup needs to be created and all data reimported. Prior backups are not compatible with this version.*\n\n### Changelog\n* No breaking changes\n* New Features:\n  * *LSM-Tree based Storage*. Previous releases of Weaviate used a B+Tree based storage mechanism. This was not fast enough to keep up with the high write speed requirements of a large-scale import. This release completely rewrites the storage layer of Weaviate to use a custom LSM-tree approach. This leads to considerably faster import times, often more than 100% faster than the previous version.\n  * *Auto-Schema Feature*. Import data objects without creating a schema prior to import. The classes will be created automatically, they can still be adjusted manually. Weaviate will guess the property type based on the first time it sees a property. The defaults can be configured using the environment variables outlined in #1539. The feature is on by default, but entirely non-breaking. You can still create an explicit schema at will.\n* Fixes:\n  * *Improve Aggregation Queries*. Reduces the amount of allocations required for some aggregation queries, speeding them up and reduces the amount of timeouts encountered during aggregations.\n\n\nCheck this github page for all the changes.\n\n\n## Changelog for version 1.4.0\n\n* No breaking changes\n* New Features:\n  * Image Module `img2vec-neural`\n  * Add Hardware acceleration for `amd64` CPUs (Intel, AMD)\n  * Support `arm64` technology for entire Weaviate stack\n  * Set `ef` at search time\n  * Introduce new dataType `blob`\n  * Skip vector-indexing a class\n* Fixes:\n  * Various Performance Fixes around the HNSW Vector Index\n  * Make property order consistent when vectorizing\n  * Fix issues around `PATCH` API when using custom vectors\n  * Detect schema settings that will most likely lead to duplicate vectors and print warning\n  * Fix missing schema validation on transformers module\n\nCheck this github page for all the changes.\n\n\n## Changelog for version 1.3.0\n\n* No breaking changes\n* New feature: Question Answering (Q&A) Module\n* New feature: New Meta Information for all transformer-based modules\n\nCheck this github page for all the changes.\n\n## Changelog for version 1.2.0\n\n* No breaking changes\n* New feature: Introduction of the Transformer Module\n\nCheck this github page for all the changes.\n\n## Changelog for version 1.1.0\n\n* No breaking changes\n* New feature: GraphQL `nearObject` search to get most similar object.\n* Architectural  update: Cross-reference batch import speed improvements.\n\nCheck this github page for all the changes.\n\n## Migration to version 1.0.0\n\nWeaviate version 1.0.0 was released on 12 January 2021, and consists of the major update of modularization. From version 1.0.0, Weaviate is modular, meaning that the underlying structure relies on a *pluggable* vector index, *pluggable* vectorization modules with possibility to extend with *custom* modules.\n\nWeaviate release 1.0.0 from 0.23.2 comes with a significant amount of breaking changes in the data schema, API and clients. Here is an overview of all (breaking) changes.\n\nFor client library specific changes, take a look at the change logs of the specific client (Go, Python and TypeScript/JavaScript.\n\nMoreover, a new version of the Console is released. Visit the Console documentation for more information.\n\n### Summary\nThis contains most overall changes, but not all details. Those are documented in \"Changes\".\n\n#### All RESTful API changes\n* from `/v1/schema/things/{ClassName}` to `/v1/schema/{ClassName}`\n* from `/v1/schema/actions/{ClassName} `to `/v1/schema/{ClassName}`from `/v1/schema/actions/{ClassName} `to `/v1/schema/{ClassName}`\n* from `/v1/things` to `/v1/objects`\n* from `/v1/actions` to `/v1/objects`\n* from `/v1/batching/things` to `/v1/batch/objects`\n* from `/v1/batching/actions` to `/v1/batch/objects`\n* from `/v1/batching/references` to `/v1/batch/references`\n* Additional data object properties are grouped in `?include=...` and the leading underscore of these properties is removed\n* The `/v1/modules/` endpoint is introduced.\n* the `/v1/meta/` endpoint now contains module specific information in `\"modules\"`\n\n#### All GraphQL API changes\n* Removal of Things and Actions layer in query hierarchy\n* Reference properties of data objects are lowercase (previously uppercased)\n* Underscore properties, uuid and certainty are now grouped in the object `_additional`\n* `explore()` filter is renamed to `near` filter\n* `nearVector(vector:[])` filter is introduced in `Get{}` query\n* `Explore (concepts: [\"foo\"]){}` query is changed to `Explore (near: ... ) {}`.\n\n#### All data schema changes\n* Removal of Things and Actions\n* Per class and per property configuration is changed to support modules and vector index type settings.\n\n#### All data object changes\n* From `schema` to `properties` in the data object.\n\n#### Contextionary\n* Contextionary is renamed to the module `text2vec-contextionary`\n* `/v1/c11y/concepts` to `/v1/modules/text2vec-contextionary/concepts`\n* `/v1/c11y/extensions` to `/v1/modules/text2vec-contextionary/extensions`\n* `/v1/c11y/corpus` is removed\n\n#### Other\n* Removal of `/things` and `/actions` in short and long beacons\n* Classification body is changed to support modularization\n* `DEFAULT_VECTORIZER_MODULE` is a new environment variable\n\n### Changes\n\n#### Removal of Things and Actions\n`Things` and `Actions` are removed from the Data Schema. This comes with the following changes in the schema definition and API endpoints:\n1. **Data schema:** The `semantic kind` (`Things` and `Actions`) is removed from the Schema Endpoint. This means the URLs will change:\n  * from `/v1/schema/things/{ClassName}` to `/v1/schema/{ClassName}`\n  * from `/v1/schema/actions/{ClassName} `to `/v1/schema/{ClassName}`\n1. **Data RESTful API endpoint:** The `semantic kind` (`Things` and `Actions`) is removed from the data Endpoint. Instead it will be namespaced as `/objects`. This means the URLs will change:\n  * from `/v1/things` to `/v1/objects`\n  * from `/v1/actions` to `/v1/objects`\n  * from `/v1/batching/things`to `/v1/batch/objects` (see also the change in batching)\n  * from `/v1/batching/actions`to `/v1/batch/objects` (see also the change in batching)\n1. **GraphQL:** The `Semantic Kind` \"level\" in the query hierarchy will be removed without replacement (In `Get` and `Aggregate` queries), i.e.\n   ```graphql\n   {\n     Get {\n       Things {\n         ClassName {\n           propName\n         }\n       }\n     }\n   }\n   ```\n\n   will become\n\n   ```graphql\n   {\n     Get {\n       ClassName {\n         propName\n       }\n     }\n   }\n   ```\n1. **Data Beacons:** The `Semantic Kind` will be removed from beacons:\n   * **Short-form Beacon:**\n\n     * `weaviate://localhost/things/4fbacd6e-1153-47b1-8cb5-f787a7f01718`\n\n     to\n\n     * `weaviate://localhost/4fbacd6e-1153-47b1-8cb5-f787a7f01718`\n\n   * **Long-form Beacon:**\n\n     * `weaviate://localhost/things/ClassName/4fbacd6e-1153-47b1-8cb5-f787a7f01718/propName`\n\n     to\n\n     * `weaviate://localhost/ClassName/4fbacd6e-1153-47b1-8cb5-f787a7f01718/propName`\n\n#### Renaming /batching/ to /batch/\n\n* `/v1/batching/things` to `/v1/batch/objects`\n* `/v1/batching/actions` to `/v1/batch/objects`\n* `/v1/batching/references` to `/v1/batch/references`\n\n\n#### From \"schema\" to \"properties\" in data object\n\nThe name \"schema\" on the data object is not intuitive and is replaced by \"properties\". The change looks like:\n\n```json\n{\n  \"class\": \"Article\",\n  \"schema\": {\n    \"author\": \"Jane Doe\"\n  }\n}\n```\n\nto\n\n```json\n{\n  \"class\": \"Article\",\n  \"properties\": {\n    \"author\": \"Jane Doe\"\n  }\n}\n```\n\n#### Consistent casing in GraphQL properties\n\nPreviously, reference properties in the schema definitions are always lowercase, yet in graphQL they needed to be uppercased. E.g.: `Article { OfAuthor { … on Author { name } } } }`, even though the property is defined as ofAuthor. New is that the casing in GraphQL reflects exactly the casing in the schema definition, thus the above example would become: `Article { ofAuthor { … on Author { name } } } }`\n\n#### Additional data properties in GraphQL and RESTful API\nSince modularization, a module can contribute to the additional properties of a data object (thus are not fixed), which should be retrievable by the GraphQL and/or RESTful API.\n1. **REST**: `additional` properties (formerly named `\"underscore\"` properties) can be included in RESTful query calls like `?include=...`, e.g. `?include=classification`. The underscores will thus be removed from the names (e.g. `?include=_classification` is deprecated). In the Open API specifications, all additional properties will be grouped in the object `additional`. For example:\n    ```json\n    {\n      \"class\": \"Article\",\n      \"schema\": { ... },\n      \"_classification\": { … }\n    }\n    ```\n\n    to\n\n    ```json\n    {\n      \"class\": \"Article\",\n      \"properties\": { ... },\n      \"additional\": {\n        \"classification\": { ... }\n      }\n    }\n    ```\n2. **GraphQL**: `\"underscore\"` properties are renamed to `additional` properties in GraphQL queries.\n   1. All former `\"underscore\"` properties of a data object (e.g. `_certainty`) are now grouped in the `_additional {}` object (e.g. `_additional { certainty } `).\n   2. The `uuid` property is now also placed in the `_additional {}` object and renamed to `id` (e.g. `_additional { id } `).\n   This example covers both changes:\n\n   From\n\n   ```graphql\n    {\n      Get {\n        Things {\n          Article {\n            title\n            uuid\n            certainty\n            _classification\n          }\n        }\n      }\n    }\n   ```\n\n   to\n\n   ```graphql\n   {\n     Get {\n       Article {\n         title\n         _additional {      # leading _ prevents clashes\n           certainty\n           id               # replaces uuid\n           classification\n         }\n       }\n     }\n   }\n   ```\n\n#### Modules RESTful endpoint\nWith the modularization of Weaviate, the `v1/modules/` endpoint is introduced.\n\n#### GraphQL semantic search\n\nWith the modularization, it becomes possible to vectorize non-text objects. Search is no longer restricted to use the Contextionary's vectorization of text and data objects, but could also be applied to non-text objects or raw vectors. The formerly 'explore' filter in Get queries and 'Explore' queries in GraphQL were tied to text, but the following changes are made to this filter with the new version of Weaviate:\n\n1. The filter `Get ( explore: {} ) {}` is renamed to `Get ( near: {} ) {}`.\n   1. New: `Get ( nearVector: { vector: [.., .., ..] } ) {}` is module independent and will thus always be available.\n   2. `Get ( explore { concepts: [\"foo\"] } ) {}` will become `Get ( nearText: { concepts: [\"foo\"] } ) {}` and is only available if the `text2vec-contextionary` module is attached.\n\n    From\n\n    ```graphql\n      {\n        Get {\n          Things {\n            Article (explore: { concepts: [\"foo\"] } ) {\n              title\n            }\n          }\n        }\n      }\n    ```\n\n    to\n\n    ```graphql\n    {\n      Get {\n        Article (near: ... ) {\n          title\n        }\n      }\n    }\n    ```\n\n2. Similarly to the explore sorter that is used in the `Get {}` API, the `Explore {}` API also assumes text. The following change is applied:\n\n   From\n\n   ```graphql\n    {\n      Explore (concepts: [\"foo\"]) {\n        beacon\n      }\n    }\n   ```\n\n   to\n\n   ```graphql\n    {\n      Explore (near: ... ) {\n        beacon\n      }\n    }\n   ```\n\n#### Data schema configuration\n1. **Per-class configuration**\n\n    With modularization, it is possible to configure per class the vectorizer module, module-specific configuration for the overall class, vector index type, and vector index type specific configuration:\n    * The `vectorizer` indicates which module (if any) are responsible for vectorization.\n    * The `moduleConfig` allows configuration per module (by name).\n      * See here for Contextionary specific property configuration.\n    * The `vectorIndexType` allows the choosing the vector index (defaults to HNSW)\n    * The `vectorIndexConfig` is an arbitrary object passed to the index for config (defaults can be found here )\n\n    All changes are in this example:\n\n    ```json\n    {\n      \"class\": \"Article\",\n      \"vectorizeClassName\": true,\n      \"description\": \"string\",\n      \"properties\": [ … ]\n    }\n    ```\n\n    will become\n\n    ```json\n    {\n      \"class\": \"Article\",\n      \"vectorIndexType\": \"hnsw\",        # defaults to hnsw\n      \"vectorIndexConfig\": {\n        \"efConstruction\": 100\n      },\n      \"moduleConfig\": {\n        \"text2vec-contextionary\": {\n          \"vectorizeClassName\": true\n        },\n        \"encryptor5000000\": { \"enabled\": true }  # example\n      },\n      \"description\": \"string\",\n      \"vectorizer\": \"text2vec-contextionary\",  # default is configurable\n      \"properties\": [ … ]\n    }\n    ```\n\n2. **Per-property configuration**\n\n  With modularization, it is possible to configure per property module-specific configuration per property if available and it can be specified if a property should be included in the inverted index.\n  * The `moduleConfig` allows configuration per module (by name).\n    * See here for Contextionary specific property configuration.\n  * `index` will become `indexInverted`: a boolean that indicates whether a property should be indexed in the inverted index.\n\n  All changes are in this example:\n\n  ```json\n  {\n    \"dataType\": [ \"text\" ],\n    \"description\": \"string\",\n    \"cardinality\": \"string\",\n    \"vectorizePropertyName\": true,\n    \"name\": \"string\",\n    \"keywords\": [ … ],\n    \"index\": true\n  }\n  ```\n\n  will become\n\n  ```json\n  {\n    \"dataType\": [ \"text\" ],\n    \"description\": \"string\",\n    \"moduleConfig\": {\n      \"text2vec-contextionary\": {\n        \"skip\": true,\n        \"vectorizePropertyName\": true,\n      }\n    },\n    \"name\": \"string\",\n    \"indexInverted\": true\n  }\n  ```\n\n#### RESTful /meta endpoint\n\nThe `/v1/meta` object now contains module specific information at in the newly introduced namespaced `modules.` property:\n\nFrom\n\n```json\n{\n  \"hostname\": \"string\",\n  \"version\": \"string\",\n  \"contextionaryWordCount\": 0,\n  \"contextionaryVersion\": \"string\"\n}\n```\n\nto\n\n```json\n{\n  \"hostname\": \"string\",\n  \"version\": \"string\",\n  \"modules\": {\n    \"text2vec-contextionary\": {\n      \"wordCount\": 0,\n      \"version\": \"string\"\n     }\n  }\n}\n```\n\n#### Modular classification\n\nSome classification types are tied to modules (e.g. the former \"contextual\" classification is tied to the `text2vec-contextionary` module. We make a distinction between fields which are always present and those which are type dependent. Additionally the API is improved by grouping `settings` and `filters` in separate properties. kNN classification is the only type of classification that is present with Weaviate Core without dependency on modules. The former \"contextual\" classification is tied to the `text2vec-contextionary` module, see here. An example of how the change looks like in the classification API POST body:\n\nFrom\n\n```json\n{\n  \"class\": \"City\",\n  \"classifyProperties\": [\"inCountry\"],\n  \"basedOnProperties\": [\"description\"],\n  \"type\": \"knn\",\n  \"k\": 3,\n  \"sourceWhere\": { … },\n  \"trainingSetWhere\": { … },\n  \"targetWhere\": { … },\n}\n\n```\n\nTo\n\n```json\n{\n  \"class\": \"City\",\n  \"classifyProperties\": [\"inCountry\"],\n  \"basedOnProperties\": [\"description\"],\n  \"type\": \"knn\",\n  \"settings\": {\n    \"k\": 3\n  },\n  \"filters\": {\n    \"sourceWhere\": { … },\n    \"trainingSetWhere\": { … },\n    \"targetWhere\": { … },\n  }\n}\n```\n\nAnd the API GET body:\n\nFrom\n\n```json\n{\n  \"id\": \"ee722219-b8ec-4db1-8f8d-5150bb1a9e0c\",\n  \"class\": \"City\",\n  \"classifyProperties\": [\"inCountry\"],\n  \"basedOnProperties\": [\"description\"],\n  \"status\": \"running\",\n  \"meta\": { … },\n  \"type\": \"knn\",\n  \"k\": 3,\n  \"sourceWhere\": { … },\n  \"trainingSetWhere\": { … },\n  \"targetWhere\": { … },\n}\n```\n\nTo\n\n```json\n{\n  \"id\": \"ee722219-b8ec-4db1-8f8d-5150bb1a9e0c\",\n  \"class\": \"City\",\n  \"classifyProperties\": [\"inCountry\"],\n  \"basedOnProperties\": [\"description\"],\n  \"status\": \"running\",\n  \"meta\": { … },\n  \"type\": \"knn\",\n  \"settings\": {\n    \"k\": 3\n  },\n  \"filters\": {\n    \"sourceWhere\": { … },\n    \"trainingSetWhere\": { … },\n    \"targetWhere\": { … },\n  }\n}\n```\n\n#### text2vec-contextionary\nThe Contextionary becomes the first vectorization module of Weaviate, renamed to `text2vec-contextionary` in formal use. This brings the following changes:\n1. **RESTful** endpoint `/v1/c11y` changes to `v1/modules/text2vec-contextionary`:\n   * `/v1/c11y/concepts` to `/v1/modules/text2vec-contextionary/concepts`\n   * `/v1/c11y/extensions` to `/v1/modules/text2vec-contextionary/extensions`\n   * `/v1/c11y/corpus` is removed\n2. **Data schema:** `text2vec-contextionary`-specific module configuration options in the schema definition\n   1. **Per-class**. `\"vectorizeClassName\"` indicates whether the class name should be taken into the vector calculation of data objects.\n\n    ```json\n    {\n      \"class\": \"Article\",\n      \"moduleConfig\": {\n        \"text2vec-contextionary\": {\n          \"vectorizeClassName\": true\n        }\n      },\n      \"description\": \"string\",\n      \"vectorizer\": \"text2vec-contextionary\",\n      \"properties\": [ … ]\n    }\n    ```\n\n   2. **Per-property.** `skip` tells whether to skip the entire property (including value) from the vector position of the data object. `vectorizePropertyName` indicates whether the property name should be taken into the vector calculation of data objects.\n\n    ```json\n    {\n      \"dataType\": [ \"text\" ],\n      \"description\": \"string\",\n      \"moduleConfig\": {\n        \"text2vec-contextionary\": {\n          \"skip\": true,\n          \"vectorizePropertyName\": true,\n        }\n      },\n      \"name\": \"string\",\n      \"indexInverted\": true\n    }\n    ```\n3. **Contextual classification**. Contextual classification is dependent on the module `text2vec-contextionary`. It can be activated in `/v1/classifications/` the following with the classification name `text2vec-contextionary-contextual`:\n\nFrom\n\n```json\n{\n  \"class\": \"City\",\n  \"classifyProperties\": [\"inCountry\"],\n  \"basedOnProperties\": [\"description\"],\n  \"type\": \"contextual\",\n  \"informationGainCutoffPercentile\": 30,\n  \"informationGainMaximumBoost\": 3,\n  \"tfidfCutoffPercentile\": 80,\n  \"minimumUsableWords\": 3,\n  \"sourceWhere\": { … },\n  \"trainingSetWhere\": { … },\n  \"targetWhere\": { … },\n}\n```\n\nTo\n\n```json\n{\n  \"class\": \"City\",\n  \"classifyProperties\": [\"inCountry\"],\n  \"basedOnProperties\": [\"description\"],\n  \"type\": \"text2vec-contextionary-contextual\",\n  \"settings\": {\n    \"informationGainCutoffPercentile\": 30,\n    \"informationGainMaximumBoost\": 3,\n    \"tfidfCutoffPercentile\": 80,\n    \"minimumUsableWords\": 3\n  },\n  \"filters\": {\n    \"sourceWhere\": { … },\n    \"trainingSetWhere\": { … },\n    \"targetWhere\": { … }\n  }\n}\n```\n\n#### Default vectorizer module\nThe default vectorizer module can be specified in a new environment variable so that this doesn't have to be specified on every data class in the schema. The environment variable is `DEFAULT_VECTORIZER_MODULE`, which can be set to for example `DEFAULT_VECTORIZER_MODULE=\"text2vec-contextionary\"`.\n\n\n### Official release notes\nOfficial release notes can be found on GitHub.\n\n\n\n\n\n", "type": "Documentation", "name": "more-resources-migration-guide", "path": "developers/weaviate/more-resources/migration-guide.md", "link": "https://weaviate.io/developers/weaviate/more-resources/migration-guide", "timestamp": "2024-02-08 20:23:28", "reader": "JSON", "meta": {}, "chunks": []}