{"text": "\n[Weaviate Cloud Services (WCS)](https://console.weaviate.cloud/) offers multiple levels of support. You have the flexibility to choose the level of support that you need.\n\n## Service levels\n\nSandboxes and self-hosted clusters are not eligible for paid support.\n\nPaid support is available for Serverless, Enterprise Dedicated, and Bring your Own Cloud clusters.\n\n- For Serverless instances, the default support level is Standard support. You are automatically enrolled for Standard support when you create a Serverless cluster. To switch to another level, contact our [sales team](https://weaviate.io/pricing#contact-sales)\n\n- For Enterprise Dedicated and Bring your Own Cloud clusters, contact our [sales team](https://weaviate.io/pricing#contact-sales) to discuss which level of support is right for you.\n\n### Standard support\n\n- Standard support is email based and is available during business hours. \n\n- Monitoring. The WCS team monitors your cluster.\n\n- Severity determines incident response time:\n\n| Severity | Criteria | Response Time |\n| :- | :- | :- |\n| 1 - Critical | Issues that are critical and require immediate attention, causing widespread disruption or outages. |  1 business day |\n| 2 - High | High-priority problems that can impact service functionality or performance for a subset of users. | 2 business day |\n| 3 - Medium | Medium-priority concerns that affect service functionality or performance for a limited number of users or use cases. | 3 business day |\n| 4 - Low | Lower urgency and impact, causing minor inconveniences or issues for individual users. | 5 business day |\n\n### Production support\n\n- Production support is email based and is available 24 hours a day, seven days a week.\n\n- Severity 1 and Severity 2 incident response includes a  follow up phone call.\n\n- Monitoring The WCS team monitors your cluster.\n\n- Severity determines incident response time:\n\n| Severity | Criteria | Response Time |\n| :- | :- | :- |\n| 1 - Critical | Issues that are critical and require immediate attention, causing widespread disruption or outages. | 4 hours |\n| 2 - High | High-priority problems that can impact service functionality or performance for a subset of users. | 8 hours |\n| 3 - Medium | Medium-priority concerns that affect service functionality or performance for a limited number of users or use cases. | 1 business day |\n| 4 - Low | Lower urgency and impact, causing minor inconveniences or issues for individual users. | 2 business days |\n\nFor details, refer to your support agreement.\n\n### Business critical support\n\n- Business critical support is available 24 hours a day, seven days a week. Support is email based. \n\n- Telephone hotline available 24 hours a day, seven days a week for escalations.\n\n- Severity 1, Severity 2, and Severity 3 incident response includes a follow up phone call.\n\n- Monitoring. The WCS team monitors your cluster.  \n\n- Severity determines incident response time:\n\n| Severity | Criteria | Response Time |\n| :- | :- | :- |\n| 1 - Critical | Issues that are critical and require immediate attention, causing widespread disruption or outages. | 1 hour |\n| 2 - High | High-priority problems that can impact service functionality or performance for a subset of users. | 4 hours |\n| 3 - Medium | Medium-priority concerns that affect service functionality or performance for a limited number of users or use cases. | 8 hours |\n| 4 - Low | Lower urgency and impact, causing minor inconveniences or issues for individual users. | 1 business day |\n\nFor details, refer to your support agreement.\n\n### Sandboxes\n\nSandboxes are not eligible for paid support. For help with a sandbox instance, try one of these resources:\n\n- [Community forum](https://forum.weaviate.io)\n- [Slack](https://weaviate.io/slack)\n\n## Pricing\n\nServerless clusters are billed monthly. The monthly charge for an cluster depends on resource usage. Your support level is a factor in the monthly cost, but you are not charged per support incident.\n\nEach support level (SLA) has a billing rate. WCS counts the objects in your cluster and multiples that number by the rate for your SLA level. WCS adjusts the number if compression is enabled. The result is your usage charge. \n\nIf you have a high availability cluster (HA), WCS multiples the usage charge by three to account for the additional resources.\n\nThere is a minimum monthly charge at each SLA level. If your usage charge is less than the monthly minimum, Weaviate charges you the monthly minimum cost. If your usage charge is higher than the minimum value for your SLA, Weaviate charges you for your cluster usage.\n\nTo estimate costs for different combinations of usage levels and SLAs, see the [pricing calculator](https://weaviate.io/services/serverless).\n\n## Support\n\n\n\n", "type": "Documentation", "name": "Platform Support-levels", "path": "developers/wcs/platform/support-levels.mdx", "link": "https://weaviate.io/developers/wcs/platform/support-levels", "timestamp": "2024-05-08 10:49:15", "reader": "JSON", "meta": {}, "chunks": []}