{"text": "\n\n\n\n[//]: # ()\n\n## &nbsp;&nbsp;Overview\n\nA hybrid search combines `bm25` searches that you just learned about with a vector search, producing rankings from a combination of the two results.\n\nThis can produce helpful results when a vector search or a keyword search alone is not producing desired results. For example, it may be useful when a vector search alone is producing too many irrelevant results, and you want particular keywords to weight the results a certain way.\n\n## &nbsp;&nbsp;About `hybrid` queries\n\n### &nbsp;&nbsp;How it works\n\nA hybrid search works by combining the results of a `bm25` search with the results of a vector search. More specifically, it uses a combination of each result's BM25F search ranking and its vector search ranking among the set of results.\n\nThe sum of the inverse of the BM25F ranking and the vector search ranking is used to produce a final score for each result, with any weighting (`alpha`) applied if applicable. The final score is then used to rank the results.\n\nThis has the effect of rewarding results that score high in at least one of the searches. For example, take the following five results:\n\n- Result 1: BM25F ranking = 5, vector search ranking = 1 -> Total score: 1.2\n- Result 2: BM25F ranking = 4, vector search ranking = 2 -> Total score: 0.75\n- Result 3: BM25F ranking = 3, vector search ranking = 3 -> Total score: 0.67\n- Result 4: BM25F ranking = 2, vector search ranking = 4 -> Total score: 0.75\n- Result 5: BM25F ranking = 1, vector search ranking = 5 -> Total score: 1.2\n\nIn this example, results 1 and 5 end up being the top results, because they scored high in at least one of the searches. On the other hand, result 3, which was middle-of-the-pack in both searches, ends up being the lowest-ranked result.\n\nSo, hybrid search will bring to the top results that score high in at least one of the searches, while middling results will end up in the lower end of the re-ranking.\n\n### &nbsp;&nbsp;`hybrid` query syntax\n\nA hybrid query is shown below. Each hybrid query:\n\n- **Must** include a query string, which can be any length,\n- **Can optionally** include a list of `properties` to search,\n- **Can optionally** include an `alpha` value,\n- **Can optionally** include a `vector` to search for,\n- **Can optionally** request a `score` and an `explainScore` value for each result.\n\n\n\n\n\n\n\nThe above query will return the top 3 objects based on its BM25F score and `nearText` similarity, based on the query string `\"food\"`. The query will search the `question` and `answer` properties of the objects for the BM25F score (while the object vectors remain unaffected by the `properties` selection).\n\n\n   See the JSON response\n\n\n\n\n\n## &nbsp;&nbsp;`hybrid` search parameters\n\nA `hybrid` search includes multiple parameters, some of which you may be familiar with from the earlier `bm25` search discussions.\n\nThe `query` parameter and `properties` parameter are the same as in a `bm25` search, with the exception that currently, the boost parameter is not supported in a `hybrid` search. Some of the parameters, however, are unique to a `hybrid` search.\n\n[//]: # (### &nbsp;&nbsp;`vector`)\n\n[//]: # ()\n[//]: # (The `vector` parameter is optional. If you do not include a `vector` parameter, the `hybrid` search will generate a vector from the query string. If you do include a `vector` parameter, the `hybrid` search will use the vector you provide.)\n\n[//]: # ()\n[//]: # (In this way, you may be able to perform a hybrid search where the `bm25` search and the vector search are based on different concepts. For example, you could perform a `bm25` search with the query string `italian`, and have the vector search be based on a vector of `food`.)\n\n[//]: # ()\n[//]: # (\n[//]: # (TODO - complete this section after I get responses on the slack comment/question)\n\n[//]: # (\n### &nbsp;&nbsp;`alpha`\n\nThe optional `alpha` parameter determines the weighting of the BM25 search ranking and the vector search ranking. If you do not include an `alpha` parameter, the `hybrid` search will use a default value of `0.5`, which weights each equally.\n\nOtherwise, an `alpha` value of 1 is the same as a pure vector search, whereas an `alpha` value of 0 is the same as a pure BM25 search.\n\nTry varying the `alpha` parameter above. What happens to the results?\n\n## &nbsp;&nbsp;Review\n\n\n\n### &nbsp;&nbsp;Review exercise\n\n### &nbsp;&nbsp;Key takeaways\n\n- A hybrid search combines `bm25` search with vector search, producing rankings from a combination of the two results.\n- Hybrid search is helpful when a vector search or a keyword search alone is not producing desired results.\n- Hybrid search orders its search results by summing the inverse of the vector and `bm25` rankings.\n\n\n\n\nimport Quiz from '/src/components/Academy/quiz.js'\nconst hybridRankingQuestion = [{\n  questionText: 'How do hybrid searches order its search results?',\n  answerOptions: [\n    {\n      answerText: 'By multiplying the vector similarity with the BM25 score',\n      isCorrect: false,\n      feedback: 'It does not do that, unfortunately.',\n    },\n    {\n      answerText: 'By averaging the vector and BM25 search rankings',\n      isCorrect: false,\n      feedback: 'It does not do that, unfortunately.',\n    },\n    {\n      answerText: 'By summing the inverse of the vector and BM25 rankings',\n      isCorrect: true,\n      feedback: 'So it has the effect of rewarding results that score high in at least one of the searches.',\n    },\n  ]\n}];\n", "type": "Documentation", "name": "queries_2-hybrid", "path": "developers/academy/zero_to_mvp/104_queries_2/20_hybrid.mdx", "link": "https://weaviate.io/developers/academy/zero_to_mvp/queries_2/hybrid", "timestamp": "2023-11-13 10:39:29", "reader": "JSON", "meta": {}, "chunks": []}