{"text": "\n\n## Introduction\n\nThe `ref2Vec-centroid` module is used to calculate object vectors based on the centroid of referenced vectors. The idea is that this centroid vector would be calculated from the vectors of an object's references, enabling associations between clusters of objects. This is useful in applications such as making suggestions based on the aggregation of a user's actions or preferences.\n\n## How to enable\n\n### Weaviate Cloud Services\n\nThis module is enabled by default on the WCS.\n\n### Weaviate open source\n\nWhich modules to use in a Weaviate instance can be specified in the `Docker Compose` file. Ref2Vec-centroid can be added like this:\n\n```yaml\n---\nversion: '3.4'\nservices:html\n  weaviate:\n    command:\n    - --host\n    - 0.0.0.0\n    - --port\n    - '8080'\n    - --scheme\n    - http\n    image: cr.weaviate.io/semitechnologies/weaviate:||site.weaviate_version||\n    ports:\n    - 8080:8080\n    - 50051:50051\n    restart: on-failure:0\n    environment:\n      QUERY_DEFAULTS_LIMIT: 25\n      AUTHENTICATION_ANONYMOUS_ACCESS_ENABLED: 'true'\n      PERSISTENCE_DATA_PATH: '/var/lib/weaviate'\n      ENABLE_MODULES: 'ref2vec-centroid'\n      CLUSTER_HOSTNAME: 'node1'\n...\n```\n\n## How to configure\n\nIn your Weaviate schema, you must define how you want this module to vectorize your data. If you are new to Weaviate schemas, you might want to check out the [tutorial on the Weaviate schema](/developers/weaviate/starter-guides/schema.md) first.\n\nFor example, here is an `Article` class which is configured to use ref2vec-centroid. Doing so requires only a class-level `moduleConfig`, containing two fields:\n\n1. `referenceProperties`: a list of the class' reference properties which should be used during the calculation of the centroid.\n2. `method`: the method by which the centroid is calculated. Currently only `mean` is supported.\n\nThe `Article` class specifies its `hasParagraphs` property as the only reference property to be used in the calculation of an `Article` object's vector.\n\nIt is important to note that unlike the other vectorizer modules (e.g. text2vec/multi2vec/img2vec), ref2vec-centroid does not generate embeddings based on the contents of an object. Rather, the point of this module is to calculate an object's vector based on vectors of its *references*.\n\nIn this case, the `Paragraph` class is configured to generate vectors using the text2vec-contextionary module. Thus, the vector representation of the `Article` class is an average of text2vec-contextionary vectors sourced from referenced `Paragraph` instances.\n\nAlthough this example uses text2vec-contextionary to generate vectors for the `Paragraph` class, ref2vec-centroid's behavior remains identical for user-provided vectors. In such a case, ref2vec-centroid's output will still be calculated as an average of the reference vectors; the only difference being the provenance of the reference vectors.\n\n```json\n{\n  \"classes\": [\n    {\n      \"class\": \"Article\",\n      \"description\": \"A class representing a published article\",\n      \"moduleConfig\": {\n        \"ref2vec-centroid\": {\n          \"referenceProperties\": [\"hasParagraphs\"],\n          \"method\": \"mean\"\n        }\n      },\n      \"properties\": [\n        {\n          \"dataType\": [\n            \"text\"\n          ],\n          \"description\": \"Title of the article\",\n          \"name\": \"title\"\n        }\n        ,\n        {\n          \"dataType\": [\n            \"Paragraph\"\n          ],\n          \"description\": \"Paragraphs belonging to this article\",\n          \"name\": \"hasParagraphs\"\n        }\n      ],\n      \"vectorizer\": \"ref2vec-centroid\"\n    },\n    {\n      \"class\": \"Paragraph\",\n      \"description\": \"Paragraphs belonging to an Article\",\n      \"properties\": [\n        {\n          \"dataType\": [\n            \"text\"\n          ],\n          \"description\": \"Content that will be vectorized\",\n          \"moduleConfig\": {\n            \"text2vec-contextionary\": {\n              \"skip\": false,\n              \"vectorizePropertyName\": false\n            }\n          },\n          \"name\": \"content\"\n        }\n      ],\n      \"vectorizer\": \"text2vec-contextionary\"\n    }\n  ]\n}\n```\n\n## How to use\n\nNow that the `Article` class is properly configured to use the ref2vec-centroid module, we can begin to create some objects. If there are not yet any `Paragraph` objects to reference, or if we simply don't want to reference a `Paragraph` object yet, any newly created `Article` object will have its vector set to `nil`.\n\nOnce we are ready to reference one or more existing `Paragraph` objects (with non-nil vectors), our `Article` object will automatically be assigned a centroid vector, calculated using the vectors from all the `Paragraph` objects which are referenced by our `Article` object.\n\n### Updating the centroid\n\nAn object whose class is configured to use ref2vec-centroid will have its vector calculated (or recalculated) as a result of these events:\n- Creating the object with references already assigned as properties\n  - Object `POST`: create a single new object with references\n  - Batch object `POST`: create multiple objects at once, each with references\n- Updating an existing object's list of references. Note that this can happen several ways:\n  - Object `PUT`: update all of the object's properties with a new set of references. This totally replaces the object's existing reference list with the newly provided one\n  - Object `PATCH`: update an existing object by adding any newly provided reference(s) to the object's existing reference list\n  - Reference `POST`: create a new reference to an existing object\n  - Reference `PUT`: update all of the object's references\n- Deleting references from the object. Note that this can happen several ways:\n  - Object `PUT`: update all of the object's properties, removing all references\n  - Reference `DELETE`: delete an existing reference from the object's list of references\n\n**Note:** Adding references in batches is not currently supported. This is because the batch reference feature is specifically built to avoid the cost of updating the vector index. If this is an important use case for you that you'd like to see in production, please feel free to open up a [feature request](https://github.com/weaviate/weaviate/issues/new) on GitHub.\n\n### Making queries\n\nThis module can be used with the existing [nearVector](/developers/weaviate/api/graphql/search-operators.md#nearvector) and [`nearObject`](/developers/weaviate/api/graphql/search-operators.md#nearobject) filters. It does not add any additional GraphQL extensions like `nearText`.\n\n## Additional information\n\nIt is important to note that updating a _referenced_ object will not automatically trigger an update to the _referencing_ object's vector.\n\nIn other words, using our `Article`/`Paragraph` example:\n\nLet's say an `Article` object, `\"On the Philosophy of Modern Ant Colonies\"`, references three `Paragraph` objects: `\"intro\"`, `\"body\"`, and `\"conclusion\"`. Over time, `\"body\"` may be updated as more research has been conducted on the dynamic between worker ants and soldier ants. In this case, the existing vector for the article will not be updated with a new vector based on the refactored `\"body\"`.\n\nIf we want `\"On the Philosophy of Modern Ant Colonies\"`'s centroid vector to be recalculated, we would need to otherwise trigger an update. For example, we could either remove the reference to `\"body\"` and add it back, or simply `PUT` the `Article` object with an identical object.\n\n\n\n", "type": "Documentation", "name": "Retriever-vectorizer-modules Ref2vec-centroid", "path": "developers/weaviate/modules/retriever-vectorizer-modules/ref2vec-centroid.md", "link": "https://weaviate.io/developers/weaviate/modules/retriever-vectorizer-modules/ref2vec-centroid", "timestamp": "2024-05-08 10:50:29", "reader": "JSON", "meta": {}, "chunks": []}