{"text": "\n## &nbsp;&nbsp;Overview\n\nimport ReactPlayer from 'react-player/lazy'\n\n\n\n\nYou've seen some of the powerful queries that Weaviate enables. But how does Weaviate actually store data such that it can supports these queries?\n\nIn this section, we'll take a look at some of the key components that allow Weaviate to perform these queries at speed. In particular, we'll take a look at indexes, which are the backbone of Weaviate's data structure, and the schema, which acts as a blueprint for your data.\n\n## &nbsp;&nbsp;Indexes\n\nAn index is a data structure that allows for efficient retrieval of data. In Weaviate, there are two main indexes: the inverted index and the vector index.\n\nThe **inverted index** is the kind of index that you may be familiar with. You can think of it as a reference table that for example allows you to quickly look up a term and find objects that contain that term.\n\nThe **vector index** allows for efficient retrieval of vectors based on similarity. This is the index that allows Weaviate to perform vector searches fast. Let's dig in a little more.\n\n### &nbsp;&nbsp;Inverted index\n\nAn inverted index deconstructs text into a set of constituent terms and stores them in a data structure, such as a hash table. Take, for example, a data object containing the text \"Conference (Chicago, IL)\".\n\nThe user might want to search for this object based on any of the contained terms such as \"conference\", \"Chicago\", or \"IL\". The inverted index allows Weaviate to quickly retrieve the ID of the object containing the term.\n\nThis is done by mapping the object ID to \"tokens\", where a token is a term that has been extracted from the text. By default, Weaviate uses a `word` tokenization, where only alpha-numeric characters are kept, converted into lowercase, and then split into tokens based on whitespace.\n\nSo an input text `Conference (Chicago, IL)` is indexed by three tokens: `conference`, `chicago`, `il`.\n\nWe will cover more about different available tokenization methods later on.\n\n### &nbsp;&nbsp;Vector index\n\nEach object in Weaviate can be associated with a vector. These vectors are what enables similarity searches that you have seen before. As we mentioned, however, brute-force similarity searches are computationally expensive, as well as growing linearly with the size of the dataset.\n\nTo tackle this problem Weaviate uses vector indexes that utilize an Approximate Nearest Neighbor (ANN) algorithm. The ANN algorithm enables each vector index to organize a set of vectors, so that similar ones to a query can be retrieved at lightning-fast speeds. Weaviate currently uses an HNSW-based ANN index.\n\n\n\n\nEach set of vectors are said to reside in a \"vector space\", indicating that it is a multi-dimensional \"space\" in which vectors are placed.\n\n## &nbsp;&nbsp;Classes\n\n### &nbsp;&nbsp;What is a `class`?\n\nA class in Weaviate is a collection of objects of the same type. Each object in Weaviate must belong to a class, and one class only.\n\nImagine that you are storing a set of quiz items from the game show *Jeopardy!* in Weaviate. A good way to structure it would be to have an object represent a question including all associated attributes, such as the answer, what round it was from, how many points it was worth, when it aired on TV, and so on.\n\nSo, a good way to represent this data would be through a class called `JeopardyQuestion`, which would contain a set of objects, each object representing one such question.\n\nThis is as they refer to individual objects, e.g. a `JeopardyQuestion` object.\n\n### &nbsp;&nbsp;What is in a class?\n\nAs we mentioned, each Jeopardy! question would contain multiple related, but distinct, attributes such as the question, answer, round, points, and so on. These are reflected in each `class` object in Weaviate as a set of `properties`, such as a `question` property, an `answer` property, and so on.\n\n### &nbsp;&nbsp;How many vectors per object?\n\nEach object is represented by one vector, and each class has one vector index. This means that all objects in the class will be associated with the same vector index.\n\nIn other words, all objects in the class will be stored in what is called the same vector space. This is important to keep in mind when designing your data schema in Weaviate. A vector search can only be performed within a single vector space, for reasons that a vector of different lengths, or even those of the same length but with different meanings, cannot be compared.\n\nGoing back to our color analogy that you saw earlier - you wouldn't be able to compare an RGB value to an CMYK value, right? The same applies to vector embeddings that represent text.\n\nSo in Weaviate, a vector search can only search one class at a time. As a result, it is important to design your schema such that objects that you want to search together are in the same class.\n\n## &nbsp;&nbsp;Schema\n\nA `schema` in Weaviate is the blueprint that defines its data structure. It does so for each `class` of objects, which are collections of objects of the same type.\n\nHere is an example schema structure:\n\n\n  Example schema\n\n```json\n{\n  \"classes\": [\n    {\n      \"class\": \"Article\",\n      \"invertedIndexConfig\": {\n        \"bm25\": {\n          \"b\": 0.75,\n          \"k1\": 1.2\n        },\n        \"cleanupIntervalSeconds\": 60,\n        \"stopwords\": {\n          \"additions\": null,\n          \"preset\": \"en\",\n          \"removals\": null\n        }\n      },\n      \"moduleConfig\": {\n        \"text2vec-openai\": {\n          \"model\": \"ada\",\n          \"modelVersion\": \"002\",\n          \"type\": \"text\",\n          \"vectorizeClassName\": true\n        }\n      },\n      \"properties\": [\n        {\n          \"dataType\": [\n            \"text\"\n          ],\n          \"moduleConfig\": {\n            \"text2vec-openai\": {\n              \"skip\": false,\n              \"vectorizePropertyName\": false\n            }\n          },\n          \"name\": \"title\",\n          \"tokenization\": \"word\"\n        },\n        {\n          \"dataType\": [\n            \"text\"\n          ],\n          \"moduleConfig\": {\n            \"text2vec-openai\": {\n              \"skip\": false,\n              \"vectorizePropertyName\": false\n            }\n          },\n          \"name\": \"body\",\n          \"tokenization\": \"word\"\n        }\n      ],\n      \"replicationConfig\": {\n        \"factor\": 1\n      },\n      \"shardingConfig\": {\n        \"virtualPerPhysical\": 128,\n        \"desiredCount\": 1,\n        \"actualCount\": 1,\n        \"desiredVirtualCount\": 128,\n        \"actualVirtualCount\": 128,\n        \"key\": \"_id\",\n        \"strategy\": \"hash\",\n        \"function\": \"murmur3\"\n      },\n      \"vectorIndexConfig\": {\n        \"skip\": false,\n        \"cleanupIntervalSeconds\": 300,\n        \"maxConnections\": 64,\n        \"efConstruction\": 128,\n        \"ef\": -1,\n        \"dynamicEfMin\": 100,\n        \"dynamicEfMax\": 500,\n        \"dynamicEfFactor\": 8,\n        \"vectorCacheMaxObjects\": 1000000000000,\n        \"flatSearchCutoff\": 40000,\n        \"distance\": \"cosine\",\n        \"pq\": {\n          \"enabled\": false,\n          \"bitCompression\": false,\n          \"segments\": 0,\n          \"centroids\": 256,\n          \"encoder\": {\n            \"type\": \"kmeans\",\n            \"distribution\": \"log-normal\"\n          }\n        }\n      },\n      \"vectorIndexType\": \"hnsw\",\n      \"vectorizer\": \"text2vec-openai\"\n    }\n  ]\n}\n```\n\n\n\nThis is a lot of information, and can be quite intimidating. Let's break it down.\n\nFirst of all, you see that the first level key in the object is `classes`, which contains a list of classes. In this case, there is only one class, `Article`.\n\nThe schema specifies for each class:\n- The metadata such as its name (`class`),\n- Its data `properties`,\n- The `vectorizer`,\n- Module configurations (`moduleConfig`),\n- The index configurations (for inverted `invertedIndexConfig` and vector `vectorIndexConfig` indexes),\n- and more.\n\nAny missing information required for schema definition will be automatically inferred by Weaviate based on default values and the imported data.\n\n## &nbsp;&nbsp;Review\n\n### &nbsp;&nbsp;Review exercise\n\n\n\n\n\n\n\n\n\n### &nbsp;&nbsp;Key takeaways\n\n- Weaviate stores data using two main indexes: the inverted index and the vector index.\n- A class in Weaviate represents a collection of objects of the same type, and each object in Weaviate must belong to a single class.\n- A schema is the blueprint that defines Weaviate's data structure.\n- Vector searches can only be performed within a single vector space.\n    - So, any objects you want to search together should be in the same class.\n- Any missing information required for schema definition will be automatically inferred by Weaviate based on default values and the imported data.\n\n\n\n\nimport Quiz from '/src/components/Academy/quiz.js'\nconst invertedIndex = [\n{\nquestionText: 'What is the function of an inverted index in Weaviate?',\nanswerOptions: [\n{\nanswerText: 'It allows for efficient retrieval of vectors based on similarity.',\nisCorrect: false,\nfeedback: 'That is the function of the vector index.',\n},\n{\nanswerText: 'It deconstructs text into a set of constituent terms and stores them for fast retrieval.',\nisCorrect: true,\nfeedback: 'This allows objects containing those terms to be retrieved quickly.',\n},\n{\nanswerText: 'It acts as a blueprint for your data.',\nisCorrect: false,\nfeedback: 'That is the function of the schema.',\n},\n]\n}];\nconst vectorIndex = [\n{\nquestionText: 'What does the vector index in Weaviate enable?',\nanswerOptions: [\n{\nanswerText: 'It enables efficient retrieval of data based on a reference table.',\nisCorrect: false,\nfeedback: 'That is the function of the inverted index, not the vector index.',\n},\n{\nanswerText: 'It enables similarity searches by associating each object with a vector.',\nisCorrect: true,\nfeedback: 'Correct! The vector index uses an Approximate Nearest Neighbor (ANN) algorithm to allow fast similarity searches.',\n},\n{\nanswerText: 'It defines the data structure of Weaviate.',\nisCorrect: false,\nfeedback: 'That is the function of the schema, not the vector index.',\n},\n]\n}];\nconst classDefinition = [\n{\nquestionText: 'What is a class in Weaviate?',\nanswerOptions: [\n{\nanswerText: 'It is a type of index used for efficient data retrieval.',\nisCorrect: false,\nfeedback: 'A class is not a type of index. It is a collection of objects of the same type in Weaviate.',\n},\n{\nanswerText: 'It is a collection of objects of the same type.',\nisCorrect: true,\nfeedback: 'Correct! A class in Weaviate is a collection of objects of the same type.',\n},\n{\nanswerText: 'It is a specific object within a collection.',\nisCorrect: false,\nfeedback: 'A class is not a specific object, but rather a collection of objects of the same type.',\n},\n]\n}];\nconst schemaRole = [\n{\nquestionText: 'What is the function of the schema in Weaviate?',\nanswerOptions: [\n{\nanswerText: 'It allows for efficient retrieval of vectors based on similarity.',\nisCorrect: false,\nfeedback: 'That is the function of the vector index, not the schema.',\n},\n{\nanswerText: 'It deconstructs text into a set of constituent terms and stores them in a data structure.',\nisCorrect: false,\nfeedback: 'That is the function of the inverted index, not the schema.',\n},\n{\nanswerText: 'It acts as a blueprint that defines the data structure of Weaviate.',\nisCorrect: true,\nfeedback: 'The schema defines the data structure for each class of objects in Weaviate.',\n},\n]\n},\n]\n", "type": "Documentation", "name": "schema_and_imports-data_structure", "path": "developers/academy/zero_to_mvp/103_schema_and_imports/10_data_structure.mdx", "link": "https://weaviate.io/developers/academy/zero_to_mvp/schema_and_imports/data_structure", "timestamp": "2024-02-08 21:20:02", "reader": "JSON", "meta": {}, "chunks": []}