{"text": "\n\n\nVector indexes facilitate efficient, vector-first data storage and retrieval.\n\n## Index configuration parameters\n\nUse these parameters to configure the index type and their properties. They can be set in the collection configuration.\n\n| Parameter | Type | Default | Details |\n| :-- | :-- | :-- | :-- |\n| `vectorIndexType` | string | `hnsw` | Optional. The index type - can be `hnsw` or `flat`. |\n| `vectorIndexConfig` | object | - | Optional. Set parameters that are specific to the vector index type. |\n\n\n  How to select the index type\n\nGenerally, the `hnsw` index type is recommended for most use cases. The `flat` index type is recommended for use cases where the data the number of objects per index is low, such as in multi-tenancy cases.\n\nSee this section for more information about the different index types and how to choose between them.\n\n\n\nIf faster import speeds are desired, asynchronous indexing allows de-coupling of indexing from object creation.\n\n\n## HNSW indexes\n\nHNSW indexes are scalable and super fast at query time, but HNSW algorithms are costly when you add data during the index building process.\n\n### HNSW index parameters\n\nSome HNSW parameters are mutable, but others cannot be modified after you create your collection.\n\n| Parameter | Type | Default | Changeable | Details |\n| :-- | :-- | :-- | :-- | :-- |\n| `cleanupIntervalSeconds` | integer | 300 | Yes | Cleanup frequency. This value does not normally need to be adjusted. A higher value means cleanup runs less frequently, but it does more in a single batch. A lower value means cleanup is more frequent, but it may be less efficient on each run. |\n| `distance` | string | `cosine` | No | Distance metric. The metric that measures the distance between two arbitrary vectors. For available distance metrics, see supported distance metrics. |\n| `ef` | integer | -1 | Yes |  Balance search speed and recall. `ef` is the size of the dynamic list that the HNSW uses during search. Search is more accurate when `ef` is higher, but it is also slower. `ef` values greater than 512 show diminishing improvements in recall.Dynamic `ef`. Weaviate automatically adjusts the `ef` value and creates a dynamic `ef` list when `ef` is set to -1. For more details, see dynamic ef. |\n| `efConstruction` | integer | 128 | No | Balance index search speed and build speed. A high `efConstruction` value means you can lower your `ef` settings, but importing is slower.`efConstruction` must be greater than 0. |\n| `maxConnections` | integer | 64 | No | Maximum number of connections per element. `maxConnections` is the connection limit per layer for layers above the zero layer. The zero layer can have (2 * maxConnections) connections.  `maxConnections` must be greater than 0. |\n| `dynamicEfMin` | integer | 100 | Yes | *New in `v1.10.0`.*  Lower bound for dynamic `ef`. Protects against a creating search list that is too short.This setting is only used when `ef` is -1. |\n| `dynamicEfMax` | integer | 500 | Yes | *New in `v1.10.0`.*  Upper bound for dynamic `ef`. Protects against creating a search list that is too long. If `dynamicEfMax` is higher than the limit, `dynamicEfMax` does not have any effect. In this case, `ef` is the limit.This setting is only used when `ef` is -1. |\n| `dynamicEfFactor` | integer | 8 | Yes | *New in `v1.10.0`.*  Multiplier for dynamic `ef`. Sets the potential length of the search list. This setting is only used when `ef` is -1. |\n| `flatSearchCutoff` | integer | 40000 | Yes | Optional. Threshold for the flat-search cutoff. To force a vector index search, set `\"flatSearchCutoff\": 0`. |\n| `skip` | boolean | `false` | No | When true, do not index the collection.  Weaviate decouples vector creation and vector storage. If you skip vector indexing, but a vectorizer is configured (or a vector is provided manually), Weaviate logs a warning each import.  To skip indexing and vector generation, set `\"vectorizer\": \"none\"` when you set `\"skip\": true`.  See When to skip indexing. |\n| `vectorCacheMaxObjects`| integer | `1e12` | Yes | Maximum number of objects in the memory cache. By default, this limit is set to one trillion (`1e12`) objects when a new collection is created. For sizing recommendations, see Vector cache considerations. |\n| `pq` | object | -- | Yes | Enable and configure product quantization (PQ) compression.  PQ assumes some data has already been loaded. You should have 10,000 to 100,000 vectors per shard loaded before you enable PQ.  For PQ configuration details, see PQ configuration parameters. |\n\n### PQ configuration parameters\n\nConfigure `pq` with these parameters.\n\n\n\n\n\n\n\n### HNSW Configuration tips\n\nTo determine reasonable settings for your use case, consider the following questions and compare your answers in the table below:\n\n1. How many queries do you expect per second?\n1. Do you expect a lot of imports or updates?\n1. How high should the recall be?\n\n| Number of queries | Many imports or updates | Recall level | Configuration suggestions |\n| --- | --- | --- | --- |\n| not many | no | low | This is the ideal scenario. Keep both the `ef` and `efConstruction` settings low. You don't need a big machine and you will still be happy with the results. |\n| not many | no | high | Here the tricky thing is that your recall needs to be high. Since you're not expecting a lot of requests or imports, you can increase both the `ef` and `efConstruction` settings. Keep increasing them until you are happy with the recall. In this case, you can get pretty close to 100%. |\n| not many | yes | low | Here the tricky thing is the high volume of imports and updates. Be sure to keep `efConstruction` low. Since you don't need a high recall, and you're not expecting a lot of queries, you can adjust the `ef` setting until you've reached the desired recall. |\n| not many | yes | high | The trade-offs are getting harder. You need high recall _and_ you're dealing with a lot of imports or updates. This means you need to keep the `efConstruction` setting low, but you can significantly increase your `ef` setting because your queries per second rate is low. |\n| many | no | low | Many queries per second means you need a low `ef` setting. Luckily you don't need high recall so you can significantly increase the `efConstruction` value. |\n| many | no | high | Many queries per second means a low `ef` setting. Since you need a high recall but you are not expecting a lot of imports or updates, you can increase your `efConstruction` until you've reached the desired recall. |\n| many | yes | low | Many queries per second means you need a low `ef` setting. A high number of imports and updates also means you need a low `efConstruction` setting. Luckily your recall does not have to be as close to 100% as possible. You can set `efConstruction` relatively low to support your input or update throughput, and you can use the `ef` setting to regulate the query per second speed. |\n| many | yes | high | Aha, this means you're a perfectionist _or_ you have a use case that needs the best of all three worlds. Increase your `efConstruction` value until you hit the time limit of imports and updates. Next, increase your `ef` setting until you reach your desired balance of queries per second versus recall.  While many people think they need maximize all three dimensions, in practice that's usually not the case. We leave it up to you to decide, and you can always ask for help in our forum. |\n\nThis set of values is a good starting point for many use cases.\n\n|Parameter|Value|\n|:--|:--|\n|`ef`|`64`|\n|`efConstruction`|`128`|\n|`maxConnections`|`32`|\n\n\n## Flat indexes\n\n\nFlat indexes are recommended for use cases where the number of objects per index is low, such as in multi-tenancy use cases.\n\n| Parameter | Type | Default | Changeable | Details |\n| :-- | :-- | :-- | :-- | :-- |\n| `vectorCacheMaxObjects`| integer | `1e12` | Yes | Maximum number of objects in the memory cache. By default, this limit is set to one trillion (`1e12`) objects when a new collection is created. For sizing recommendations, see Vector cache considerations. |\n| `bq` | object | -- | No | Enable and configure binary quantization (BQ) compression.  For BQ configuration details, see BQ configuration parameters. |\n\n### BQ configuration parameters\n\nConfigure `bq` with these parameters.\n\n| Parameter | Type | Default | Details |\n| :-- | :-- | :-- | :-- |\n| `enabled` | boolean | `false` | Enable BQ. Weaviate uses binary quantization (BQ) compression when `true`. |\n| `rescoreLimit` | integer | -1 | The minimum number of candidates to fetch before rescoring. |\n| `cache` | boolean | `false` | Whether to use the vector cache. |\n\n\n## Asynchronous indexing\n\nAvailable starting in `v1.22`. This is an experimental feature. Please use with caution.\n\nStarting in Weaviate `1.22`, you can use asynchronous indexing by opting in.\n\nTo enable asynchronous indexing, set the `ASYNC_INDEXING` environment variable to `true` in your Weaviate configuration (the `docker-compose.yml` file if you use Docker Compose). This setting enables asynchronous indexing for all collections.\n\n\n  Example Docker Compose configuration\n\n```yaml\n---\nversion: '3.4'\nservices:\n  weaviate:\n    command:\n    - --host\n    - 0.0.0.0\n    - --port\n    - '8080'\n    - --scheme\n    - http\n    image: semitechnologies/weaviate:||site.weaviate_version||\n    restart: on-failure:0\n    ports:\n     - 8080:8080\n     - 50051:50051\n    environment:\n      QUERY_DEFAULTS_LIMIT: 25\n      QUERY_MAXIMUM_RESULTS: 10000\n      AUTHENTICATION_ANONYMOUS_ACCESS_ENABLED: 'true'\n      PERSISTENCE_DATA_PATH: '/var/lib/weaviate'\n      DEFAULT_VECTORIZER_MODULE: 'text2vec-openai'\n      ENABLE_MODULES: 'text2vec-cohere,text2vec-huggingface,text2vec-openai,text2vec-palm,generative-cohere,generative-openai,generative-palm'\n      CLUSTER_HOSTNAME: 'node1'\n      AUTOSCHEMA_ENABLED: 'false'\n      ASYNC_INDEXING: 'true'\n...\n```\n\n\n\nTo get the index status, call the node status endpoint.\n\n\n  Node status example usage\n\nThe `nodes/shards/vectorQueueLength` field shows the number of objects that still have to be indexed.\n\n\n\n\nThen, you can check the status of the vector index queue by inspecting the output.\n\n\nThe `vectorQueueLength` field will show the number of remaining objects to be indexed. In the example below, the vector index queue has 425 objects remaining to be indexed on the `TestArticle` shard, out of a total of 1000 objects.\n\n```json\n{\n  \"nodes\": [\n    {\n      \"batchStats\": {\n        \"ratePerSecond\": 0\n      },\n      \"gitHash\": \"e6b37ce\",\n      \"name\": \"weaviate-0\",\n      \"shards\": [\n        {\n          \"class\": \"TestArticle\",\n          \"name\": \"nq1Bg9Q5lxxP\",\n          \"objectCount\": 1000,\n          // highlight-start\n          \"vectorIndexingStatus\": \"INDEXING\",\n          \"vectorQueueLength\": 425\n          // highlight-end\n        },\n      ],\n      \"stats\": {\n        \"objectCount\": 1000,\n        \"shardCount\": 1\n      },\n      \"status\": \"HEALTHY\",\n      \"version\": \"1.22.1\"\n    },\n  ]\n}\n```\n\n\n\n\n- Concepts: Indexing\n- Concepts: Vector Indexing\n\n\n\n", "type": "Documentation", "name": "schema-vector-index", "path": "developers/weaviate/config-refs/schema/vector-index.md", "link": "https://weaviate.io/developers/weaviate/config-refs/schema/vector-index", "timestamp": "2024-02-08 20:22:44", "reader": "JSON", "meta": {}, "chunks": []}