{"text": "\n##  Create Weaviate Instance\n\nFor this unit, you will require your own instance of Weaviate.\n\nIf you do not have one, we recommend setting one up on the [Weaviate Cloud Services (WCS)](https://console.weaviate.cloud/). **A free sandbox instance should be just fine.**\n\nFollow the \"Get Started with WCS\" [section on this page](../101_hello_weaviate/40_set_up.mdx#get-started-with-wcs) and come back.\n\n##  Access your Weaviate Instance\n\nNow, let's make sure that you can access your Weaviate instance by following the example below.\n\nMake sure you know what your Weaviate instance address is - it should look like:\n```\nhttps://your-instance-name.weaviate.network\n```\nYou can find it in your WCS dashboard.\n\nThe code to access depends on whether you have authentication turned on, or off. If you are not sure, go to your WCS dashboard and check what it says about \"Authentication\".\n\n###  With API key authentication (Recommended)\n\nIf authentication is on, you can instantiate your client as shown below.\n\n\n\n\n\n\n\n###  Without Authentication\n\nIf authentication is switched off in your instance, you do not need the authentication parameter.\n\n\n\n\n\n\n\n##  Confirm access\n\nOnce your client is instantiated, you can confirm that you can write to your Weaviate instance by running the following code:\n\n\n\n\n\n\n\nYou should see a long alphanumeric string printed on your screen, like `\"59340403-4bcd-479f-ae9c-de5da039ac0e\"`.\n\nIf you do, you can access your Weaviate instance and have write access! Which means you are ready to move on.\n\nLet's do one more thing before we move on, though, which is to clean up the test data that we've just created.\n\n\n\n\n\n\n\nWe'll see you in the next section.\n\n##  Review\n\n###  Key takeaways\n\n- You need to create a Weaviate instance (e.g. on WCS) for this unit.\n- Access your Weaviate instance with API key authentication or without authentication as appropriate.\n- Confirm access to your Weaviate instance by running the provided code snippet.\n\n\n", "type": "Documentation", "name": "Schema_and_imports Preparation", "path": "developers/academy/py/zero_to_mvp/103_schema_and_imports/05_preparation.mdx", "link": "https://weaviate.io/developers/academy/py/zero_to_mvp/schema_and_imports/preparation", "timestamp": "2024-05-08 10:48:43", "reader": "JSON", "meta": {}, "chunks": []}