{"text": "\n##  Unit overview\n\nimport PreviewUnit from '../../../_snippets/preview.mdx'\n\n\n\nimport ReactPlayer from 'react-player/lazy'\n\n -->\n\n\n\n\n\n\nChunking is an important concept in the world of vector databases and language models. Although we've looked at relatively small pieces of text in previous units, real-world text data can be much longer.\n\nThink about lengths of articles, transcripts, or even books. Instead of a few words, these texts can be thousands, or tens of thousands of words long if not longer. *The Lord of the Rings*, for example, is over 500,000 words long!\n\nChunking splits texts like these into smaller pieces of texts, i.e. \"chunks\", before storing them in a vector database, or passing them to a language model.\n\nThis can seem relatively innocuous at first, like deciding where to split a sentence or a paragraph into two. But chunking decisions can significantly impact the search performance and behavior of vector databases as well as the output from a language model. This unit covers this seemingly simple, nuanced topic from the perspective of a user.\n\nWe will begin by covering what chunking is, and why it is used. Then, we will move on to cover various chunking methods before discussing key considerations when deciding on a chunking strategy, as well as some suggested starting points.\n\nBy the end of this unit, you will have a good understanding of chunking in general, and be able to implement some solid chunking strategies based on your actual needs.\n\n###  Prerequisites\n\n- (**Required**) A Python (3) environment with `weaviate-client` installed.\n- (**Required**) Complete [101A Weaviate Academy Preparation](../../zero_to_mvp/setup.mdx)\n- (*Recommended*) Complete [Hello, Weaviate](../../zero_to_mvp/101_hello_weaviate/index.mdx)\n- (*Recommended*) Complete [Queries 1](../../zero_to_mvp/102_queries_1/index.mdx)\n- (*Recommended*) Complete [Schema and Imports](../../zero_to_mvp/103_schema_and_imports/index.mdx)\n\n##  Learning objectives\n\n\n\n\n\n\n", "type": "Documentation", "name": "Standalone Chunking", "path": "developers/academy/py/standalone/chunking/index.mdx", "link": "https://weaviate.io/developers/academy/py/standalone/chunking", "timestamp": "2024-05-08 10:47:49", "reader": "JSON", "meta": {}, "chunks": []}