{"text": "\n\n## Overview\n\nWeaviate can be configured and deployed in many different ways. Generally, the two first decisions to make in using Weaviate involve:\n\n- The choice of deployment setup, and\n- The choice of vectorizer modules to enable.\n\nThis page helps you to find the right combination for your needs.\n\nIn all cases, we recommend using a Weaviate client library to interact with your Weaviate instance.\n\n## Available options\n\n### Deployment\n\nWeaviate can be deployed in the following ways:\n- Embedded Weaviate\n- Docker-Compose\n- Weaviate Cloud Services (WCS)\n- Self-managed Kubernetes\n- Hybrid SaaS\n\n### Vectorization\n\nWhen adding data objects to Weaviate, you have two choices:\n- Specify the object vector directly, or\n- Use a Weaviate vectorizer module to generate the object vector.\n\nIf you are using a vectorizer module, your choices will depend on your input medium/modality, as well as whether you would prefer a local or API-based vectorizer.\n\nGenerally speaking, an API-based vectorizer will be more convenient to use, but will incur additional costs. On the other hand, a local vectorizer will be lower cost, but may require specialized hardware (such as a GPU) to run at comparable speeds.\n\nFor text, this open-source benchmark provides a good overview of the performance of different vectorizers. Please do keep in mind that domain-specific, or real-world performance may vary.\n\n## By use case\n\nAs a starting point, we recommend the following setups for different use cases.\n\n### Quick evaluation\n\nIf you are evaluating Weaviate, we recommend the following easy and convenient setup:\n\n- An easy-to-use Weaviate instance, with\n    - A Weaviate Cloud Services (WCS) sandbox, or\n    - Embedded Weaviate\n- An inference-API based text vectorizer\n    - (e.g. `text2vec-cohere`, `text2vec-huggingface`, `text2vec-openai`, or  `text2vec-palm`).\n\nThis will allow you to quickly get started with Weaviate, and evaluate its capabilities. Note that the Quickstart guide uses this setup, with a WCS sandbox, and an API vectorizer.\n\n### Development\n\nFor development, we recommend using\n\n- Docker-Compose or Weaviate Cloud Services (WCS), with\n- A vectorization strategy that at least approximates your production needs.\n\n#### Docker-Compose vs. Weaviate Cloud Services (WCS)\n\nOf the two, Docker-Compose is more flexible as it exposes all configuration options, and can be used in a local development environment. Additionally, it can use local vectorizer modules such as `text2vec-transformers` or `multi2vec-clip` for example.\n\nOn the other hand, WCS instances are easier to spin up, and takes away the need to manage the deployment yourself.\n\nNote that Embedded Weaviate is currently not recommended for serious development use as it is at an experimental phase.\n\n#### Vectorization strategy\n\nFor development, we recommend using a vectorizer module that at least approximates your needs.\n\nAs a first point, you must choose:\n- Whether to vectorize data yourself and import it into Weaviate, or\n- To use a Weaviate vectorizer module.\n\nThen, we recommend choosing a vectorizer module that is as close as possible to your production needs. For example, if search quality is of paramount importance, we suggest using your preferred vectorizer module in development as well.\n\nKeep in mind two other factors, which are cost, and their footprint.\n- Vectorization, such as with an API-based vectorizer, can be expensive. This is especially true if you are dealing with very large datasets.\n- Vector lengths can vary by a factor of ~5, which will impact both your storage and memory requirements. This can ultimately impact cost down the line.\n\n### Production\n\nFor use in production, generally we recommend\n\n- Weaviate Cloud Services (WCS),\n- Self-managed Kubernetes, or\n- Hybrid SaaS.\n\nAll of these options are scalable, with Kubernetes and Hybrid SaaS options offering the most flexibility in configuration.\n\nAs with the development use case, a WCS-based solution would be the easiest in terms of setup and maintenance, while a self-managed Kubernetes deployment combines the flexibility and scalability.\n\nIf you wish to fully control your Weaviate deployment without having to manage it yourself, Hybrid SaaS offers the best-of-both-worlds solution.\n\n## By Vectorizer & Reranker\n\nWeaviate makes various vectorizer & reranker modules available for different media types, also called modalities.\n\nWe recommend starting from the following table of vectorizers and their availability in different Weaviate setups.\n\n| Module type | Modality | Module | Embedded Weaviate  | Weaviate Cloud Services | Docker-Compose | Kubernetes | Hybrid SaaS |\n| --- | --- | --- | --- | --- | --- | --- | --- |\n| Vectorizer | **Text** | `text2vec-cohere` | :white_check_mark: | :white_check_mark: | :white_check_mark: | :white_check_mark: | :white_check_mark: |\n| Vectorizer | **Text** | `text2vec-huggingface` | :white_check_mark: | :white_check_mark: | :white_check_mark: | :white_check_mark: | :white_check_mark: |\n| Vectorizer | **Text** | `text2vec-openai` | :white_check_mark: | :white_check_mark: | :white_check_mark: | :white_check_mark: | :white_check_mark: |\n| Vectorizer | **Text** | `text2vec-palm` | :white_check_mark: | :white_check_mark: | :white_check_mark: | :white_check_mark: | :white_check_mark: |\n| Vectorizer | **Text** | `text2vec-transformers` | :x: | :x: | :white_check_mark: | :white_check_mark: | :white_check_mark: |\n| Vectorizer | **Text** | `text2vec-gpt4all` | :x: | :x: | :white_check_mark: | :white_check_mark: | :white_check_mark: |\n| Vectorizer | **Text** | `text2vec-contextionary` | :x: | :x: | :white_check_mark: | :white_check_mark: | :white_check_mark: |\n| Vectorizer | **Text & Image** | `multi2vec-clip` | :x: | :x: | :white_check_mark: | :white_check_mark: | :white_check_mark: |\n| Vectorizer | **7 (List)** | `multi2vec-bind` | :x: | :x: | :white_check_mark: | :white_check_mark: | :white_check_mark: |\n| Vectorizer | **Image** | `img2vec-neural` | :x: | :x: | :white_check_mark: | :white_check_mark: | :white_check_mark: |\n| Vectorizer | **Vectors** | `ref2vec-centroid` | :white_check_mark: | :white_check_mark: | :white_check_mark: | :white_check_mark: | :white_check_mark: |\n| Reranker | **Text** | `reranker-cohere` | :white_check_mark: | :white_check_mark: | :white_check_mark: | :white_check_mark: | :white_check_mark: |\n| Reranker | **Text** | `reranker-transformers` | :x: | :x: | :white_check_mark: | :white_check_mark: | :white_check_mark: |\n\n\n\n\n", "type": "Documentation", "name": "starter-guides-which-weaviate", "path": "developers/weaviate/starter-guides/which-weaviate.md", "link": "https://weaviate.io/developers/weaviate/starter-guides/which-weaviate", "timestamp": "2023-11-13 10:41:37", "reader": "JSON", "meta": {}, "chunks": []}