{"text": "\n\n## Overview\n\nThis tutorial will guide you through the process of defining a schema for your data, including commonly used settings and key considerations.\n\n- (Recommended) Complete the Quickstart tutorial.\n- A Weaviate instance with an administrator API key.\n- Install your preferred Weaviate client library.\n\n## Schema: An Introduction\n\n### What is a schema?\n\nThe database schema defines how data is stored, organized and retrieved in Weaviate.\n\nA schema **must** be defined before data can be imported. We generally recommend defining as much of the schema manually, although Weaviate can also infer the schema during import if auto-schema feature is enabled.\n\nLet's begin with a simple example before diving into the details.\n\n### Basic schema creation\n\nThis example will create a simple collection called **Question**, with three properties (`answer`, `question`, and `category`), the `text2vec-openai` vectorizer and the `generative-cohere` module for RAG. It then retrieves the schema and displays it.\n\n\n\n\nThe returned configuration should look something like this:\n\n\n  See the returned schema\n\nNote: results will vary depending on your client library.\n\n```json\n{\n    \"classes\": [\n        {\n            \"class\": \"Question\",\n            \"description\": \"Information from a Jeopardy! question\",\n            \"invertedIndexConfig\": {\n                \"bm25\": {\n                    \"b\": 0.75,\n                    \"k1\": 1.2\n                },\n                \"cleanupIntervalSeconds\": 60,\n                \"stopwords\": {\n                    \"additions\": null,\n                    \"preset\": \"en\",\n                    \"removals\": null\n                }\n            },\n            \"moduleConfig\": {\n                \"text2vec-openai\": {\n                    \"model\": \"ada\",\n                    \"modelVersion\": \"002\",\n                    \"type\": \"text\",\n                    \"vectorizeClassName\": true\n                }\n            },\n            \"properties\": [\n                {\n                    \"dataType\": [\n                        \"text\"\n                    ],\n                    \"description\": \"The question\",\n                    \"moduleConfig\": {\n                        \"text2vec-openai\": {\n                            \"skip\": false,\n                            \"vectorizePropertyName\": false\n                        }\n                    },\n                    \"name\": \"question\",\n                    \"tokenization\": \"word\"\n                },\n                {\n                    \"dataType\": [\n                        \"text\"\n                    ],\n                    \"description\": \"The answer\",\n                    \"moduleConfig\": {\n                        \"text2vec-openai\": {\n                            \"skip\": false,\n                            \"vectorizePropertyName\": false\n                        }\n                    },\n                    \"name\": \"answer\",\n                    \"tokenization\": \"word\"\n                },\n                {\n                    \"dataType\": [\n                        \"text\"\n                    ],\n                    \"description\": \"The category\",\n                    \"moduleConfig\": {\n                        \"text2vec-openai\": {\n                            \"skip\": false,\n                            \"vectorizePropertyName\": false\n                        }\n                    },\n                    \"name\": \"category\",\n                    \"tokenization\": \"word\"\n                }\n            ],\n            \"replicationConfig\": {\n                \"factor\": 1\n            },\n            \"shardingConfig\": {\n                \"virtualPerPhysical\": 128,\n                \"desiredCount\": 1,\n                \"actualCount\": 1,\n                \"desiredVirtualCount\": 128,\n                \"actualVirtualCount\": 128,\n                \"key\": \"_id\",\n                \"strategy\": \"hash\",\n                \"function\": \"murmur3\"\n            },\n            \"vectorIndexConfig\": {\n                \"skip\": false,\n                \"cleanupIntervalSeconds\": 300,\n                \"maxConnections\": 64,\n                \"efConstruction\": 128,\n                \"ef\": -1,\n                \"dynamicEfMin\": 100,\n                \"dynamicEfMax\": 500,\n                \"dynamicEfFactor\": 8,\n                \"vectorCacheMaxObjects\": 1000000000000,\n                \"flatSearchCutoff\": 40000,\n                \"distance\": \"cosine\"\n            },\n            \"vectorIndexType\": \"hnsw\",\n            \"vectorizer\": \"text2vec-openai\"\n        }\n    ]\n}\n```\n\n\n\nAlthough we only specified the collection name and properties, the returned schema includes much more information.\n\nThis is because Weaviate infers the schema based on the data and defaults. Each of these options can be specified manually at collection creation time.\n\nYes, to an extent. There are no restrictions against adding new collections, or properties. However, not all settings are mutable within existing collections. For example, you can not change the vectorizer or the generative module. You can read more about this in the schema reference.\n\n## Schemas in detail\n\nConceptually, it may be useful to think of each Weaviate instance comprising of multiple collections, each of which is a set of objects that share a common structure.\n\nFor example, you might have a movie database with `Movie` and `Actor` collections, each with their own properties. Or you might have a news database with `Article`, `Author` and `Publication` collections.\n\n### Available settings\n\nFor the most part, each collection should be thought of as isolated from the others (in fact, they are!). Accordingly, they can be configured independently. Each collection has:\n- A set of `properties` specifying the object data structure.\n- Multi-tenancy settings.\n- Vectorizer and generative modules.\n- Index settings (for vector and inverted indexes).\n- Replication and sharding settings.\n\nAnd depending on your needs, you might want to change any number of these.\n\n### Properties\n\nEach property has a number of settings that can be configured, such as the `dataType`, `tokenization`, and `vectorizePropertyName`. You can read more about these in the schema reference.\n\nSo for example, you might specify a schema like the one below, with additional options for the `question` and `answer` properties:\n\n\n\n\n#### Cross-references\n\nThis is also where you would specify cross-references, which are a special type of property that links to another collection.\n\nCross-references can be very useful for creating relationships between objects. For example, you might have a `Movie` collection with a `withActor` cross-reference property that points to the `Actor` collection. This will allow you to retrieve relevant actors for each movie.\n\nHowever, please be aware that using cross-references can be costly in terms of performance, so we recommend using them sparingly. Additionally, cross-reference properties do not affect the object's vector. So if you want the related properties to be considered in a vector search, they should be included in the object's vectorized properties.\n\nYou can find examples of how to define and use cross-references here.\n\n### Vectorizer and generative modules\n\nEach collection can be configured with a vectorizer and a generative module. The vectorizer is used to generate vectors for each object and also for any un-vectorized queries, and the generative module is used to perform retrieval augmented generation (RAG) queries.\n\nThese settings are currently immutable once the collection is created. Accordingly, you should choose the vectorizer and generative module carefully.\n\nIf you are not sure where to start, modules that integrate with popular API-based model providers such as Cohere or OpenAI are good starting points. You can find a list of available vectorizer modules here and generative modules here.\n\n### Multi-tenancy settings\n\nStarting from version `v1.20.0`, each collection can be configured as a multi-tenancy collection. This allows separation of data between tenants, typically end-users, at a much lower overhead than creating separate collections for each tenant.\n\nThis is useful if you want to use Weaviate as a backend for a multi-tenant (e.g. SaaS) application, or if data isolation is required for any other reason.\n\n\n\n\n### Index settings\n\nWeaviate uses two types of indexes: vector indexes and inverted indexes. Vector indexes are used to store and organize vectors for fast vector similarity-based searches, and inverted indexes are used to store data for fast filtering and keyword searches.\n\n\n\n\n### Replication and sharding settings\n\n#### Replication\n\nReplication settings determine how many copies of the data are stored. For example, a replication setting of 3 means that each object is stored on 3 different replicas. This is important for providing redundancy and fault tolerance in production. (The default replication factor is 1.)\n\nThis goes hand-in-hand with consistency settings, which determine how many replicas must respond before an operation is considered successful.\n\nWe recommend that you read the concepts page on replication for information on how replication works in Weaviate. To specify a replication factor, follow this how-to.\n\n#### Sharding\n\nSharding settings determine how each collection is sharded and distributed across nodes. This is not a setting that is typically changed, but you can use it to control how many shards are created in a cluster, and how many virtual shards are created per physical shard (read more here).\n\n## Notes\n\n### Collection & property names\n\nCollection names always start with a capital letter. Properties always begin with a small letter. You can use `PascalCase` class names, and property names allow underscores. Read more here.\n\n### Related resources\n\nThe following resources include more detailed information on schema settings and how to use them:\n\n- Schema - Reference: Configuration: A reference of all available schema settings.\n- Collections - How-to: manage data: Code examples for creating and managing collections, including how to configure various settings using client libraries.\n- Schema - Reference: REST: A reference of all available schema settings for the REST API.\n\n\n\n\n", "type": "Documentation", "name": "starter-guides-schema", "path": "developers/weaviate/starter-guides/schema.md", "link": "https://weaviate.io/developers/weaviate/starter-guides/schema", "timestamp": "2024-02-08 20:23:45", "reader": "JSON", "meta": {}, "chunks": []}