{"text": "\n## Overview\n\nHere, you will learn how to connect to your instance of Weaviate, including how to provide authentication parameters such as the Weaviate API key, and inference API keys (e.g. Cohere, Hugging Face or OpenAI API keys).\n\n## Prerequisites\n\nFor this tutorial, you need to know:\n- The location of your Weaviate instance, and\n- The **configuration** of the Weaviate instance, especially:\n    - Whether **authentication is enabled**, and if so, the allowed authentication methods.\n    - If any **modules** are being used that use external inference APIs (e.g. OpenAI).\n\n\n### For WCS users\n\nYou can find the cluster URL, authentication status and enabled modules for each instance, in the Weaviate Cloud Services dashboard.\n\n### For Docker/Kubernetes deployments\n\nYou can find the relevant configuration in the configuration files, such as `docker-compose.yml` for Docker Compose, or `values.yaml` in the Helm chart.\n\nFor Docker instances, your URL will likely be `http://localhost:8080` unless specified otherwise.\n\nIf you are using Embedded Weaviate, you do not need to specify a URL at the client instantiation step, and most likely will not need any authentication.\n\n\nSo, you can simply instantiate with the following.\n\n\n\n\nFor the default configuration, and more about the option in general, see the Embedded Weaviate documentation.\n\n# Connecting to Weaviate\n\n## Without Authentication\n\nThis set up is not recommended in general as anyone can access your Weaviate instance as long as they have the URL.\n\n\n\n## With authentication enabled\n\nIf you do have authentication enabled, you can log in with an API key (recommended), or with OIDC.\n\n### With API key authentication (recommended)\n\nThis is **not** the place to specify the API key for services such as Cohere, Hugging Face or OpenAI.\n\n\n\n### With OIDC authentication (WCS username & password)\n\nThis authentication method is available for WCS. Your specific identity provider may use a different authentication configuration, of which there are many.\n\n- Read more about OIDC authentication.\n\n\n\n## Providing inference API keys\n\nAdditionally, you can provide inference API keys to Weaviate so that you can use modules that leverage external APIs, for example `generative-openai` or `text2vec-cohere`.\n\nThis is done via an additional header, added as below:\n\n\n\n## Next\n\nYou can read more about some of the concepts discussed here, such as:\n- Authentication\n- Configuration\n- Modules\n\nFor more in-depth tutorials, learn how to build schemas, import data, query data and more.\n\n\n\n\n", "type": "Documentation", "name": "tutorials-connect", "path": "developers/weaviate/tutorials/connect.mdx", "link": "https://weaviate.io/developers/weaviate/tutorials/connect", "timestamp": "2023-11-13 10:41:39", "reader": "JSON", "meta": {}, "chunks": []}