{"text": "\n\n\n\n## Overview\n\nIn this tutorial, you will learn how to use cross-references to manage relationships between objects, and to use them to enhance your queries.\n\nMany applications require the ability to manage relationships between objects. For example, a blog application might need to store information about the author of each post. Or, a document store may chunk documents into smaller pieces and store them in separate objects, each with a reference to the original document.\n\nIn Weaviate, you can use cross-references to manage relationships between objects. In the preceding examples, a blog post class could have a cross-reference property called `hasAuthor` to link each post to its author, or a chunk class could have a cross-reference property called `sourceDocument` to link each chunk to its original document.\n\nWe will refer to the originating object as the **source** object, and the object that is being linked to (cross-referenced object) as the **target** object.\n\n### Prerequisites\n\nThis tutorial assumes that you have completed the QuickStart tutorial and have access to a Weaviate instance with write access.\n\n## When to use cross-references\n\nCross-references are useful when you need to establish relationships between objects in Weaviate. For example, you might want to link:\n\n- A blog post (source) to its author (target).\n- A document chunk (source) to its original document (target).\n- A product (source) to its manufacturer (target).\n- A quiz item (source) to its category (target).\n\nIn each of these cases, you can use a cross-reference property to link the objects together.\n\n## How cross-references work\n\nIn Weaviate, cross-reference relationships are defined at the source class as a property. Each of these properties is characterized by a name and a data type. Each cross-reference property can be directed to one or more target classes. For example, a `hasAuthor` cross-reference property might be directed to the `Author` class, while a `sourceDocument` cross-reference property might be directed to the `Document` class.\n\n### Directionality of cross-references\n\nCross-references are uni-directional; to establish a bi-directional relationship, two distinct cross-reference properties are required, facilitating linkage in both directions.\n\n### Cross references and vectors\n\nLinking objects with cross-references does not affect the vectorization of the objects.\n\nFor example, linking a blog post to its author with a cross-reference will not affect the vector of the author object or the blog object.\n\n## Managing cross-references\n\nEach cross-reference can be created, updated, and deleted independently of the objects that it links. This allows you to manage relationships between objects without having to modify the objects themselves.\n\nTo create a cross-reference, you must include the cross-reference property in the source class, and then add the cross-reference to the source object.\n\n### Include a cross-reference property\n\nA cross-reference property must be included in the class definition. For example, to create a `hasAuthor` cross-reference property in the `BlogPost` class, you would include the following in the class definition:\n\n```json\n{\n    \"class\": \"BlogPost\",\n    \"properties\": [\n        ...  // other class properties\n        // highlight-start\n        {\n            \"name\": \"hasAuthor\",\n            \"dataType\": [\"Author\"],\n        },\n        // highlight-end\n    ],\n    ...  // other class attributes (e.g. vectorizer)\n}\n```\n\n### Create a cross-reference\n\nTo create a cross-reference, Weaviate requires the following information:\n\n- The class and UUID of the source (from) object.\n- The class and UUID of the target (to) object.\n- The name of the cross-reference property.\n\nAn example syntax is shown below:\n\n\n  \n\n  \n\n  \n  \n\n  \n\n  \n\n  \n    \n  \n\n  \n    \n  \n\n\n## Queries with cross-references\n\nOnce you have established cross-references between objects, you can use them to enhance your search queries. For example, you can use cross-references to:\n\n- Retrieve properties of target objects.\n- Filter objects based on properties of target objects.\n\n### Retrieve properties of a target object\n\nYou can retrieve properties of a target object just as you would retrieve properties of the source object.\n\nFor example, where a document chunk includes a cross-reference to its original document, you can use the cross-reference to retrieve properties of the original document. Accordingly, you can retrieve the title of the document or the author of the document, just as you would retrieve a property of the chunk itself such as the text of the chunk.\n\nTake a look at the snippet below in which we retrieve objects from the `JeopardyQuestion` class. Here, the `JeopardyQuestion` class contains the `hasCategory` cross-reference property, linking objects to the `JeopardyCategory` class. This query retrieves the `title` property of the target `JeopardyCategory` class, as well as the `question` property of the source `JeopardyQuestion` class.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n### Filter using cross-references\n\nYou can configure a filter to include or exclude objects based on properties of the target object.\n\nFor example, you can filter articles based on an attribute of the author, such as the author's name or the author's location.\n\nTake a look at the snippet below, This query looks through the `JeopardyQuestion` class, but the results are filtered using the `title` property of its cross-referenced `JeopardyCategory` class. The `title` property must include the substring `Sport`.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBecause cross-references do not affect vectors, you cannot use vector searches to filter objects based on properties of the target object.\n\nHowever, you could use two separate queries to achieve a similar result. For example, you could perform a vector search to identify `JeopardyCategory` objects that are similar to a given vector, resulting in a list of `JeopardyCategory` objects. You could then use the unique `title` properties of these objects in a second query filter the results as shown above. This will result in `JeopardyQuestion` objects that are cross-referenced to the `JeopardyCategory` objects identified in the first query.\n\n\n## Further information\n\n### Managing cross-references\n\nFor further information on how to manage cross-references, see the how-to guide on cross-references. It includes information on how to:\n\n- Create a cross-reference\n- Update a cross-reference\n- Delete a cross-reference\n- Retrieve a cross-reference\n\n- How-to search: Filters\n- API References: Objects # Cross-references\n", "type": "Documentation", "name": "tutorials-cross-references", "path": "developers/weaviate/tutorials/cross-references.mdx", "link": "https://weaviate.io/developers/weaviate/tutorials/cross-references", "timestamp": "2023-11-13 10:41:40", "reader": "JSON", "meta": {}, "chunks": []}