{"text": "\n\n## Overview\n\nWelcome to the **Quickstart guide** for Weaviate Cloud Services (WCS). Here, you will learn:\n- How to set up a Weaviate instance on WCS, and\n- How to instantiate a Weaviate client to communicate with the WCS instance.\n\n### Agenda\n\nBy the end of this tutorial, you will be familiar with the basics of WCS. You will have:\n- Created a WCS account,\n- Created a new free WCS sandbox instance without authentication,\n- Installed a Weaviate client of your choice, and\n- Queried your new WCS sandbox instance with the Weaviate client.\n\nAnd if you wish, you will be ready to move onto our Weaviate Quickstart tutorial next.\n\n## Sign in to WCS\n\n1. First, go to the WCS Console, and click on \"Sign in with the Weaviate Cloud Services\".\n    1. Click Sign in with the Weaviate Cloud Services.\n    1. If you don't have a WCS account, click on Register.\n1. Sign in with your WCS username and password.\n\n## Create a Weaviate Cluster\n\nTo create a new Weaviate Cluster, click the Create cluster button.\n\nThen:\n\n1. Select the Free sandbox tier.\n1. Provide a *Cluster name*. This will become a part of its URL, with a suffix added to ensure uniqueness.\n1. Set *Enable Authentication?* to YES.\n\nClick Create. This will take ~2 minutes and you'll see a tick ✔️ when finished.\n\nThis will start the process to create a new instance, and you will see a progress indicator.\n\n\n\nInstance creation should take a minute or two, and you will see a tick ✔️ when it's done, indicating that the instance is ready.\n\n#### Your cluster details\n\nTo access your cluster, you will need:\n- The Weaviate URL, and\n- Authentication details (Weaviate API key).\n\nClick Details to see them.\n\nFor the Weaviate API key, click on the API keys  button.\n\n\n\n\nIn the meantime, let's start installing a client library.\n\n## Install a client library\n\nWe suggest using a Weaviate client. To install your preferred client :\n\nimport ClientCapabilitiesOverview from '/_includes/client.capabilities.mdx'\n\n\n\nInstall your preferred client by following the relevant instructions below:\n\n\n\n\n## Connect to your WCS instance\n\nBy now, you should have:\n* Set up a sandbox instance of Weaviate on WCS, and\n* Installed a Weaviate client library.\n\nFrom the Details tab in WCS, get:\n- The Weaviate **API key**, and\n- The Weaviate **URL**.\n\nReplace the endpoint address and API key in the following code with your address and key, then run the code for your preferred client:\n\n\n\n\nYou should receive a response confirming the server is ready.\n\n```json\nTrue\n```\n\nCongratulations! You have successfully set up a cloud-based vector database with WCS.\n\n## Next\n\nNow that you are set up with a WCS instance:\n* If you are new to Weaviate at large, we recommend moving to the Weaviate Quickstart Tutorial.\n* Otherwise, we hope you enjoy your experience with WCS.\n\n## More resources\n\nWe want you to have the best experience possible here. So if you find that something here doesn't work, or doesn't make sense, please let us know! You can:\n- File an issue on GitHub, or\n- Talk to us on the community forum, or\n- Ping us on Slack\n\n\n\n", "type": "Documentation", "name": "wcs-quickstart", "path": "developers/wcs/quickstart.mdx", "link": "https://weaviate.io/developers/wcs/quickstart", "timestamp": "2023-11-02 10:52:11", "reader": "JSON", "meta": {}, "chunks": []}