{"text": "\n\n\n\n## Overview\n\n- Configuration: Modules\n- Concepts: Modules\n\nThis section describes Weaviate's individual modules, including their capabilities and how to use them.\n\n- The Vectorizer (also called Retrievers sometimes) modules such as `text2vec-*` or `img2vec-*` convert data objects and query inputs to vectors.\n- The (Re)Ranker modules such as `rerank-*` apply a(n) (additional) ranking process to the search results.\n- The Reader & Generator modules process data after retrieving the data from Weaviate, such as to answer questions or summarize text.\n- The other modules include everything else, such as a spellcheck module.\n\n## General\n\nModules can be \"vectorizers\" (defines how the numbers in the vectors are chosen from the data) or other modules providing additional functions like question answering, custom classification, etc. Modules have the following characteristics:\n- Naming convention:\n  - Vectorizer (Retriever module): `2vec--`, for example `text2vec-contextionary`, `img2vec-neural` or `text2vec-transformers`.\n  - Other modules: `--`, for example `qna-transformers`.\n  - A module name must be url-safe, meaning it must not contain any characters which would require url-encoding.\n  - A module name is not case-sensitive. `text2vec-bert` would be the same module as `text2vec-BERT`.\n- Module information is accessible through the `v1/modules//` RESTful endpoint.\n- General module information (which modules are attached, version, etc.) is accessible through Weaviate's `v1/meta` endpoint.\n- Modules can add `additional` properties in the RESTful API and `_additional` properties in the GraphQL API.\n- A module can add filters in GraphQL queries.\n- Which vectorizer and other modules are applied to which data classes is configured in the schema.\n\n## Default vectorizer module\n\nUnless you specify a default vectorization module in Weaviate's configuration, you'll need to specify which vectorization module is used per class you add to the data schema (or you need to enter a vector for each data point you add manually). Set the default with the environment variable `DEFAULT_VECTORIZER_MODULE` to `text2vec-contextionary` in the Docker Compose file:\n\n``` yaml\nservices:\n  weaviate:\n    environment:\n      DEFAULT_VECTORIZER_MODULE: text2vec-contextionary\n```\n\n## Backup Modules\n\nBackup and restore operations in Weaviate are facilitated by the use of backup provider modules.\n\nThese are interchangeable storage backends which exist either internally or externally. The following sections will explain the difference between these two types of backup provider modules, and their intended usages.\n\n### External provider\n\nExternal backup providers coordinate the storage and retrieval of backed-up Weaviate data with external storage services.\n\nThis type of provider is ideal for production environments. This is because storing the backup data outside of a Weaviate instance decouples the availability of the backup from the Weaviate instance itself. In the event of an unreachable node, the backup is still available.\n\nAdditionally, multi-node Weaviate clusters _require_ the use of an external provider. Storing a multi-node backup on internally on a single node presents several issues, like significantly reducing the durability and availability of the backup, and is not supported.\n\nAs of Weaviate `v1.18`, the supported external backup providers are:\n- S3\n- GCS\n- Azure\n\nThanks to the extensibility of the module system, new providers can be readily added. If you are interested in an external provider other than the ones listed above, feel free to reach out via our forum, or open an issue on GitHub.\n\n### Internal provider\n\nInternal providers coordinate the storage and retrieval of backed-up Weaviate data within a Weaviate instance. This type of provider is intended for developmental or experimental use, and is not recommended for production. Internal Providers are not compatible for multi-node backups, which require the use of an external provider.\n\nAs of Weaviate `v1.16`, the only supported internal backup provider is the filesystem provider.\n\n\n\n\n", "type": "Documentation", "name": "weaviate-modules", "path": "developers/weaviate/modules/index.md", "link": "https://weaviate.io/developers/weaviate/modules", "timestamp": "2023-11-02 10:53:13", "reader": "JSON", "meta": {}, "chunks": []}