{"text": "\nWeaviate attracts different users with various backgrounds. Some have been working with containers for years, but we understand that not everyone has. Inspired by a few recent questions and comments about Docker on the Weaviate Slack, I've set out to write an article to provide a better background on Docker and containers in general. After reading this article, your most common questions about these technologies should be answered and there should be nothing in the way of building amazing use cases with Weaviate.\n\nIn this short overview, we will:\n\n* look at what \"Docker\" and \"Docker Compose\" is,\n* why Weaviate relies on Docker,\n* what you need to do to get started,\n* … and answer a few more container-related questions that we encounter regularly.\n\n## What is Docker?\n> Docker is a […] [set of products] that use OS-level virtualization to deliver software in packages called containers.\n> Wikipedia)\n\nYou can think of docker containers as lightweight virtual machines. Each container has its own file system, own OS libraries and software. This provides a lot of isolation. At the same time, containers share the host system's kernel, so the overhead is much smaller than with regular virtual machines.\n\nThe best practice around docker containers dictates that one container only contains a single application. Typically the lifecycle of the container depends on this one process. If the process exits, the container is stopped.\n\n## What is Docker Compose?\nBecause one container contains only a single app, we need a way to \"tie many containers together\". Docker Compose is a tool that can run custom manifests, so called \"Docker Compose files\", together. Instead of starting or stopping a single container, you can start all the containers in one go. This is very helpful to conveniently tie individual services together, for example when an application's architecture consists of individual micro services. This is the case with Weaviate — especially when multiple modules are involved.\n\n## Why does Weaviate use Docker & Docker Compose?\nThere are many arguments for or against containerization, we have decided to go with Docker & Docker Compose in the Weaviate stack for the following reasons:\n\n* **Portability**: Whether you're running on Windows, Linux, macOS or yet another OS, Weaviate is only compiled for a single Linux distribution. The Docker container makes sure that from Weaviate's perspective it's always running on a well-known Linux — even if your Host machine is running a completely different OS.\n* **Isolation & Predictability**: Weaviate is a compiled binary that has zero runtime dependencies, but if you use Weaviate modules which rely on third-party tools, such as Hugging Face Transformers, PyTorch or Tensorflow, they have a set of runtime dependencies. Thanks to containers, all runtime dependencies (Python version, python packages, OS libraries, etc.) are guaranteed to be present and at the right version in each container.\n* **Distribution via Docker Hub**: Docker Hub makes it very easy to distribute public images. With a single `docker pull semitechnologies/weaviate:latest` command you can always obtain the latest version — without any prior configuration. Additionally, each container can have an exact version number, making it easy to switch between versions or upgrade your setup. Instead of a lengthy and risky update process, you can simply exchange the entire container for that of a newer version.\n\n## What do I need to install before running Weaviate?\nYou need to make sure that you have both the `docker` and the `docker compose CLI` tools installed. Depending on your operating system, these might be two separate installation process. Here are the guides for the most common operating systems:\n\n* Docker Desktop for Mac (both `docker` and `docker compose` )\n* Docker Desktop for Windows (both `docker` and `docker compose` )\n* Docker for Ubuntu Linux (only `docker` and its dependencies)\n* Docker Compose for (Ubuntu) Linux\n\n## How do I obtain Weaviate Docker images?\nUsually, there is no need to obtain individual images, as we distribute entire `docker-compose.yml` files. See next step.\n\n## How do I obtain a Weaviate Docker Compose file?\nWeaviate Configuration Tool\n*An example of the Weaviate Customizer which produces a complete Docker Compose file — tailored to your needs.*\n\nThe easiest way to obtain a `docker-compose.yml` is to use the Weaviate configuration tool on our website. It will ask you a few questions about what you plan to do with Weaviate and customize a Compose file (including all module containers, if you select any) in the last step.\n\nIf you don't want to use the customizer you can also copy/paste one of the example files from the documentation.\n\n## How do I start up the Docker Compose file I just obtained?\nMake sure that:\n\n* You are in the same folder you downloaded the file to\n* The file you downloaded is named exactly docker-compose.yml\n\nYou can now start up with the whole setup by running:\n\n```bash\ndocker compose up -d\n```\n\nThe `-d` means \"detach\" and means that your terminal will not attach to the log outputs of all the containers. To attach to the logs of a specific containers you can run:\n\n```bash\ndocker compose logs -f \n```\n\nfor example:\n\n```bash\ndocker compose logs -f weaviate\n```\n\nYou can also omit the -d option and keep your terminal attached to all logs.\n\nTo see the names and status of each container you can run:\n\n```bash\ndocker compose ps\n```\n\n## How do I know when Weaviate is up and ready?\nWeaviate implements a readiness check at `GET /v1/.well-known/ready`. It will return a `2xx` HTTP status code once everything is ready.\n\nTo check for the readiness programmatically you can use `curl` in this simple `bash` loop:\n\n```bash\nuntil curl --fail -s localhost:8080/v1/.well-known/ready; do\n  sleep 1\ndone\n```\n\nMake sure to adjust localhost:8080 if you are running on a different bind address.\n\n## Can I run Weaviate without Docker / Containerization?\nWe do not officially support running Weaviate in a non-containerized fashion, but it is certainly possible. To do so, you have to compile Weaviate for your desired target OS and architecture. Weaviate is written in Golang, so you need to have a working Go runtime. See the official documentation for more details.\n\n## Can Weaviate run on Kubernetes? Is Helm supported?\nYes, see next step.\n\n## When should or shouldn't I use Docker Compose?\nDocker Compose is quick, easy and convenient, but there are situations that it isn't suited for. We recommend to use a Docker Compose setup for trying out or evaluating Weaviate and when developing with Weaviate locally.\n\nHowever, for a stable production environment, we recommend to run Weaviate on Kubernetes. You can use Helm, there is an officially supported Weaviate Helm Chart.\n\n## Where to go from here?\nCongratulations, you now have a lot of background on Docker and containerization in general! Now there's nothing in the way of Getting Started with Weaviate and begin building amazing apps with Weaviate.\n\nYou can reach out to us on Slack or Twitter, or join the community forum.\n\nimport Ending from '/_includes/blog-end-oss-comment.md'\n\n\n", "type": "Blog", "name": "blog-docker-and-containers-with-weaviate", "path": "blog/2021-05-19-docker-and-containers-with-weaviate/index.mdx", "link": "https://weaviate.io/blog/docker-and-containers-with-weaviate", "timestamp": "2024-02-08 21:22:14", "reader": "JSON", "meta": {}, "chunks": []}