{"text": "\nCelebrating Hacktoberfest 2023 with Weaviate\n\nAt Weaviate, we love open source! Join us in celebrating Hacktoberfest, a month-long celebration of open source!\nParticipants with four pull requests (PR) accepted between **October 1 - 31, 2023** will receive a unique digital reward from Hacktoberfest.\n\n\n## The Task\n\nWelcome to our demo sprint!\n\nIt is aimed at onboarding engineers and machine learning practitioners to open-source. In our example use cases and demos page, we showcase what you can do with a vector database. Some of these demos have received more love than others recently, and we want to give them a little polish.\n\nUntitled\n\nThe gallery contains demos using Weaviate in different states. Here is an example of a demo project in a good state. While some may only need a little polish of the description (README.md file), others are e.g., a little older or can use a little makeover for the user interface.\n\nThe steps to your first Hacktoberfest PR are simple:\n\n1. Find an issue you're interested in: Go to the example use cases and demos page and select a project marked for Hacktober with a 🎃 sign. Click on “code” to get to the repository and have a look at its issues.\n\n\n  \nYour browser does not support the video tag.\n\n\n\n2. Ping us on the project’s issue, saying you're interested and which parts of the issue you would like to contribute to.\n3. Open the PR as instructed in the Weaviate Contributor Guide. We will review and help you out in the process. 💚\n\nYou can also contribute by adding your own Weaviate examples. If you have other great ideas for contributions, let us know on our Discourse and Slack channels, and we will figure out how to highlight it in Hacktoberfest.\n\nYou don't need to be an expert to contribute to these demo projects!\n\n\n## Resources to Get Started\n\nWe're thrilled to help you make your first open-source contribution! Here are some helpful resources to kickstart your journey:\n\nWhat is Open Source, and how do you contribute to it?\n\n- 🎯 What is Open Source\n- 🎯 Introduction to GitHub and Open-Source Projects\n- 🎯 How to Contribute to Open Source\n- 🎯 GitHub Contribution Guide by Hugging Face\n- 🎯 How to Use Git\n- 🎯 Weaviate Contributor Guide\n\nIf you're new to Weaviate, get up and running quickly with these beginner-friendly guides:\n\n- Quickstart Guide 🚀\n- Weaviate Academy 🎓\n\nDive deeper into specific topics with these detailed guides:\n\n- How-to Search Guides 🔍\n- Keyword, Vector, Hybrid, and Generative Search 🔍\n- How-to Manage Data (CRUD Operations) 💾\n- Tutorial: Importing Data with Your Own Vectors 📊\n- Weaviate Architecture Concepts 🏛️\n\nJoin one of our workshops for an introduction to Weaviate.\n\n- 4th October 2023 (20:00-21:00 UTC+2): Introduction to Weaviate with Zain Hasan, Senior Dev Advocate @ Weaviate\n- 5th October 2023 (17:00-18:00 UTC+2): NEW Python `Collections` Client API Preview with JP Hwang - Educator @ Weaviate\n- 18th October 2023 (15:00-16:00 UTC+2): Introduction to Weaviate with JP Hwang - Educator @ Weaviate\n\nExpand your knowledge with these supplementary resources:\n\n- Weaviate YouTube Channel 📺\n- Weaviate Blog 📰\n- Weaviate Recipes 🍳\n\n\n## What's in it for you?\n\nThe repositories you contribute to participate in Hacktoberfest and are a great opportunity for your first-ever Hacktoberfest PR. We will also assist you throughout the whole process.\n\nYou might even receive some swag in the end.\n\n\n## Connect with the Weaviate Community!\n\nTo make your Hacktoberfest experience successful, connect with the Weaviate community for collaboration and assistance. You can reach us through:\n\n- Join our dedicated Hacktoberfest channel in our Discourse community forum, where we're ready to answer your questions.\n- Join our dedicated #hacktoberfest channel in our Weaviate Community Slack channel to stay connected and receive real-time support.\n- Join our newsletter and follow us on Twitter and Linkedin to receive updates.\n- Stay up to date with Weaviate's development by exploring the Weaviate GitHub Repository. Don’t forget to give us a ⭐️ while you are there!\n\nShare your process online and tag us on Twitter and LinkedIn. Use the hashtag #hacktoberfest2023 for increased visibility.\n\n\n## FAQ\n\n- **Will this count towards Hacktoberfest?** Yes, it definitely does! If your PR/MR is created between **October 1** and **October 31** (in any time zone, UTC-12 thru UTC+14), we will add the \"HACKTOBERFEST-ACCEPTED\" label to it.\n- **Where do I get help?** For any questions or assistance, contact us on our Discourse and Slack channels.\n- **I have a cool contribution idea. Can I still participate?** Awesome! Connect with us on our Discourse or Slack channels and we will figure it out.\n- **I don’t know how to write code. Can I still contribute?** Yes, of course! You can make no-code contributions, e.g., by updating the README.md files. If you want to learn how to write code with a concrete example, we can help you find a good issue. Just ping us on our Discourse or Slack channels.\n\n---\n\nHappy hacking, and let's make Hacktoberfest 2023 a memorable one together! 🚀\n\nJump right in and have a look at our example use cases and demos page.\n", "type": "Blog", "name": "blog-hacktoberfest-2023", "path": "blog/2023-10-02-hacktoberfest-2023/index.mdx", "link": "https://weaviate.io/blog/hacktoberfest-2023", "timestamp": "2023-11-13 10:42:33", "reader": "JSON", "meta": {}, "chunks": []}