{"text": "\n**Amsterdam NL - September 1, 2022**\n\nWeaviate, the leader in open-source vector database technology, announces an entirely new pricing model for its Weaviate Cloud Services.\n\nInspired by \"pay-as-you-grow\" pricing used in cloud storage, Weaviate has introduced a new business model that makes it easier and more affordable for enterprises of any scale to take advantage of its Weaviate vector database. Beginning today, users have the option of paying a usage-based rate for search on a per-dimension basis. Pricing begins at $0.05 per million dimensions. (No, that's not a typo; the rate is five cents per million.)\n\n> \"At this point, as we've reached 1,500,000 downloads, a lot of people know and love our open-source software, but they want us to run it for them,\" says Weaviate's co-founder Bob van Luijt.\" So, we've created a ‘NoOps' option that allows them to pay only for what they use on our optimized Weaviate Cloud Services.\"\n\nIn addition to remarkably convenient access to the latest vector database capabilities, Weaviate Cloud Services customers get dedicated customer support on a private Slack channel. However, consistent with Weaviate's commitment to creating truly open-source software, customers using the free service will always be able to access all of the Weaviate's vector database capabilities.\n\nWeaviate vector database is an example of a \"third wave\" database technology. Data is processed by a machine learning model first, and AI models help in processing, storing, and searching through the data. As a result, Weaviate excels at answering questions in natural language, but it is not limited to language; it is as adaptable to searching images or even genetic information.\n\n> \"Depending on the machine-learning model used, a \"document\"—basically a data object—in a vector database typically has anywhere from 120 to 12,800 dimensions,\" van Luijt explains. \"Since vector dimensions are the lowest common denominator, it makes sense for vector dimensions to be the cost basis, as opposed to API calls. We feel that this very transparent and predictable pricing model is consistent with our open-source philosophy.\"\n\nFor more information about Weaviate an open-source vector database, visit: https://weaviate.io\n\nFor more information about the company visit: about-us.\n\nCustomers interested in the Weaviate Cloud Services can purchase service for $0.05 per million dimensions. Or, spend an entire dollar and get 20 million dimensions.", "type": "Blog", "name": "blog-weaviate-cloud-service", "path": "blog/2022-09-01-weaviate-cloud-service/index.mdx", "link": "https://weaviate.io/blog/weaviate-cloud-services", "timestamp": "2024-02-08 21:22:18", "reader": "JSON", "meta": {}, "chunks": []}